{
  "slug": "aklea-a5e",
  "desc": "",
  "name": "Aklea",
  "size": "Gargantuan",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 21,
  "armor_desc": "",
  "hit_points": 656,
  "hit_dice": "32d20+320",
  "speed": {
    "walk": 60,
    "fly": 60
  },
  "strength": 30,
  "dexterity": 24,
  "constitution": 30,
  "intelligence": 22,
  "wisdom": 24,
  "charisma": 26,
  "strength_save": 17,
  "dexterity_save": null,
  "constitution_save": 17,
  "intelligence_save": 13,
  "wisdom_save": 14,
  "charisma_save": 15,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "radiant; damage from nonmagical weapons",
  "condition_immunities": "",
  "senses": "truesight 120 ft., passive Perception 17",
  "languages": "Celestial, Common, six more",
  "challenge_rating": "22",
  "cr": 22,
  "actions": [
    {
      "name": "Maul",
      "desc": "Melee Weapon Attack: +17 to hit, reach 10 ft., one target. Hit: 38 (8d6 + 10) bludgeoning damage plus 14 (4d6) radiant damage  and the target makes a DC 25 Strength saving throw. On a failure  the target is pushed up to 30 feet away and knocked prone."
    },
    {
      "name": "Lightning Bolt (3rd-Level; V, S)",
      "desc": "A bolt of lightning 5 feet wide and 100 feet long arcs from the empyrean. Each creature in the area makes a DC 23 Dexterity saving throw  taking 28 (8d6) lightning damage on a failure or half damage on a success."
    },
    {
      "name": "Flame Strike (5th-Level; V, S)",
      "desc": "A column of divine flame fills a 10-foot-radius  40-foot-high cylinder within 60 feet. Creatures in the area make a DC 23 Dexterity saving throw  taking 14 (4d6) fire damage and 14 (4d6) radiant damage on a failure or half damage on a success."
    },
    {
      "name": "Hold Monster (5th-Level; V, S, Concentration)",
      "desc": "One creature the empyrean can see within 60 feet makes a DC 23 Wisdom saving throw. On a failure  the target is paralyzed for 1 minute. The target repeats the saving throw at the end of each of its turns  ending the effect on a success."
    }
  ],
  "bonus_actions": [
    {
      "name": "Immortal Form",
      "desc": "The empyrean magically changes its size between Gargantuan and Medium. While Medium, the empyrean has disadvantage on Strength checks. Its statistics are otherwise unchanged."
    }
  ],
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": [
    {
      "name": "The empyrean can take 1 legendary action",
      "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."
    },
    {
      "name": "Attack",
      "desc": "The empyrean makes a weapon attack."
    },
    {
      "name": "Cast Spell",
      "desc": "The empyrean casts a spell. The empyrean can't use this option if it has cast a spell since the start of its last turn."
    },
    {
      "name": "Fly",
      "desc": "The empyrean flies up to half its fly speed."
    },
    {
      "name": "Shout (Recharge 5-6)",
      "desc": "Each creature within 120 feet that can hear the empyrean makes a DC 25 Constitution saving throw. On a failure, a creature takes 24 (7d6) thunder damage and is stunned until the end of the empyreans next turn. On a success, a creature takes half damage."
    }
  ],
  "special_abilities": [
    {
      "name": "Divine Grace",
      "desc": "If the empyrean makes a saving throw against an effect that deals half damage on a success, it takes no damage on a success and half damage on a failure. Furthermore, while wearing medium armor, the empyrean adds its full Dexterity bonus to its Armor Class (already included)."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The empyreans innate spellcasting ability is Charisma (spell save DC 23). It can innately cast the following spells, requiring no material components: At will: charm person, command, telekinesis, 3/day: flame strike, hold monster, lightning bolt, 1/day: commune, greater restoration, heroes feast, plane shift (self only, can't travel to or from the Material Plane)"
    }
  ],
  "spell_list": [],
  "page_no": 405,
  "environments": [],
  "img_main": null,
  "document__slug": "menagerie",
  "document__title": "Level Up Advanced 5e Monstrous Menagerie",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://www.levelup5e.com",
  "v2_converted_path": "/v2/creatures/mmenag_aklea/"
}