{
  "slug": "ancientcavedragon-tob1-2023",
  "desc": "False",
  "name": "Ancient Cave Dragon",
  "size": "Gargantuan",
  "type": "Dragon",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 20,
  "armor_desc": "natural armor",
  "hit_points": 507,
  "hit_dice": "26d20 + 234",
  "speed": {
    "walk": 40,
    "burrow": 40
  },
  "strength": 30,
  "dexterity": 12,
  "constitution": 29,
  "intelligence": 14,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 9,
  "constitution_save": 17,
  "intelligence_save": null,
  "wisdom_save": 11,
  "charisma_save": 12,
  "perception": 29,
  "skills": {
    "Perception": 19,
    "Stealth": 9
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, poisoned",
  "senses": "blindsight 60 ft., tremorsense 120 ft., passive Perception 29",
  "languages": "Common, Darakhul, Draconic",
  "challenge_rating": "25",
  "cr": 25,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence. It then makes three attacks: one with its Bite and two with its Claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +18 to hit, reach 15 ft., one target. Hit: 21 (2d10 + 10) piercing damage plus 14 (4d6) poison damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +18 to hit, reach 10 ft., one target. Hit: 17 (2d6 + 10) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +18 to hit, reach 20 ft., one target. Hit: 19 (2d8 + 10) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 20 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Poison Breath (Recharge 5-6)",
      "desc": "The dragon exhales a cone of black, poisonous gas in a 90-foot cone. Each target in that area must make a DC 25 Constitution saving throw. On a failure, a creature takes 91 (26d6) poison damage and is poisoned until cured by the greater restoration spell or similar magic. On a success, a creature takes half the damage and isn't poisoned."
    }
  ],
  "bonus_actions": [],
  "reactions": [
    {
      "name": "Ruff Spikes",
      "desc": "When a creature moves to a space within 10 feet of the cave dragon, the dragon flares its many feelers and spikes. The creature must succeed on a DC 25 Dexterity saving throw or take 13 (3d8) piercing damage and be prevented from entering that space."
    }
  ],
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a Tail attack."
    },
    {
      "name": "Limb Sweep (Costs 2 Actions)",
      "desc": "The dragon sweeps its wingless limbs outward. Each creature within 10 feet of the dragon must succeed on a DC 25 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be pushed up to 10 feet away from the dragon and knocked prone."
    }
  ],
  "special_abilities": [
    {
      "name": "Darkness Aura",
      "desc": "The cave dragon emits magical darkness in a 30-foot radius around it. The darkness moves with the dragon and spreads around corners. Darkvision can't penetrate this darkness, and no natural light can illuminate it. If any of the darkness overlaps with an area of light created by a spell of 4th level or lower, the spell creating the light is dispelled. At the start of each of its turns, the dragon chooses whether this aura is active. A successful dispel magic (DC 15) cast on the dragon suppresses this aura for 1 minute."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magical Tunneler",
      "desc": "The cave dragon can burrow through any unworked earth and stone. While doing so, the dragon can choose whether to leave the material it moves through undisturbed or leave a 15-foot diameter tunnel in its wake."
    },
    {
      "name": "Spiked Climb",
      "desc": "The dragon uses its spikes to hold itself in place while climbing, allowing it to climb difficult surfaces, including upside down on ceilings, without needing to make an ability check. If it climbs upside down on a ceiling or suspends itself on a vertical surface while leaving its claws free, it can't use the Ruff Spikes reaction."
    }
  ],
  "spell_list": [],
  "page_no": 113,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_ancient-cave-dragon/"
}