{
  "slug": "animated-instrument-symphony",
  "desc": "",
  "name": "Animated Instrument, Symphony",
  "size": "Gargantuan",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 201,
  "hit_dice": "13d20+65",
  "speed": {
    "walk": 30,
    "fly": 30
  },
  "strength": 12,
  "dexterity": 18,
  "constitution": 20,
  "intelligence": 10,
  "wisdom": 8,
  "charisma": 22,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": 1,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": 1,
  "perception": -1,
  "skills": {
    "perception": -1
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, slashing",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned",
  "senses": "blindsight 120' (blind beyond), passive Perception 9",
  "languages": "understands Common but can't speak",
  "challenge_rating": "15",
  "cr": 15,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "Uses Musical Arrangement. Then two Hammer Note or Pulsating Cacophony attacks."
    },
    {
      "name": "Hammer Note",
      "desc": "Melee Weapon Attack: +9 to hit 5 ft. 1 tgt in the swarm's space. 36 (8d8) bludgeoning damage or 18 (4d8) bludgeoning damage if symphony has half its hp or fewer."
    },
    {
      "name": "Pulsating Cacophony",
      "desc": "Ranged Spell Attack: +11 to hit, 60 ft., one target, 22 (4d10) thunder + 13 (2d12) psychic or 11 (2d10) thunder + 6 (1d12) psychic if the symphony has half its hp or fewer."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": [
    {
      "name": "Move",
      "desc": "Moves up to its speed with o provoking opportunity attacks."
    },
    {
      "name": "Harmonize (2)",
      "desc": "Tunes its worn-out instruments back to working harmony regaining 20 hp and ending one condition affecting it."
    },
    {
      "name": "Orchestral Flourish (2)",
      "desc": "Plays a short fierce melody. Each creature within 10 ft. of symphony including creatures in its space:  10 (3d6) thunder (DC 19 Con half)."
    },
    {
      "name": "Syncopated Melody (3)",
      "desc": "Mimics a spell that was cast since the end of its last turn. It makes a Performance check where the DC is the caster's DC+the level of the spell symphony is trying to mimic. If successful symphony casts the spell using original caster's DC and spell attack bonus."
    }
  ],
  "special_abilities": [
    {
      "name": "Antimagic Susceptibility",
      "desc": "Incapacitated while in the area of an antimagic field. If targeted by dispel magic instrument must succeed on a Con save vs. caster's spell save DC or fall unconscious for 1 min. Has advantage on this save."
    },
    {
      "name": "Construct Nature",
      "desc": "Doesn't require air food drink or sleep."
    },
    {
      "name": "False",
      "desc": "[+]Appearance[/+] Motionless and not flying: indistinguishable from large musical instrument collection and performance paraphernalia."
    },
    {
      "name": "Grand Composition",
      "desc": "While it occupies another creature's space that creature has disadvantage on Con saves to maintain concentration and creature can't cast spells with verbal components."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "Choose to succeed failed save."
    },
    {
      "name": "Magic Resistance",
      "desc": "Advantage: spell/magic effect saves."
    },
    {
      "name": "Swarm",
      "desc": "Can occupy another creature's space and vice versa and symphony can move through any opening large enough for a Small musical instrument. Except for the Harmonize legendary action symphony can't regain hp or gain temp hp."
    },
    {
      "name": "Musical Arrangement",
      "desc": "Plays one of the following:Ballet of Quickening Steps Lilting ballet that picks up pace in startling fashion increasing its movement speed by 10 ft. and allowing it to take the Dodge action as a bonus action on each of its turns. Lasts 1 min or until symphony plays a different song.Harrowing Hymn Foreboding verse. Each creature within 30' of symphony that can hear it: DC 19 Wis save or frightened for 1 min. A creature can re-save at end of each of its turns success ends effect on itself. If creature's save succeeds or effect ends for it creature immune to symphony's Harrowing Hymn for next 24 hrs.Concerto for the Luckless Piece pits nearby listeners vs. their own misfortunes. Each creature within 60' of symphony and can hear it: DC 19 Cha save or be cursed 1 min. While cursed creature can't add its proficiency bonus to attack rolls or ability checks. If cursed creature rolls a 20 on attack roll or ability check curse ends. Curse can be lifted early by remove curse spell or similar magic.Four Winds Canon Trumpets gale force winds in a 90' cone. Each creature in that area: creature is pushed up to 30' away from symphony and knocked prone (DC 19 Str creature is knocked prone but isn't pushed). Winds also disperse gas or vapor and it extinguishes candles torches and similar unprotected flames in the area. It causes protected flames such as those of lanterns to dance wildly and has a 50% chance to extinguish them."
    }
  ],
  "spell_list": [],
  "page_no": 34,
  "environments": [],
  "img_main": null,
  "document__slug": "tob3",
  "document__title": "Tome of Beasts 3",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-3-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob3_animated-instrument-symphony/"
}