{
  "slug": "august-rooster",
  "desc": "An amalgam of various bird species crows proudly as it hops forward._  \n**Chimeric Avian.** The body of an august rooster is nearly human-sized with the head of a pheasant, the body of a perching duck, the tail of a peacock, the legs of a heron, the beak of a parrot, and the wings of a swallow. There is wide variation among specimens of this hybrid, however, with different creators replacing portions of the creature depending on the material they have on hand during the creation process. Most august roosters are created entirely of avian material, though specimens evidencing snake necks, turtle shells, and stag bodies have been encountered. Once created, an august rooster can reproduce with any species of bird, which usually results in an exotic-looking example of the bird. Only three percent of eggs fertilized or laid by an august rooster hatch into another august rooster. An august rooster fused by magic is full grown at creation, while one that hatches naturally grows to adulthood over the span of six to eight months.  \n**Selfish and Self-serving.** August roosters display the basest instincts of their creators, and they have the mental faculties and temperament of a spoiled, malicious child. Their sole concern is their own comfort, and they use their natural gifts to force nearby humanoids to tend to their wants and needs. Young august roosters are brazen about their collections of servants, often working the servants to exhaustion with constant demands. More mature individuals have a strong sense of self-preservation and have their servants see to their needs only when they know it will not raise suspicion.",
  "name": "August Rooster",
  "size": "Medium",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 75,
  "hit_dice": "10d8+30",
  "speed": {
    "walk": 25
  },
  "strength": 10,
  "dexterity": 17,
  "constitution": 16,
  "intelligence": 8,
  "wisdom": 7,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "psychic",
  "damage_immunities": "",
  "condition_immunities": "charmed",
  "senses": "passive Perception 8",
  "languages": "Common",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The august rooster makes two talon attacks."
    },
    {
      "name": "Talon",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "2d6+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Aura of Subservience",
      "desc": "A beast or humanoid that ends its turn within 30 feet of the august rooster and can see or hear it must succeed on a DC 14 Wisdom saving throw or be charmed for 1 day. A charmed creature that moves more than 100 feet away from the august rooster ceases to be charmed. If the august rooster requests that a charmed creature do more than tend to the creature's own needs, pay devotion to the august rooster, or bring the rooster food and gifts, the charmed creature can make a new saving throw with advantage. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the august rooster's Aura of Subservience for 24 hours."
    },
    {
      "name": "Dive Bomb",
      "desc": "If the august rooster is flying and moves at least 20 feet straight toward a target and then hits it with a talon attack on the same turn, the target takes an extra 7 (2d6) slashing damage."
    },
    {
      "name": "Jumper",
      "desc": "The august rooster can fly up to 40 feet on its turn, but it must start and end its movement on a solid surface such as a roof or the ground. If it is flying at the end of its turn, it falls to the ground and takes falling damage."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The august rooster's innate spellcasting ability is Charisma (spell save DC 14). The august rooster can innately cast the following spells, requiring no material components.\nAt will: dancing lights, mage hand, message, vicious mockery\n3/day each: bane, charm person, hideous laughter\n1/day each: healing word, hold person"
    }
  ],
  "spell_list": [],
  "page_no": 33,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_august-rooster/"
}