{
  "slug": "bloodsapper",
  "desc": "This hairless, dog-like creature has pale skin, an enormous bladder underneath its throat, and a conical head with two deepset, black eyes. A long, thick red tongue, ending in a hollow spike, flicks from its shrew-like mouth._  \n**Ravenous Blood Eaters.** The bloodsapper is a vampiric creature with an unrelenting thirst for blood. While it can drink the blood of animals and wild beasts, it vastly prefers the blood of sapient bipedal creatures, such as giants and humanoids. When it catches prey, it uses its long, spiked tongue to impale and drain them until they are little more than husks. Due to its appetite, the bloodsapper frequently comes into conflict with other creatures reliant on blood such as Open Game License",
  "name": "Bloodsapper",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 90,
  "hit_dice": "12d8+36",
  "speed": {
    "walk": 40,
    "climb": 20
  },
  "strength": 16,
  "dexterity": 14,
  "constitution": 16,
  "intelligence": 5,
  "wisdom": 12,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 5,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 4,
    "survival": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "understands Common but can’t speak",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Draining Tongue",
      "desc": "Melee Weapon Attack: +5 to hit, reach 15 ft., one target. Hit: 12 (2d8 + 3) piercing damage, and the bloodsapper attaches to the target. While attached, the bloodsapper doesn't attack. Instead, at the start of each of the bloodsapper's turns, the target loses 12 (2d8 + 3) hp due to blood loss. The bloodsapper can detach itself from a target by spending 5 feet of its movement, which it does once it has drained 25 hp from the target or the target dies. A creature, including the target, can take its action to detach the bloodsapper's tongue by succeeding on a DC 14 Strength check. Alternatively, the bloodsapper's tongue can be attacked and severed (AC 12; hp 20). The bloodsapper regrows a severed tongue when it completes a long rest or when it reduces a creature to 0 hp.",
      "attack_bonus": 5,
      "damage_dice": "2d8+3"
    },
    {
      "name": "Bloody Breath (Recharge Special)",
      "desc": "The bloodsapper can expel a 15-foot cone of acrid gas and blood from its bladder. Each creature in the area must make a DC 13 Constitution saving throw. On a failure, a creature takes 14 (4d6) acid damage and is poisoned for 1 minute. On a success, a creature takes half the damage and isn't poisoned. A poisoned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Once a bloodsapper uses its Bloody Breath, it can't use Bloody Breath again until it has drained at least 25 hp of blood from a creature."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Blood Scent",
      "desc": "A bloodsapper can smell blood within 240 feet of it. It can determine whether the blood is fresh or old and what type of creature shed the blood. In addition, the bloodsapper has advantage on Wisdom (Perception) and Wisdom (Survival) checks to find or track a creature that doesn't have all its hp."
    }
  ],
  "spell_list": [],
  "page_no": 44,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_bloodsapper/"
}