{
  "slug": "bulbous-violet",
  "desc": "An enormous deep purple flower pushes forward on its vines, which are covered in throbbing black protrusions. As it moves, a single protrusion bursts open, spraying a green, sizzling substance all over the forest floor._  \n**Meat Drinkers.** Bulbous violets are carnivorous plants. The black growths that cover their vines are filled with acid and pop on impact, dissolving the violets’ prey. The plants then stand in the remains and drink in the liquefied gore.  \n**Migrating Predators.** Bulbous violets travel in packs that follow warm weather. Although they can survive the cold, most of their prey disappears in the colder months, forcing the plants to travel for food. Sometimes these paths take the plants through farms where the plants attack livestock and people. If the violets find food, they stop their migration, hunting every morsel they can find before moving on. Violets can sense the nearby presence of creatures made of flesh. This magical ability guides their migration route and leads them into unexpected places.  \n**Germinating in Gore.** In order to grow, bulbous violet seeds need to be sown in ground that has been covered in the blood, entrails, and corpses of other creatures. When a pack of violets is ready to drop their seeds, they go into areas crowded with prey and begin killing all they can. They attack monster hideouts, animal herds, and even villages to provide enough sustenance for their seeds.",
  "name": "Bulbous Violet",
  "size": "Medium",
  "type": "Plant",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 12,
  "armor_desc": null,
  "hit_points": 38,
  "hit_dice": "7d8+7",
  "speed": {
    "walk": 20,
    "climb": 20
  },
  "strength": 15,
  "dexterity": 14,
  "constitution": 13,
  "intelligence": 2,
  "wisdom": 10,
  "charisma": 2,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "acid",
  "condition_immunities": "",
  "senses": "passive Perception 10",
  "languages": "—",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Tendril",
      "desc": "Melee Weapon Attack: +4 to hit, reach 10 ft., one target. Hit: 4 (1d4 + 2) bludgeoning damage plus 2 (1d4) acid damage, and the target is grappled (escape DC 12). Until this grapple ends, the target is restrained and takes 2 (1d4) acid damage at the start of each of its turns. The violet has two tendrils strong enough to grapple creatures; each can grapple only one target. If the acid damage reduces the target to 0 hp, the violet regains 7 (2d6) hp.",
      "attack_bonus": 4,
      "damage_dice": "1d4+2"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Acid Sacs",
      "desc": "When the violet takes bludgeoning, piercing, or slashing damage, each creature within 5 feet of the violet must succeed on a DC 12 Dexterity saving throw or take 2 (1d4) acid damage."
    },
    {
      "name": "False Appearance",
      "desc": "While the violet remains motionless, it is indistinguishable from other large flowering plants."
    },
    {
      "name": "Flesh Sense",
      "desc": "The violet can pinpoint, by scent, the location of flesh-based creatures within 60 feet of it."
    }
  ],
  "spell_list": [],
  "page_no": 53,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_bulbous-violet/"
}