{
  "slug": "carrion-beetle",
  "desc": "_The beetles wore golden bridles and carried huge leather sacks of stone and guano. They marched without stopping; dozens, even hundreds, bringing fresh earth to the white-fungus trees of the great forests. Their claws skittered with a sound like horseshoes slipping on stone, but their multiple legs ensured they never fell. The air around them singed the nostrils with the taint of acid._  \n**Beasts of Burden and War.** Carrion beetles are powerful beasts of burden with strong jaws and the ability to both climb and burrow. With a wide back, serrated, spiky forelegs, and a narrow head, the carrion beetle is too large to ride on very comfortably although it makes an excellent platform for ballistae and howdahs. Its thick exoskeleton varies from drab brown, tan, and black to shimmering blue green, purple-green, and a highly prized yellow‑orange.  \nThe largest carrion beetles make a distinctive wheezing sound when their spiracles are stressed; this noise creates a hum when multiple beetles run or charge on the field of battle. War beetles are often armored with protective strips of metal or chitinous armor fused to their exoskeletons, increasing their natural armor by +2 while reducing their speed to 20 feet.  \n**Devour Fungi and Carrion.** Carrion beetles rarely gather in groups larger than a breeding pair and a small cluster of offspring in the wild. The domesticated varieties travel in herds of 20-40 to feed on fungal forests, scavenge battlefields, or devour cave lichen and scour sewage pits. The larger caravan beetles are always antagonistic.  \nWhen breeding season hits, carrion beetles feast on the bodies of large animals. They are often found in symbiotic relationships with deathcap mycolids, darakhul, and related species. Many species in the deep underworld consider carrion beetles food and use their exoskeletons to fashion shields and armor (though their chitin is too brittle for weaponry).  \nPurple worms are their major predators. Worms swallow entire caravans when they find the beetles within.  \n**Domesticated by Ghouls.** Domesticated by the darakhul, the carrion beetles live a more complex life. They begin as simple pack animals, with the strongest being trained as war beetles. War beetles often carry ballistae and harpoons fitted with lines for use against flying foes.  \nIn late life, the beetles are used as excavators, scouring out tunnels with their acid. After death, their exoskeletons are used both as animated scouting vehicles (ghouls hide within the shell to approach hostile territory) and as armored undead platforms packed with archers and spellcasters.",
  "name": "Carrion Beetle",
  "size": "Large",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 127,
  "hit_dice": "15d10+45",
  "speed": {
    "walk": 30,
    "burrow": 20,
    "climb": 10
  },
  "strength": 19,
  "dexterity": 12,
  "constitution": 17,
  "intelligence": 1,
  "wisdom": 13,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "paralysis",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "-",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The beetle makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 10 (1d12 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d12"
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 7 (1d6 + 4) slashing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d6"
    },
    {
      "name": "Acid Spit (Recharge 5-6)",
      "desc": "The carrion beetle spits a line of acid that is 30 ft. long and 5 ft. wide. Each creature in that line takes 32 (5d12) acid damage, or half damage with a successful DC 13 Dexterity saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": null,
  "spell_list": [],
  "page_no": 52,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_carrion-beetle/"
}