{
  "slug": "chameleon-hydra",
  "desc": "A large chameleon pokes its head below the canopy. Soon, four other identical heads peek below the treetops. A massive body accompanies the heads, revealing they all belong to one creature. The creature’s odd feet and long, curled tail transport it from tree to tree with ease, and its sticky tongues allow it to slurp up prey on the forest floor as it passes._  \nThe chameleon hydra thrives in thick, wooded areas where it makes nests in the canopies of large trees. It feasts on prey both above and below the canopy, using its sticky tongues to snatch unsuspecting prey.  \n**Apex Ambush Predators.** Chameleon hydras have scales that react to light and allow the hydras to blend in with their surroundings. They are extremely patient, waiting until the most opportune time to strike from a safe vantage point. Chameleon hydras primarily eat birds and giant insects, but they are known to dine on unwary travelers if other prey is scarce.  \n**Curious and Colorful.** Study of juvenile chameleon hydras shows they have inquisitive minds and that they alternate their scales in colorful patterns when near others of their kind. Scholars believe they use these color changes as a rudimentary form of communication.",
  "name": "Chameleon Hydra",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 184,
  "hit_dice": "16d12+80",
  "speed": {
    "climb": 40,
    "walk": 20
  },
  "strength": 20,
  "dexterity": 16,
  "constitution": 20,
  "intelligence": 4,
  "wisdom": 10,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "perception": 8,
    "stealth": 11
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 16",
  "languages": "—",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The chameleon hydra makes as many bite attacks as it has heads. It can use its Sticky Tongue or Reel in place of a bite attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 10 (1d10 + 5) piercing damage.",
      "attack_bonus": 9,
      "damage_dice": "1d10+5"
    },
    {
      "name": "Sticky Tongue",
      "desc": "Melee Weapon Attack: +9 to hit, reach 50 ft., one target. Hit: The target is grappled (escape DC 15). Until this grapple ends, the target is restrained, and the hydra can't use the same sticky tongue on another target."
    },
    {
      "name": "Reel",
      "desc": "The hydra pulls a creature grappled by it up to 25 feet straight toward it."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Multiple Heads",
      "desc": "The chameleon hydra has five heads. While it has more than one head, the hydra has advantage on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious. Whenever the chameleon hydra takes 25 or more damage in a single turn, one of its heads dies. If all its heads die, the chameleon hydra dies. At the end of its turn, it grows two heads for each of its heads that died since its last turn, unless it has taken fire damage since its last turn. The hydra regains 10 hit points for each head regrown in this way."
    },
    {
      "name": "Superior Camouflage",
      "desc": "While the chameleon hydra remains motionless, it has advantage on Dexterity (Stealth) checks made to hide. In addition, the chameleon hydra can hide even while a creature can see it."
    },
    {
      "name": "Wakeful",
      "desc": "While the chameleon hydra sleeps, at least one of its heads is awake."
    }
  ],
  "spell_list": [],
  "page_no": 207,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_chameleon-hydra/"
}