{
  "slug": "chort-devil",
  "desc": "_Small horns crown this pig-faced devil’s head. It stands on shaggy goat legs and holds a flaming polearm in its clawed hands. It bears a wicked gleam in its black eyes._  \n**Bad Bargains.** Quick and canny, a chort devil uses varied, pleasing forms to entice mortals to make terrible bargains, but it revels in its obvious devilishness. A chort wants its victim to know it is dealing with a devil. The relative straightforwardness of this approach enables the creature to better deceive those whom it bargains with. After all, the chort affirms, if the victim weren’t so desperate, he wouldn’t be bargaining with a devil. If necessary, an implied threat of immolation gives it greater bargaining power, but the creature is careful not to torture or otherwise harm its patsy, since that voids any potential contract.  \n**Recitation of Contracts.** An annual spectacle in large cities involves some poor fool who believes he can trick a chort and escape a legal bargain. The devil appears and recites the entirety of the contract its victim signed, replete with embarrassing details about a dispatched rival, the ensnarement of a love who once spurned him, and other disclosures. A chort ensures all those entangled in its victim’s affairs are present to hear it, and it disappears once all the victim's dark secrets have been revealed.  \n**Smear Tactics.** A zealous opponent of the chort often finds himself the victim of his own hubris, as the devil digs up or creates vile tales about its foe and brings his folly to light. A chort enjoys tarnishing the reputation of tools of good. For example, it may steal a paladin’s sword and use it to murder an especially pious person, leaving the sword in the victim. Thus, a chort dispatches a foe strongly resistant to its manipulations, brings suspicion to another potential foe, and taints a weapon—at least in reputation—which might be used against it.",
  "name": "Chort Devil",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "devil",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 187,
  "hit_dice": "15d8+120",
  "speed": {
    "walk": 30
  },
  "strength": 24,
  "dexterity": 20,
  "constitution": 26,
  "intelligence": 18,
  "wisdom": 20,
  "charisma": 20,
  "strength_save": 11,
  "dexterity_save": 9,
  "constitution_save": 12,
  "intelligence_save": 8,
  "wisdom_save": null,
  "charisma_save": 9,
  "perception": 9,
  "skills": {
    "athletics": 11,
    "deception": 9,
    "insight": 9,
    "perception": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "cold, fire, poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 120 ft., passive Perception 19",
  "languages": "Celestial, Common, Draconic, Infernal, Primordial; telepathy (120 ft.)",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The chort devil makes three melee attacks with its flaming ranseur, or three melee attacks with its claws."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 12 (2d4 + 7) slashing damage plus 2 (1d4) Charisma damage.",
      "attack_bonus": 11,
      "damage_dice": "2d4"
    },
    {
      "name": "Flaming Ranseur",
      "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 12 (1d10 + 7) piercing damage plus 10 (3d6) fire damage.",
      "attack_bonus": 11,
      "damage_dice": "1d10"
    },
    {
      "name": "Devilish Weapons",
      "desc": "Any weapons wielded by a chort devil do 10 (3d6) fire damage in addition to their normal weapon damage."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Devil's Sight",
      "desc": "Magical darkness doesn't impede the devil's darkvision."
    },
    {
      "name": "Magic Resistance",
      "desc": "The devil has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "the chort devil's spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). The chort devil can innately cast the following spells, requiring no material components:\n\nat will: blur, magic circle, teleport\n\n3/day: scorching ray (5 rays)\n\n1/day each: dispel magic, dominate person, flame strike, haste"
    }
  ],
  "spell_list": [],
  "page_no": 104,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_chort-devil/"
}