{
  "slug": "corpse-worm",
  "desc": "A large, bloated worm, its body the gray-white pallor of death and slicked with yellow mucus, crawls across a pile of corpses. As its dozens of legs propel it over the bodies, its fang-filled maw opens to reveal a second jaw that repeatedly bursts outward, slurping up chunks of flesh with each strike._  \nThese creatures prowl deep caverns, seeking flesh to devour.  \n**Eaters of the Dead.** The corpse worm feeds primarily on death and decay, though it hunts and kills living prey it encounters if hungry. Corpse worms have a keen sense of smell that they can use to locate wounded prey or sources of carrion on which to feed.  \n**Ignore the Unliving.** While both the living and the dead are food for the corpse worm, it doesn’t feed upon the undead. Unless attacked, the corpse worm ignores undead near it. Some intelligent undead tame and train corpse worms, using them as pets, guardians, or shock troops.  \n**Slimy Eggs.** A female corpse worm lays up to two dozen eggs in crevasses, cul-de-sacs, or other remote areas. Corpse worm eggs are about the size of a human head and are sheathed in a rubbery, translucent gray membrane. The eggs are deposited with a sticky, mustard-colored excretion, allowing them to be placed on walls or even ceilings. This excretion exudes a powerful smell that many subterranean predators find unpleasant, and it allows the mother to relocate the eggs as she watches over them until they hatch.",
  "name": "Corpse Worm",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 76,
  "hit_dice": "8d10+32",
  "speed": {
    "walk": 30,
    "climb": 30
  },
  "strength": 16,
  "dexterity": 12,
  "constitution": 19,
  "intelligence": 1,
  "wisdom": 12,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "—",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 10 (2d6 + 3) piercing damage and the target is grappled (escape DC 13). Until this grapple ends, the target is restrained, and the corpse worm can't bite another target or use its Regurgitate reaction. The target must succeed on a DC 12 Constitution saving throw against disease or become poisoned until the disease is cured. Every 24 hours that elapse, the creature must repeat the saving throw, reducing its hp maximum by 5 (1d10) on a failure. This reduction lasts until the disease is cured. The creature dies if the disease reduces its hp maximum to 0.",
      "attack_bonus": 5,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Swallow",
      "desc": "The corpse worm makes a bite attack against a Medium or smaller target it is grappling. If the attack hits, the target is swallowed, and the grapple ends. While swallowed, the target is blinded and restrained, it has total cover against attacks and effects outside the corpse worm, and it takes 10 (3d6) acid damage at the start of each of the corpse worm's turns. The corpse worm can have only one creature swallowed at a time. If the corpse worm takes 20 damage or more on a single turn from the swallowed creature, the worm must succeed on a DC 12 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 10 feet of the worm. If the corpse worm dies, the target is no longer restrained by it and can escape from the corpse using 10 feet of movement, exiting prone."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Regurgitate (Recharge 5-6)",
      "desc": "When a creature the corpse worm can see hits it with an attack while within 10 feet of it, the corpse worm regurgitates a portion of its stomach contents on the attacker. The target must succeed on a DC 14 Constitution saving throw or be poisoned for 1 minute. If the corpse worm has a swallowed creature when it uses this reaction, the worm must succeed on a DC 14 Constitution saving throw or also regurgitate the swallowed creature, which falls prone in a space within 5 feet of the target. If it regurgitates the swallowed creature, the target and the swallowed creature take 7 (2d6) acid damage."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Keen Smell",
      "desc": "The corpse worm has advantage on Wisdom (Perception) checks that rely on smell."
    }
  ],
  "spell_list": [],
  "page_no": 71,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_corpse-worm/"
}