{
  "slug": "diminution-drake",
  "desc": "The diminution drake removes its stinger from its prey, watching them shrink to one-foot-tall. It then flings its spaghetti-like tongue around the pint-sized victim and engulfs it in one swift motion._  \nThis draconic hunter can shrink or grow from a cat-sized to a person-sized drake. Diminution drakes resemble dragons with a long, tubular snouts. Their eyes have red pupils that continually contract from wide spheres to tiny dots and back again. They have subpar vision and hearing but an extraordinary sense of smell.  \n**Shrinking Hunter.** The diminution drake uses the shrinking properties of its toxic breath weapon and stinger to reduce the size of its prey. Once a creature has been reduced in size, the drake uses its spaghetti-like tongue to swallow its prey.  \n**Hunters of Sport.** Diminution drakes can live off of rodents and small animals, but they find great satisfaction in hunting, diminishing, and devouring larger prey. The gut of the drake can digest anything, and digesting a shrunken, armored adventurer is of no consequence. The drake is a cunning hunter, often hiding as a tiny creature to set up ambushes.",
  "name": "Diminution Drake",
  "size": "Medium",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 71,
  "hit_dice": "13d8+13",
  "speed": {
    "fly": 60,
    "walk": 30
  },
  "strength": 14,
  "dexterity": 18,
  "constitution": 12,
  "intelligence": 6,
  "wisdom": 13,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": 4,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 4,
    "survival": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, deafened, poisoned",
  "senses": "blindsight 30 ft., passive Perception 17",
  "languages": "understands Common and Draconic but can’t speak",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The drake makes two claw attacks and one stinger attack."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage",
      "attack_bonus": 7,
      "damage_dice": "2d6+3"
    },
    {
      "name": "In One Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one Tiny target. Hit: The target must succeed on a DC 15 Dexterity saving throw or be swallowed by the drake. While swallowed, the target's hit points are reduced to 0, and it is stable. If a creature remains swallowed for 1 minute, it dies.\n\nWhile it has a creature swallowed, the diminution drake can't reduce its size below Medium. If the diminution drake dies, a swallowed creature's hit points return to the amount it had before it was swallowed, and the creature falls prone in an unoccupied space within 5 feet of the drake."
    },
    {
      "name": "Stinger",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 6 (1d4 + 4) piercing damage, and the target must succeed on a DC 15 Constitution saving throw or have its size reduced by one category until it completes a short or long rest. This attack can reduce a creature's size to no smaller than Tiny.",
      "attack_bonus": 7,
      "damage_dice": "1d4+4"
    },
    {
      "name": "Shrinking Breath (Recharge 5-6)",
      "desc": "The drake exhales poison in a 15-foot-line that is 5 feet wide. Each creature in that line must make a DC 15 Dexterity saving throw. On a failure, a creature takes 17 (5d6) poison damage and its size is reduced by one category until it completes a short or long rest. On a success, it takes half the damage and isn't reduced in size. This breath can reduce a creature's size to no smaller than Tiny."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Change Scale",
      "desc": "As a bonus action, the drake can change its size to Tiny or Small for 1 minute. While its size is reduced, it can't use In One Bite, and it has advantage on stinger attacks made against creatures larger than it. It can end this effect early as a bonus action."
    },
    {
      "name": "Keen Smell",
      "desc": "The diminution drake has advantage on Wisdom (Perception) checks that rely on smell."
    }
  ],
  "spell_list": [],
  "page_no": 121,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_diminution-drake/"
}