{
  "slug": "fabricator",
  "desc": "A rectangular slab of thick, green ooze flows slowly across the floor. Twisting metallic veins and strange lights illuminate its translucent interior, and everything it touches dissolves into a formless sludge._  \n**Artificial Oozes.** Though fabricators superficially resemble monsters like ochre jellies or gelatinous cubes, they are in fact a type of construct composed of millions of minute constructs connected by an intelligent hive-mind. Most fabricators were built to aid in the construction of advanced machinery or structures and normally are not aggressive. However, their programming sometimes calls for the disposal of organic life, and they do not hesitate to apply fatal force when necessary.  \n**Relic of Past Empires.** The first fabricators were built by a cabal of ancient mages from a forgotten empire to construct a great weapon to use against their enemies. This weapon was completed and unleashed, subsequently dooming the creators and leaving the fabricators to carry on with the tasks assigned to them. Over time, the magical bonds to their masters’ work slowly unraveled, freeing many fabricators from their responsibilities and leaving them without purpose. Today, some of these fabricators are employed by mage guilds to aid in the construction of magic items, communicating with the mages by etching words on sheets of copper.  \n**Construct Nature.** A fabricator doesn’t require air, food, drink, or sleep.",
  "name": "Fabricator",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 147,
  "hit_dice": "14d10+70",
  "speed": {
    "climb": 15,
    "walk": 30,
    "swim": 15
  },
  "strength": 18,
  "dexterity": 7,
  "constitution": 20,
  "intelligence": 15,
  "wisdom": 15,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 6,
  "skills": {
    "perception": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "force, poison, psychic",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 16",
  "languages": "understands Common, Deep Speech, and Draconic but can’t speak",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The fabricator makes two disassembling slam attacks."
    },
    {
      "name": "Disassembling Slam",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) bludgeoning damage plus 10 (3d6) force damage. A creature reduced to 0 hp by this attack immediately dies and its body and nonmagical equipment is disassembled and absorbed into the fabricator. The creature can be restored to life only by means of a true resurrection or a wish spell. The fabricator can choose to not disassemble a creature or its equipment after reducing it to 0 hp.",
      "attack_bonus": 8,
      "damage_dice": "2d10+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Assemble",
      "desc": "With at least 10 minutes of work, a fabricator can refine raw materials and create entirely new objects by combining material it has absorbed. For example, it can create a rope from absorbed hemp, clothing from absorbed flax or wool, and a longsword from absorbed metal. A fabricator can create intricate objects like thieves' tools and objects with moving parts with at least 1 hour of work and twice the requisite raw materials, but it can't create magic items. The quality of objects it creates is commensurate with the quality of the raw materials."
    },
    {
      "name": "Dismantling Form",
      "desc": "A creature that touches the fabricator or hits it with a melee attack while within 5 feet of it takes 3 (1d6) force damage. Any nonmagical weapon made of metal or once-living material (such as bone or wood) that hits the fabricator is slowly dismantled by the minute constructs that make up the fabricator. After dealing damage, the weapon takes a permanent and cumulative -1 penalty to damage rolls. If its penalty drops to -5, the weapon is destroyed. Nonmagical ammunition made of metal or once-living material that hits the fabricator is destroyed after dealing damage. At the start of each of its turns, the fabricator can choose whether this trait is active."
    }
  ],
  "spell_list": [],
  "page_no": 138,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_fabricator/"
}