{
  "slug": "gelatinous_cube_bf",
  "desc": "",
  "name": "Gelatinous Cube",
  "size": "Large",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 6,
  "armor_desc": null,
  "hit_points": 75,
  "hit_dice": "",
  "speed": {
    "walk": 15
  },
  "strength": 16,
  "dexterity": 4,
  "constitution": 20,
  "intelligence": 1,
  "wisdom": 6,
  "charisma": 1,
  "strength_save": 3,
  "dexterity_save": -3,
  "constitution_save": 5,
  "intelligence_save": -5,
  "wisdom_save": -2,
  "charisma_save": -5,
  "perception": 8,
  "skills": {},
  "damage_vulnerabilities": "cold",
  "damage_resistances": "Ooze Resilience",
  "damage_immunities": "acid,piercing,Ooze Resilience",
  "condition_immunities": "",
  "senses": "keensense 60 ft. (can't sense beyond this radius)",
  "languages": "-",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Pseudopod",
      "desc": "_Melee Weapon Attack:_ +5 to hit, reach 5 ft., one creature. _Hit:_ 10 (3d6) acid damage."
    },
    {
      "name": "Engulf",
      "desc": "The cube moves up to its speed. While doing so, it can enter a Large or smaller creature's space. When the cube enters a creature's space, the creature must make a DC 13 DEX save. On a success, the creature can choose to be pushed 5 feet back or to the side of the cube. A creature that chooses not to be pushed suffers the consequences of a failed save. On a failed save, the cube enters the creature's space, the creature takes 10 (3d6) acid damage, and is engulfed. The engulfed creature can't breathe, is restrained, and takes 21 (6d6) acid damage at the start of each of the cube's turns. When the cube moves, the engulfed creature moves with it.<br>An engulfed creature can try to escape by taking an action to make a DC 13 STR check. On a success, the creature escapes and enters a space of its choice within 5 feet of the cube."
    }
  ],
  "bonus_actions": [],
  "reactions": [
    {
      "name": "Skewer Prey",
      "desc": "When the gelatinous cube is subjected to piercing damage, it can move a random creature engulfed by it to intercept the attack. The creature takes the piercing damage as if it were the target."
    }
  ],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Ooze Cube",
      "desc": "The cube takes up its entire space. Other creatures can enter the space, but are subjected to the cube's Engulf and have disadvantage on the save. Creatures inside the cube can be seen but have total cover. A creature within 5 feet of the cube can take an action to pull a creature or object out of the cube. Doing so requires a successful DC 12 STR check, and the creature making the attempt takes 10 (3d6) acid damage.<br>The cube can hold only one Large creature or up to four Medium or smaller creatures inside it at a time."
    },
    {
      "name": "Ooze Nature",
      "desc": "The cube doesn't require sleep."
    },
    {
      "name": "Ooze Resilience",
      "desc": "The cube is resistant to the grappled and restrained conditions, and it is immune to exhaustion and to the blinded, charmed, deafened, frightened, and prone conditions."
    },
    {
      "name": "Transparent",
      "desc": "While motionless, the cube's Stealth is 15, even when the cube is in plain sight."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_gelatinous-cube/"
}