{
  "slug": "gorao-ka",
  "desc": "The wizened, doll-sized woman sits beside a small shrine of bonsai branches. She smiles and reaches into a full pouch, removing a gold coin. She passes the coin with an encouraging nod to the desperate-looking man kneeling before her._  \n**Small Gods of Substance.** Gorao-ka represent small fortunes of both a physical and spiritual nature. Their shrines can be erected anywhere, but they are commonly found in settlements and widely-traveled areas. Larger settlements have multiple shrines, sometimes one or more per neighborhood, each of which is associated with a different gorao-ka.  \n**Gentle and Benevolent.** Gorao-ka have a kind look for every person that crosses their path. Each of them has a burning desire to assist people, and they grieve on the occasions that they can’t. The laws governing their kind forbid them from extending aid to someone that hasn’t made an offering at their shrine, though a gorao-ka accepts almost anything in tribute.  \n**Thieves’ Bane.** Despite their generous natures, gorao-ka have no pity for those who steal from them. Fools who steal from gorao-ka swiftly discover their money inexplicably vanished, and can end up destitute if they don’t make reparations.  \n**Immortal Spirit Nature.** The kami doesn’t require food, drink, or sleep.",
  "name": "Gorao-Ka",
  "size": "Tiny",
  "type": "Fey",
  "subtype": "kami",
  "group": null,
  "alignment": "Neutral Good",
  "armor_class": 13,
  "armor_desc": "copper coat",
  "hit_points": 17,
  "hit_dice": "5d4+5",
  "speed": {
    "walk": 20
  },
  "strength": 13,
  "dexterity": 11,
  "constitution": 13,
  "intelligence": 15,
  "wisdom": 17,
  "charisma": 15,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "passive Perception 13",
  "languages": "Common, Sylvan",
  "challenge_rating": "1/8",
  "cr": 0.125,
  "actions": [
    {
      "name": "Sack of Coins",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4 + 1) bludgeoning damage.",
      "attack_bonus": 3,
      "damage_dice": "1d4+1"
    },
    {
      "name": "Find a Penny (Recharge 5-6)",
      "desc": "The gorao-ka throws a copper piece into a space within 5 feet of it. A creature that is not hostile to the gorao-ka that picks up the copper piece is blessed with good luck. At any point within the next 1 hour, the creature can roll a d6 and add the number rolled to one attack roll, ability check, or saving throw.\n\nAlternatively, the bearer of the coin can pass it to another creature of its choice. At any point within the next 8 hours, the new bearer of the coin can roll 2d6 and add the higher result to one attack roll, ability check, or saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fool's Gold",
      "desc": "If a creature steals one of the gorao-ka's money pouches, it loses 1d20 gp each time it finishes a long rest. A creature that steals more than one money pouch deducts an extra 1d20 gp for each additional stolen pouch. This effect ends when the thief freely gives double the amount of money it stole to another creature or organization. A gorao-ka carries 1d10 pouches, each containing 1d20 gp. If the gorao-ka is killed, all the gold in its pouches turns into worthless stones after 1 minute."
    },
    {
      "name": "Silver Fountain",
      "desc": "When the gorao-ka is reduced to 0 hp, it explodes in a spray of silver pieces. Each creature within 5 feet of the gorao-ka that participated in killing it, such as by attacking it or casting a spell on it, must make a DC 12 Dexterity saving throw or take 7 (2d6) bludgeoning damage. The silver pieces disappear after 1 minute."
    }
  ],
  "spell_list": [],
  "page_no": 221,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_gorao-ka/"
}