{
  "slug": "grim-jester",
  "desc": "_A skeletal cadaver bedecked in the motley attire of a fool capers about while making jokes that mock mortality._  \n**Amusing Death.** When a jester on his deathbed moves an evil death god to laughter, the fool sometimes gains a reprieve. becoming a grim jester, whose pranks serve to entertain the god of death. Their purpose is to bring an end to mortal lives in a gruesome, comic, and absurd manner. As long as such jesters keep the death god amused, their continued unlife is assured.  \n**Grisly Humor.** A grim jester’s jokes are not funny to their victims, but they offer a grim finality in combat. A killing joke might be absurd, such as “Here is your final pineapple soul, a parting gift, goodbye.” or sheer braggadocio such as “Your footwork is atrocious, and your spell’s lost its focus, your party’s no match for my hocus-pocus.” Others might be high-flown, such as “Mortal, your time has come, the bell within your skull does ring, ding, dong, dead.” Grim jesters are famous for grim, bitter mockery such as “Your blood on fire, your heart pumps its last, show me now a hero’s last gasp!” or “Odin’s raven has come for you; the Valkyries were busy. You lose, mortal.”  \nA grim jester’s mockery rarely entertain the living—but gods of death, chained angels, and demons find them quite amusing.  \n**Randomness.** Grim jesters often get their hands on wands of wonder and scrolls of chaos magic. Beware the grim jester with a deck of many things—they are quite talented in pulling cards whose magic then applies to foes and spectators.  \n**Undead Nature.** A grim jester doesn’t require air, food, drink, or sleep.",
  "name": "Grim Jester",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 136,
  "hit_dice": "16d8+64",
  "speed": {
    "walk": 30
  },
  "strength": 14,
  "dexterity": 22,
  "constitution": 18,
  "intelligence": 16,
  "wisdom": 16,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 10,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 9,
  "perception": 7,
  "skills": {
    "acrobatics": 10,
    "deception": 9,
    "perception": 7,
    "performance": 9,
    "stealth": 10
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "necrotic, poison; bludgeoning, piercing, and slashing from nonmagical attacks",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 17",
  "languages": "Abyssal, Celestial, Common, Gnomish, telepathy 60 ft.",
  "challenge_rating": "11",
  "cr": 11,
  "actions": [
    {
      "name": "Joker's Shuffle (recharge 6)",
      "desc": "The jester forces one Medium or Small humanoid within 60 feet to make a DC 17 Charisma saving throw. If the saving throw fails, the jester and the target exchange locations via teleportation and an illusion causes them to swap appearance: the jester looks and sounds like the target, and the target looks and sounds like the jester. The illusion lasts for 1 hour unless it is dismissed earlier by the jester as a bonus action, or dispelled (DC 17)."
    },
    {
      "name": "Killing Joke (recharge 6)",
      "desc": "The jester performs an ancient, nihilistic joke of necromantic power. This joke has no effect on undead or constructs. All other creatures within 60 feet of the jester must make a DC 17 Wisdom saving throw. Those that fail fall prone in a fit of deadly laughter. The laughter lasts 1d4 rounds, during which time the victim is incapacitated and unable to stand up from prone. At the end of its turn each round, an incapacitated victim must make a successful DC 17 Constitution saving throw or be reduced to 0 hit points. The laughter can be ended early by rendering the victim unconscious or with greater restoration or comparable magic."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Ridicule Hope (recharge 4-6)",
      "desc": "When a spell that restores hit points is cast within 60 feet of the jester, the jester can cause that spell to inflict damage instead of curing it. The damage equals the hit points the spell would have cured."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Innate Spellcasting",
      "desc": "the jester's spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). It can innately cast the following spells requiring no components:\n\nat will: disguise self, grease, inflict wounds, magic mouth, misty step\n\n3/day each: contagion, mirror image\n\n1/day each: delayed blast fireball, finger of death, mislead, seeming"
    },
    {
      "name": "Last Laugh",
      "desc": "Unless it is destroyed in a manner amusing to the god of death that created it, the grim jester is brought back after 1d20 days in a place of the god's choosing."
    },
    {
      "name": "Mock the Dying",
      "desc": "Death saving throws made within 60 feet of the jester have disadvantage."
    },
    {
      "name": "Turn Resistance",
      "desc": "The jester has advantage on saving throws against any effect that turns undead."
    }
  ],
  "spell_list": [],
  "page_no": 240,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_grim-jester/"
}