{
  "slug": "hoard-golem",
  "desc": "_A hoard golem is a pile of gold, jewelry, and weapons that can rise on its own like a tidal wave of riches, with a cold and determined face. A hoard golem can crash down with the weight of a fortune, flattening everything in its path._  \n**Dragon Fears Made Real.** The hoard golems were born from the paranoia of dragons. Despite their great physical and intellectual power, dragons are always suspicious of any creature willing to work for them. The first hoard golem was created when a dragon realized that there could be no guardian more trustworthy with its hoard than the hoard itself. Since then, the secret of hoard golem construction has emerged, and rich nobles have followed suit, enchanting their wealth to defend itself from thieves.  \n**Patient Homebodies.** As constructs, hoard golems are mindless, lying in wait for anyone other than their creator to come within striking distance. In the case of evil dragons, this may include the wyrmlings of dragon parents looking to establish dominance in the family. Hoard golems fight to the death, but they rarely leave the rooms they inhabit for fear that clever treasure hunters might trick the hoard into walking itself right out of the owner’s den.  \n**Silent and Wealthy.** Hoard golems cannot speak. A hoard golem is 25 feet tall and weighs 20,000 lb. A hoard golem’s body is composed of items—copper, silver, gold, works of art, armor, weapons, and magical items—worth at least 5,000 gp.  \n**Constructed Nature.** A golem doesn’t require air, food, drink, or sleep.",
  "name": "Hoard Golem",
  "size": "Huge",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 161,
  "hit_dice": "14d12+70",
  "speed": {
    "walk": 40
  },
  "strength": 22,
  "dexterity": 15,
  "constitution": 20,
  "intelligence": 3,
  "wisdom": 11,
  "charisma": 1,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 9,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "athletics": 10,
    "perception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "condition_immunities": "charmed, exhausted, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 120 ft., passive Perception 14",
  "languages": "understands the language of its creator but can't speak",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The golem makes two slam attacks."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 39 (6d10 + 6) bludgeoning damage.",
      "attack_bonus": 10,
      "damage_dice": "6d10"
    },
    {
      "name": "Thieving Whirlwind (Recharge 5-6)",
      "desc": "The hoard golem transforms into a 20-foot radius whirlwind of the treasures of which it is composed. In this form, it has immunity to all slashing and piercing damage. As a whirlwind, it can enter other creatures' spaces and stop there. Every creature in a space the whirlwind occupies must make a DC 17 Dexterity saving throw. On a failure, a target takes 40 (6d10 + 7) bludgeoning damage and the whirlwind removes the most valuable visible item on the target, including wielded items, but not armor. If the saving throw is successful, the target takes half the bludgeoning damage and retains all possessions. The golem can remain in whirlwind form for up to 3 rounds, or it can transform back to its normal form on any of its turns as a bonus action."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Strike with Awe",
      "desc": "Creatures within 120 feet of an immobile hoard golem suffer disadvantage on Wisdom (Perception) checks. A creature's sheer glee on discovering a vast hoard of treasure distracts it from its surroundings."
    },
    {
      "name": "Immutable Form",
      "desc": "The golem is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The golem has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The golem's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": 234,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_hoard-golem/"
}