{
  "slug": "huli-jing",
  "desc": "A woman of unearthly beauty smiles behind her ornamental fan before suddenly transforming into a brilliantly white fox with nine tails._  \n**Canine Animosity.** Dogs are not fooled by the huli jing’s deceptions. No matter how a huli jing tries to hide its true nature, it can’t hide its fox scent from dogs.  \n**Energy Feeders.** The huli jing possess great powers as long as they absorb sufficient energy, most often derived from moonlight or sunshine. This is but a trickle, however, compared to the life-force of mortals. Huli jing use their shapechanging to live among humans, secretly feeding off the populace or from willing allies, exchanging life energy for the fey’s aid.  \n**Symbols of Luck or Curses.** The huli jing are neither good nor evil but act according to their individual natures. Some walk among the mortal races, their aid and kindness spreading tales of the huli jing’s auspicious benevolence. Others seek to confuse, trick, or harm mortals, and their malicious cruelty gives rise to stories of the huli jing as malevolent omens.",
  "name": "Huli Jing",
  "size": "Medium",
  "type": "Fey",
  "subtype": "shapechanger",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": null,
  "hit_points": 130,
  "hit_dice": "20d8+40",
  "speed": {
    "walk": 40
  },
  "strength": 15,
  "dexterity": 18,
  "constitution": 14,
  "intelligence": 16,
  "wisdom": 16,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": 9,
  "perception": 11,
  "skills": {
    "perception": 11,
    "persuasion": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks not made with cold iron weapons",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 21",
  "languages": "Common, Elvish, Sylvan",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "In fox form, the huli jing uses Curse of Luck then makes two bite attacks. In humanoid form, it uses Curse of Luck then makes three jade dagger attacks."
    },
    {
      "name": "Bite (True Form Only)",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 911 (2d6 + 4) piercing damage and 14 (4d6) psychic damage.",
      "attack_bonus": 8,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Jade Dagger (Humanoid Form Only)",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 6 (1d4 + 4) piercing damage and 7 (2d6) psychic damage",
      "attack_bonus": 8,
      "damage_dice": "1d4+4"
    },
    {
      "name": "Curse of Luck",
      "desc": "Each creature of the huli jing's choice within 60 feet of it and aware of it must succeed on a DC 16 Wisdom saving throw or have disadvantage on attack rolls and saving throws for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the huli jing's Curse of Luck for the next 24 hours. Alternatively, the huli jing can choose up to three willing creatures within 60 feet of it. Each target has advantage on attack rolls and saving throws for 1 minute."
    },
    {
      "name": "Draining Glance (Recharge 5-6)",
      "desc": "The huli jing draws sustenance from the psyches of living creatures in a 30-foot cone. Each creature in the area that isn't a construct or an undead must make a DC 16 Wisdom saving throw, taking 28 (8d6) psychic damage on a failed save, or half as much damage on a successful one. The huli jing regains hp equal to the single highest amount of psychic damage dealt."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Shapechanger",
      "desc": "The huli jing can use its action to polymorph into a Medium female human of unearthly beauty, or back into its true, nine-tailed fox form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying transforms with it. It reverts to its true form if it dies."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The huli jing's innate spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). It can innately cast the following spells, requiring no material components.\nAt will: charm person, invisibility (self only), major image\n3/day each: cure wounds, disguise self, fear\n2/day each: bestow curse, confusion\n1/day each: divination, modify memory"
    }
  ],
  "spell_list": [],
  "page_no": 204,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_huli-jing/"
}