{
  "slug": "kobold-chieftain",
  "desc": "More than anything, kobolds are survivors. Their scaly skin and keen night vision as well as their dextrous claws and sensitive snouts make them quick to sense danger, and their clawed feet move them out of danger with cowardly speed. They are small but fierce when fighting on their own terms, and their weight of numbers helps them survive in places where larger but less numerous races can’t sustain a settlement. Kobolds are great miners, good gearsmiths, and modest alchemists, and they have a curiosity about the world that frequently gets them into trouble.  \n_**Underworld Merchants.**_ Kobolds are merchants to both the surface world and the world beneath it, with their greatest cities hidden deep below the earth. Their enemies are the diabolical gnomes, the dwarves, and any other mining races that seek dominance of dark, rich territories.  \nKobolds are closely allied with and related to dragonborn, drakes, and dragons. The kobold kings (and there are oh‑so‑many kobold kings, since no kobold ruler is satisfied with being merely a chieftain) admire dragons as the greatest sources of wisdom, power, and proper behavior.  \n_This small, draconic humanoid struts as though it were ten feet tall. It wears the gilded skull of a small dragon as a helmet, and its beady eyes gleam out through the skull’s sockets. It hefts its spear and shield and lets out a blood-curdling shriek, signaling the attack._  \nWhile most kobolds are scuttling scavengers or pathetic sycophants, a few carry a spark of draconic nobility that can’t be ignored. These few forge their tribes into forces to be reckoned with, rising to the rank of chieftain. A kobold chieftain stands proud, clad in war gear of fine quality and good repair. Their weapons are tended by the tribe’s trapsmiths, particularly evident in their springspike shields.  \n_**Living Legend.**_ A kobold chieftain is more than a leader, it is a symbol of the tribe’s greatness. The strongest, most cunning, most ruthless of a kobold tribe embodies their connection to the revered dragons. When a chieftain sounds the call to battle, the kobolds meld into a fearless, deadly force.",
  "name": "Kobold Chieftain",
  "size": "Small",
  "type": "Humanoid",
  "subtype": "kobold",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 17,
  "armor_desc": "studded leather and shield",
  "hit_points": 82,
  "hit_dice": "15d6+30",
  "speed": {
    "walk": 30
  },
  "strength": 10,
  "dexterity": 17,
  "constitution": 14,
  "intelligence": 11,
  "wisdom": 13,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 5,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 4,
  "perception": null,
  "skills": {
    "intimidation": 6,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "charmed, frightened",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "Common, Draconic",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The kobold makes 2 attacks."
    },
    {
      "name": "Shortsword",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 10 (3d6) poison damage and the target must make a successful DC 12 Constitution saving throw or be poisoned for 1 minute. A poisoned creature repeats the saving throw at the end of each of its turns, ending the effect on a success.",
      "attack_bonus": 5,
      "damage_dice": "1d6"
    },
    {
      "name": "Shortbow",
      "desc": "Ranged Weapon Attack: +5 to hit, range 80/320 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 10 (3d6) poison damage and the target must make a successful DC 12 Constitution saving throw or be poisoned for 1 minute. A poisoned creature repeats the saving throw at the end of each of its turns, ending the effect on a success.",
      "attack_bonus": 5,
      "damage_dice": "1d6"
    },
    {
      "name": "Inspiring Presence (Recharge after Short or Long Rest)",
      "desc": "The chieftain chooses up to six allied kobolds it can see within 30 feet. For the next minute, the kobolds gain immunity to the charmed and frightened conditions, and add the chieftain's Charisma bonus to attack rolls."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Springspike Shield (5/rest)",
      "desc": "When the kobold chieftain is hit by a melee attack within 5 feet, the kobold chieftain can fire one of its shield spikes at the attacker. The attacker takes 3 (1d6) piercing damage plus 3 (1d6) poison damage."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Pack Tactics",
      "desc": "The kobold chieftain has advantage on an attack roll against a target if at least one of the chieftain's allies is within 5 feet of the target and the ally isn't incapacitated."
    },
    {
      "name": "Sunlight Sensitivity",
      "desc": "While in sunlight, the kobold chieftain has disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight."
    }
  ],
  "spell_list": [],
  "page_no": 263,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_kobold-chieftain/"
}