{
  "slug": "living-wick",
  "desc": "_A living wick is a small, rough wax sculpture of a human that stands at attention, a halo of light flickering around its head from some source behind it._  \n**Enchanted Wicks.** Living wicks are obedient wax statues brought to life by an enchanted wick that runs from the nape of their neck to their lower back. When new, a living wick looks and moves like a human, but as the wick burns, the wax features melt and the statue takes on a twisted, hunchbacked appearance.  \n**Short-Lived as a Candle.** Living wicks are powered by flames, and therefore they have a predetermined life cycle. They are typically reduced to formless lumps in a month, but some say a living wick’s affordability more than makes up for its inevitable obsolescence. Individuals looking to quickly construct a building or fortification without the expense of paid labor or the questionable ethics of necromancy find living wicks obedient and efficient, as do those needing an army for a single battle.  \nLiving wicks are active only when their wicks are lit, and only respond to the telepathic commands of whoever lit them. This makes it easy to transfer living wicks between owners, even those not well-versed in the use of magic.  \n**Explosive Ends.** The amount of magical energy contained within a living wick, paired with the manner in which it is released, gives them a remarkable capability for selfdestruction. If their controller demands it, all living wicks can release the magic contained within their form all at once, engulfing themselves and anyone nearby in flames. This can make storing them a gamble, but many see it as an asset, especially those seeking to destroy evidence or anonymously attack their enemies.  \n**Constructed Nature.** A living wick doesn’t require air, food, drink, or sleep.",
  "name": "Living Wick",
  "size": "Small",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 28,
  "hit_dice": "8d6",
  "speed": {
    "walk": 20
  },
  "strength": 10,
  "dexterity": 10,
  "constitution": 10,
  "intelligence": 5,
  "wisdom": 5,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "fire",
  "damage_resistances": "",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, unconscious",
  "senses": "sight 20 ft. (blind beyond the radius of its own light), passive Perception 10",
  "languages": "shares a telepathic link with the individual that lit its wick",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +2 to hit, reach 5 ft., one target. Hit: 3 (1d6) bludgeoning damage.",
      "attack_bonus": 2,
      "damage_dice": "1d6"
    },
    {
      "name": "Consume Self",
      "desc": "A living wick can be commanded to rapidly burn through the remains of its wick, creating a devastating fireball. All creatures within 20 feet of the living wick take 7 (2d6) fire damage, or half damage with a successful DC 13 Dexterity saving throw. The fire spreads around corners and ignites flammable objects in the area that aren't being worn or carried. The wick is reduced to a lifeless puddle of wax."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Controlled",
      "desc": "Living wicks cannot move, attack, or perform actions when they are not lit. Living wicks only respond to the telepathic commands of the individual that lit them."
    },
    {
      "name": "Light",
      "desc": "Activated living wicks produce light as a torch."
    },
    {
      "name": "Melting",
      "desc": "A living wick loses one hit point for every 24 hours it remains lit."
    }
  ],
  "spell_list": [],
  "page_no": 278,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_living-wick/"
}