{
  "slug": "magma-octopus",
  "desc": "Eight tentacles reach out from the scorched body of this unusual octopus-like creature. Glowing yellow, orange, and red patches smolder on its skin, like embers flaring to life._  \n**Elemental Bodies.** Magma octopuses are creatures that physically resemble the marine animals for which they are named, but they make their homes in lava, swimming through it as easily as aquatic octopuses swim through water. Born in the fiery seas of the Plane of Fire long ago, many magma octopuses wandered to the Material Plane through various portals and thinned barriers between the planes. They exist throughout the world, particularly in underground caverns with open lava flows, within the craters of some volcanoes, and swimming through underground networks of magma.  \n**Intelligent.** Magma octopuses live simple lives with a quiet intelligence that slightly surpasses that of aquatic octopuses. They have no language and cannot communicate verbally. They are known to recognize individuals from other species and remember individuals that might have caused them pain or helped them out of a bad situation. Magma octopuses only fight others if they are attacked first, but they can become extremely territorial if intruders tread too close to home. They have a fondness for fire-based magic and sometimes can be recruited to serve as guardians for wizards, efreeti, and other powerful, fiery creatures.  \n**Elemental Nature.** A magma octopus doesn’t require air, food, drink, or sleep.",
  "name": "Magma Octopus",
  "size": "Large",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 147,
  "hit_dice": "14d10+70",
  "speed": {
    "walk": 40
  },
  "strength": 21,
  "dexterity": 17,
  "constitution": 21,
  "intelligence": 5,
  "wisdom": 8,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 8,
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "fire",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 9",
  "languages": "—",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The magma octopus makes four attacks with its tentacles."
    },
    {
      "name": "Tentacle",
      "desc": "Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 8 (1d6 + 5) bludgeoning damage plus 2 (1d4) fire damage. If the target is a creature, it is grappled (escape DC 16). Until this grapple ends, the target is restrained, and it takes 2 (1d4) fire damage at the start of each of its turns. The magma octopus can grapple up to two targets at a time.",
      "attack_bonus": 8,
      "damage_dice": "1d6+5"
    },
    {
      "name": "Magma Blast (Recharge 6)",
      "desc": "The magma octopus sprays magma in a 30-foot cone. Each creature in that area must make a DC 16 Dexterity saving throw, taking 28 (8d6) fire damage on a failed save, or half as much damage on a successful one. If a creature fails the saving throw by 5 or more, it catches fire. Until someone takes an action to douse the fire, the creature takes 5 (1d10) fire damage at the start of each of its turns."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Lava Bound",
      "desc": "The magma octopus can exist outside of lava for up to 1 hour each day. If it remains outside of lava for 1 minute or longer, its skin begins to dry and harden like rapidly-cooled magma. While its skin is hardened, it has a walking speed of 20 feet, an Armor Class of 18, and vulnerability to cold damage. If it remains outside of lava for 1 hour or longer, it becomes petrified, transforming into basalt. Its body returns to normal if it is submerged in lava for 1 round."
    },
    {
      "name": "Lava Swimmer",
      "desc": "While in lava, the magma octopus has a swimming speed of 60 feet and can move through the lava as if it were water."
    }
  ],
  "spell_list": [],
  "page_no": 251,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_magma-octopus/"
}