{
  "slug": "mechuiti-tob1-2023",
  "desc": "False",
  "name": "Mechuiti",
  "size": "Gargantuan",
  "type": "Fiend",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Evil",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 462,
  "hit_dice": "25d20 + 200",
  "speed": {
    "walk": 60
  },
  "strength": 29,
  "dexterity": 19,
  "constitution": 27,
  "intelligence": 18,
  "wisdom": 18,
  "charisma": 22,
  "strength_save": 17,
  "dexterity_save": 12,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 12,
  "charisma_save": null,
  "perception": 14,
  "skills": {},
  "damage_vulnerabilities": "cold",
  "damage_resistances": "False",
  "damage_immunities": "acid, fire, lightning, poison; bludgeoning, piercing, and slashing from nonmagical attacks",
  "condition_immunities": "charmed, frightened, poisoned, stunned",
  "senses": "truesight 120 ft., passive Perception 22",
  "languages": "Abyssal, Celestial, Common, Draconic, Primordial, telepathy 300 ft.",
  "challenge_rating": "27",
  "cr": 27,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "Mechuiti can use his Frightful Presence. He then makes one Bite attack and two Claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +17 to hit, reach 10 ft., one target. Hit: 31 (4d10 + 9) piercing damage plus 21 (6d6) fire damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +17 to hit, reach 20 ft., one target. Hit: 27 (4d8 + 9) slashing damage plus 21 (6d6) fire damage. If Mechuiti scores a critical hit, he rolls damage dice three times, instead of twice."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of Mechuiti's choice that is within 120 feet of Mechuiti and aware of him must succeed on a DC 24 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to Mechuiti's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Burning Acid Breath (Recharge 5-6)",
      "desc": "Mechuiti exhales fire and acid in a 60-foot cone. Each creature in that area must make a DC 24 Dexterity saving throw, taking 49 (14d6) fire damage and 49 (14d6) acid damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Spellcasting",
      "desc": "Mechuiti casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 22):\nAt will: dispel magic, hold monster, wall of fire\n3/day each: fire storm, power word stun"
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": "Mechuiti can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. Mechuiti regains spent legendary actions at the start of his turn.",
  "legendary_actions": [
    {
      "name": "Move",
      "desc": "Mechuiti moves up to his speed, or he climbs up to half his speed. This movement doesn't provoke opportunity attacks."
    },
    {
      "name": "Burn from the Inside",
      "desc": "Mechuiti chooses a creature within 120 feet of him that is infected with the Mechuiti's deadly ichor disease. The target must make a DC 24 Constitution saving throw. On a failure, the target takes 10 (3d6) fire damage and 10 (3d6) acid damage and catches fire. On a success, the target takes half the damage and doesn't catch fire. Until a creature uses an action to douse the fire, the target takes 7 (2d6) fire damage at the start of each of its turns."
    },
    {
      "name": "Cast a Spell (Costs 2 Actions)",
      "desc": "Mechuiti uses Spellcasting."
    }
  ],
  "special_abilities": [
    {
      "name": "Demon Lord's Ichor",
      "desc": "When Mechuiti is subjected to piercing damage or slashing damage, a spray of caustic blood spurts from his hide. Each creature within 10 feet of Mechuiti must succeed on a DC 24 Constitution saving throw or becoming infected with the Mechuiti's deadly ichor disease and be poisoned until the disease is cured. Every 24 hours that elapse, the target must repeat the saving throw, reducing its hp maximum by 14 (4d6) on a failure. This reduction lasts until the disease is cured. The creature dies if the disease reduces its hp maximum to 0. The disease can be cured by the greater restoration spell or similar magic or when the creature succeeds on three saving throws."
    },
    {
      "name": "Fiery Weapons",
      "desc": "Mechuiti's weapon attacks are magical. When Mechuiti hits with any weapon, the weapon deals an extra 6d6 fire damage (included in the attack)."
    },
    {
      "name": "Immolating Corona",
      "desc": "At the start of each of Mechuiti's turns, each creature within 10 feet of him takes 10 (3d6) fire damage and must succeed on a DC 24 Constitution saving throw or catch fire. A creature that touches Mechuiti or hits him with a melee attack while within 5 feet of him takes 10 (3d6) fire damage and must succeed on a DC 24 Constitution saving throw or catch fire. Until a creature uses an action to douse the fire, the creature on fire takes 7 (2d6) fire damage at the start of each of its turns."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If Mechuiti fails a saving throw, he can choose to succeed instead."
    },
    {
      "name": "Magic Resistance",
      "desc": "Mechuiti has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Speak with Simians",
      "desc": "Mechuiti can communicate with apes and monkeys as if they shared a language."
    }
  ],
  "spell_list": [],
  "page_no": 78,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_mechuiti/"
}