{
  "slug": "pit-fiend-a5e",
  "desc": "",
  "name": "Pit Fiend",
  "size": "Large",
  "type": "Fiend",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 19,
  "armor_desc": "",
  "hit_points": 300,
  "hit_dice": "24d10+168",
  "speed": {
    "walk": 30,
    "fly": 60
  },
  "strength": 26,
  "dexterity": 16,
  "constitution": 24,
  "intelligence": 22,
  "wisdom": 18,
  "charisma": 24,
  "strength_save": null,
  "dexterity_save": 9,
  "constitution_save": 13,
  "intelligence_save": 12,
  "wisdom_save": 10,
  "charisma_save": 13,
  "perception": null,
  "skills": {
    "athletics": 14,
    "insight": 10,
    "perception": 10
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold; damage from nonmagical, non-silvered weapons",
  "damage_immunities": "fire, poison",
  "condition_immunities": "poisoned",
  "senses": "truesight 120 ft., passive Perception 21",
  "languages": "Infernal, telepathy 120 ft.",
  "challenge_rating": "20",
  "cr": 20,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The pit fiend attacks with its bite and mace."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 22 (4d6 + 8) piercing damage. If the target is a creature  it makes a DC 20 Constitution saving throw. On a failure  it is poisoned for 1 minute. While poisoned in this way  the target can't regain hit points and takes 21 (6d6) ongoing poison damage at the start of each of its turns. The target can repeat this saving throw at the end of each of its turns  ending the effect on a success."
    },
    {
      "name": "Mace",
      "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 22 (4d6 + 8) bludgeoning damage plus 21 (6d6) fire damage. If the target is a Medium or smaller creature  it makes a DC 22 Strength saving throw. On a failure  it is pushed 15 feet away from the pit fiend and knocked prone."
    },
    {
      "name": "Circle of Fire (1/Day, While Bloodied)",
      "desc": "A 15-foot-tall  1-foot-thick  20-foot-diameter ring of fire appears around the pit fiend  with the pit fiend at the center. The fire is opaque to every creature except the pit fiend. When the ring of fire appears  each creature it intersects makes a DC 18 Dexterity saving throw  taking 22 (5d8) fire damage on a failed save or half damage on a successful one. A creature takes 22 (5d8) damage the first time each turn it enters the area or when it ends its turn there. The fire lasts 1 minute or until the pit fiend dismisses it  becomes incapacitated  or leaves its area."
    },
    {
      "name": "Fireball (3rd-Level; V, S)",
      "desc": "Fire streaks from the pit fiend to a point within 120 feet and explodes in a 20-foot radius  spreading around corners. Each creature in the area makes a DC 18 Dexterity saving throw  taking 21 (6d6) fire damage on a failed save or half damage on a success."
    },
    {
      "name": "Hold Monster (5th-Level; V, S, Concentration)",
      "desc": "A creature within 60 feet that the pit fiend can see makes a DC 18 Wisdom saving throw. On a failure  it is paralyzed for 1 minute. The creature repeats the save at the end of each of its turns  ending the effect on a success."
    }
  ],
  "bonus_actions": [
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one creature. Hit: 19 (2d10 + 8) slashing damage, and the target is grappled (escape DC 22). While the target is grappled, the pit fiend can't use its claw against a different creature."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 24 (3d10 + 8) bludgeoning damage."
    }
  ],
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fear Aura",
      "desc": "A creature hostile to the pit fiend that starts its turn within 20 feet of it makes a DC 18 Wisdom saving throw. On a failure, it is frightened until the start of its next turn. On a success, it is immune to this pit fiends Fear Aura for 24 hours."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The pit fiends spellcasting ability is Wisdom (spell save DC 18). It can innately cast the following spells, requiring no material components: At will: detect magic, fireball, 3/day each: hold monster, sending"
    }
  ],
  "spell_list": [],
  "page_no": 86,
  "environments": [],
  "img_main": null,
  "document__slug": "menagerie",
  "document__title": "Level Up Advanced 5e Monstrous Menagerie",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://www.levelup5e.com",
  "v2_converted_path": "/v2/creatures/mmenag_pit-fiend/"
}