{
  "slug": "planewatcher-tob1-2023",
  "desc": "False",
  "name": "Planewatcher",
  "size": "Medium",
  "type": "Celestial",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Neutral",
  "armor_class": 18,
  "armor_desc": "plate",
  "hit_points": 136,
  "hit_dice": "16d8 + 64",
  "speed": {
    "walk": 90,
    "fly": 30
  },
  "strength": 18,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 17,
  "wisdom": 18,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": 9,
  "perception": 18,
  "skills": {
    "Athletics": 8,
    "Insight": 8,
    "Perception": 8,
    "Survival": 8
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, frightened, poisoned",
  "senses": "truesight 120 ft., passive Perception 18",
  "languages": "all, telepathy 120 ft.",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The planewatcher makes one Radiant Lasso attack and two Enervating Blast attacks, or it makes three Enervating Blast attacks. It can replace two attacks with a use of Planar Ultimatum."
    },
    {
      "name": "Radiant Lasso",
      "desc": "Melee Weapon Attack: +8 to hit, reach 30 ft., one target. Hit: 22 (4d6 + 4) radiant damage, and the target is grappled (escape DC 16) if the planewatcher isn't already grappling a creature. Until this grapple ends, the target is restrained, can't tell a lie, and can't teleport or be transported to another plane of existence unless the planewatcher wills it."
    },
    {
      "name": "Enervating Blast",
      "desc": "Melee or Ranged Spell Attack: +9 to hit, range 60 ft., one target. Hit: 23 (4d8 + 5) force damage, and the target has disadvantage on Strength and Dexterity checks until the end of its next turn."
    },
    {
      "name": "Planar Ultimatum",
      "desc": "The planewatcher demands one creature grappled by it to return to the creature's home plane within 24 hours. If the creature doesn't swear to do so, it must make a DC 17 Constitution saving throw, taking 45 (10d8) radiant damage on a failed save, or half as much damage on a successful one If the creature swears to return, it becomes affected by the geas spell for 30 days, which compels the creature to return to its home plane as soon as possible."
    }
  ],
  "bonus_actions": [
    {
      "name": "Reel",
      "desc": "The planewatcher pulls a creature grappled by it up to 25 feet straight toward it."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The planewatcher has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Planar Sense",
      "desc": "The planewatcher can pinpoint the location of creatures not native to the plane the planewatcher currently occupies and planar portals within 60 feet of it, and the planewatcher can sense the general direction of such creatures and portals within 1 mile of it."
    },
    {
      "name": "Plane Bound",
      "desc": "The planewatcher is immune to any spell or effect that would force it to leave its current plane, unless it wants to leave."
    },
    {
      "name": "Word-Bound",
      "desc": "The planewatcher always knows the direction and distance to any creature that dispels, breaks, or otherwise avoids the geas of the promise it made via Planar Ultimatum, provided the planewatcher and the creature are on the same plane of existence. While grappling such a creature, it can cast the banishment spell as a bonus action (spell save DC 17) on that creature."
    }
  ],
  "spell_list": [],
  "page_no": 293,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_planewatcher/"
}