{
  "slug": "sandsilhouette-tob1-2023",
  "desc": "False",
  "name": "Sand Silhouette",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 105,
  "hit_dice": "14d8 + 42",
  "speed": {
    "walk": 30,
    "burrow": 30
  },
  "strength": 18,
  "dexterity": 12,
  "constitution": 17,
  "intelligence": 7,
  "wisdom": 12,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 11,
  "skills": {},
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "exhaustion, frightened, poisoned",
  "senses": "darkvision 60 ft., tremorsense 60 ft., passive Perception 11",
  "languages": "the languages it knew in life",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sand silhouette makes two Slam attacks. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 15), and the silhouette uses its Engulf on the target."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 14 (3d6 + 4) bludgeoning damage plus 3 (1d6) necrotic damage."
    },
    {
      "name": "Engulf",
      "desc": "The sand silhouette engulfs a Medium or smaller creature grappled by it. The engulfed target is blinded and restrained, and it must succeed on a DC 15 Constitution saving throw at the start of each of the sand silhouette's turns or take 10 (3d6) necrotic damage. If the sand silhouette moves, the engulfed target moves with it. The sand silhouette can have only one creature engulfed at a time."
    },
    {
      "name": "Haunted Haboob (3/Day)",
      "desc": "The sand silhouette creates a storm of whirling sand and wailing souls around itself. The storm is a 10-foot-radius, 30-foot-tall cylinder centered on the silhouette and moves with the silhouette for 1 minute, until it ends the storm as a bonus action, or until its concentration ends (as if concentrating on a spell). The sandstorm's area is lightly obscured, and a creature that starts its turn in the sandstorm's area or enters it for the first time on a turn must succeed on a DC 15 Wisdom saving throw or take 3 (1d6) necrotic damage and be frightened for 1 minute. An engulfed creature automatically succeeds on this saving throw. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Sand Camouflage",
      "desc": "The sand silhouette has advantage on Dexterity (Stealth) checks made to hide in desert terrain."
    },
    {
      "name": "Sand Form",
      "desc": "The sand silhouette can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Sand Glide",
      "desc": "The sand silhouette can burrow through nonmagical, loose sand without disturbing the material it is moving through."
    },
    {
      "name": "Undead Nature",
      "desc": "The sand silhouette doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Water Hypersusceptibility",
      "desc": "For every 5 feet the sand silhouette moves in water, or for every gallon of water splashed on it, it takes 2 (1d4) cold damage. In addition, the silhouette takes 10 cold damage when it starts its turn at least partially submerged in water."
    }
  ],
  "spell_list": [],
  "page_no": 312,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_sand-silhouette/"
}