{
  "slug": "sea_hag_bf",
  "desc": "",
  "name": "Sea Hag",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": "Hags",
  "alignment": "",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 51,
  "hit_dice": "",
  "speed": {
    "walk": 30,
    "swim": 40
  },
  "strength": 16,
  "dexterity": 12,
  "constitution": 14,
  "intelligence": 12,
  "wisdom": 12,
  "charisma": 12,
  "strength_save": 3,
  "dexterity_save": 1,
  "constitution_save": 2,
  "intelligence_save": 1,
  "wisdom_save": 1,
  "charisma_save": 1,
  "perception": 11,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Fey Resilience",
  "damage_immunities": "frightened",
  "condition_immunities": "",
  "senses": "darkvision 60 ft.",
  "languages": "Aquan,Common,Giant",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hag uses Death Glare. It then makes two Claw attacks."
    },
    {
      "name": "Claw",
      "desc": "_Melee Weapon Attack:_ +5 to hit, reach 5 ft., one target. _Hit:_ 10 (2d6+3) slashing damage."
    },
    {
      "name": "Death Glare",
      "desc": "One creature the hag can see within 30 feet of it must succeed on a DC 12 WIS save or be frightened until the end of its next turn. If the target is already frightened and fails the save, it is reduced to 0 HP instead. If reduced to 0 HP in this way, the creature is stable."
    }
  ],
  "bonus_actions": [
    {
      "name": "Illusory Appearance",
      "desc": "The hag covers itself and anything it is wearing or carrying with a magical illusion that makes it look like another creature of its general size and Humanoid shape. The illusion ends if the hag takes a bonus action to end it or if the hag dies.<br>The changes from this effect fail to hold up to physical inspection. For example, the hag could appear to have smooth skin, but someone touching it would feel its scaly flesh. Otherwise, a creature must take an action to visually inspect the illusion and succeed on a DC 20 INT (Investigation) check to discern that the hag is disguised."
    }
  ],
  "reactions": [
    {
      "name": "Barnacle Block",
      "desc": "When the hag takes damage from a source it can see, the hag can shift the barnacles and scales on its body to absorb some of the impact, reducing the damage by 4 (1d8)."
    }
  ],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The sea hag can breathe air and water."
    },
    {
      "name": "Fey Resilience",
      "desc": "The sea hag is resistant to the charmed and unconscious conditions."
    },
    {
      "name": "Horrific Appearance",
      "desc": "When a Humanoid that can see the hag's true form starts its turn within 30 feet of the hag, the hag can force it to make a DC 12 WIS save. On a failure, the creature is frightened until the start of its next turn. Unless surprised or the revelation of the hag's true form is sudden, such as the ending of Illusory Appearance, a creature can avert its eyes to avoid the save at the start of its turn. If the creature does so, it can't see the hag until the start of its next turn, when it can avert its eyes again. If the creature looks at the hag in the meantime, it must immediately make the save."
    },
    {
      "name": "Underwater Camouflage",
      "desc": "The hag's Stealth is 18 while underwater and not using Illusory Appearance."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_sea-hag/"
}