{
  "slug": "shriekbat",
  "desc": "This midnight-blue bat has a cavern-filling wingspan. The air near its mouth, large enough to carry a horse, visibly vibrates with sound pulses._  \nShriekbats thrive in the cavernous spaces of the Underworld where they face little competition from dragons, rocs, and other large flying creatures, as they would aboveground. Despite their enormousness, the bats deftly maneuver among the stalactites and stalagmites crowding underground caverns. When they attack prey, or in the very rare cases where they must escape predators, they emit a terrible shriek that overwhelms their foes and allows them to easily grab prey or escape. Shriekbat echolocation uses subsonic frequencies, allowing the bats to fly in relative silence.  \n**Kobold Companions.** Kobold bat keepers know the secret to raising young shriekbats. The bat keepers often risk their lives to procure young, using the bats for protection and as companions. A bat keeper returns its shriekbat to the wild before the bat reaches adulthood, when it would become too large for the cramped kobold tunnels. A bat keeper tracks the shriekbats it releases, and often returns to visit its former companions. Shriekbats prove surprisingly keen at remembering former kobold handlers (whether such handlers treated them well or poorly), and they often allow fondly remembered handlers to take a single pup from their litters, ensuring the pup survives to adulthood and renewing the cycle.  \n**Long-Lived Omnivores.** Shriekbats live for nearly 50 years. They are social and promiscuous creatures that live in small groups in large caverns. They are omnivorous but prefer fresh meat to other food with lizards taking up the majority of their diet. Shriekbats can survive on rotten flesh, which allows them to eat ghouls and other undead populating the Underworld, but they find it less palatable. In overcrowded situations where multiple groups of shriekbats roost in the same cavern, a group of shriekbats might break away to find another hunting location if food becomes scarce.",
  "name": "Shriekbat",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 178,
  "hit_dice": "17d12+68",
  "speed": {
    "fly": 100,
    "walk": 20
  },
  "strength": 24,
  "dexterity": 12,
  "constitution": 18,
  "intelligence": 3,
  "wisdom": 10,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "thunder",
  "condition_immunities": "",
  "senses": "blindsight 60 ft., passive Perception 10",
  "languages": "—",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The shriekbat makes two attacks: one with its bite and one with its talons."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 20 (3d8 + 7) piercing damage.",
      "attack_bonus": 11,
      "damage_dice": "3d8+7"
    },
    {
      "name": "Talons",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 17 (3d6 + 7) slashing damage, and the target is grappled (escape DC 19). Until this grapple ends, the target is restrained, and the shriekbat can't use its talons on another target.",
      "attack_bonus": 11,
      "damage_dice": "3d6+7"
    },
    {
      "name": "Shriek (Recharge 5-6)",
      "desc": "The shriekbat emits a powerful burst of sound in a 30-foot cone. Each creature in that area must make a DC 16 Constitution saving throw, taking 42 (12d6) thunder damage on a failed save, or half as much damage on a successful one. If the saving throw fails by 5 or more, the target is also stunned for 1 minute. A stunned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Echolocation",
      "desc": "The shriekbat can't use its blindsight while deafened."
    }
  ],
  "spell_list": [],
  "page_no": 325,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_shriekbat/"
}