{
  "slug": "snake-with-a-hundred-mage-hands",
  "desc": "The small snake slithers forward. As it nears a door, spectral hands appear all around it, opening and pushing the door to allow the snake entry._  \n**Pet Project.** Thieves’ guilds with magically inclined members often imbue particularly crafty snakes with keen intelligence, telepathy, and the ability to summon dozens of mage hands to aid the guild. The small, stealthy creatures are capable of carrying out heists that are logistically impractical for humanoids due to their bulk. Predictably, the clever reptiles often escape their creators and carve out small territories for themselves in the more disreputable parts of cities where their true identities won’t easily be discovered.  \n**Mischievous Thieves.** Snakes with a hundred mage hands are known for their mischievous nature. Many are kleptomaniacs and swindlers, using their talents to deceive humanoids and steal objects they find pleasing.",
  "name": "Snake with a Hundred Mage Hands",
  "size": "Small",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": null,
  "hit_points": 67,
  "hit_dice": "15d6+15",
  "speed": {
    "swim": 30,
    "walk": 30,
    "climb": 30
  },
  "strength": 8,
  "dexterity": 18,
  "constitution": 12,
  "intelligence": 18,
  "wisdom": 10,
  "charisma": 6,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 2,
  "skills": {
    "perception": 2,
    "stealth": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 10 ft., passive Perception 12",
  "languages": "Common, telepathy 60 ft.",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The snake with a hundred mage hands makes two bite attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft. creature. Hit: 9 (2d4 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "2d4+4"
    },
    {
      "name": "Flying Fists (Recharge 5-6)",
      "desc": "The snake unleashes a flurry of spectral punches in a 30-foot cone. Each creature in the area must make a DC 14 Dexterity saving throw. On a failure, a creature takes 10 (3d6) bludgeoning damage and is knocked prone. On a success, a creature takes half the damage and isn't knocked prone."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Disruptive Ploy",
      "desc": "As a bonus action, the snake performs a minor ploy with its mage hands against a target it can see within 30 feet of it. The target must succeed on a DC 14 Dexterity saving throw or have disadvantage on its next ability check, attack roll, or saving throw (the snake's choice) as the snake magically removes the target's helmet, upends the target's quiver, or performs some other form of distraction."
    },
    {
      "name": "One Hundred Mage Hands",
      "desc": "The snake is surrounded by one hundred, magical, spectral hands. The hands can't be targeted by spells or attacks and are immune to damage. The hands float within 30 feet of the snake and move with their serpent commander. The snake can decide if the hands are visible. Each hand can carry an object weighing up to 10 pounds and no more than three hands can work in tandem to carry one larger object. The snake's Dexterity (Sleight of Hand) checks have a range of 30 feet. Whenever the snake makes a Dexterity (Sleight of Hand) check, it can make up to four such checks as part of the same action, but each check must be against a different target. The snake can perform actions normally restricted to creatures with hands, such as opening a door, stirring a bowl of soup, or carrying a lantern. The hands can't wield weapons or shields or make attacks, except as part of the snake's Flying Fists action."
    }
  ],
  "spell_list": [],
  "page_no": 333,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_snake-with-a-hundred-mage-hands/"
}