{
  "slug": "stellar-rorqual",
  "desc": "This massive cetacean swims through the Void while crackling lines of energy race between the crystal formations on its body and massive, feather-like flippers._  \n**Born in the Void.** Stellar rorqual are born, live, and die in the depths of the space between the stars. Generally peaceful creatures, they live to impossibly old age, singing their ancient songs to each other across immense distances.  \n**Living Starships.** Those lucky or skilled enough can use a stellar rorqual as a living ship to provide passage between planes. This partnership can be based on friendship or domination, depending on the method of training.  \nCommunication with the rorqual is mostly telepathic, and the crystalline growths on the inside of its jaws display what the rorqual sees. Though a stellar rorqual finds it uncomfortable, it can enter the Material Plane from the Void to load or disembark passengers. When this occurs, the rorqual lands in an available ocean, if possible.  \n**Solar Feeders.** The stellar rorqual does not need to eat and seldom opens its actual mouth. As it travels the Void, it absorbs solar energy from stars, which forms crystalline growths on the rorqual’s body. The growths slowly release the energy into the rorqual, providing it with the only form of sustenance it needs.  \n**Void Traveler.** The stellar rorqual doesn’t require air, food, drink, sleep, or ambient pressure.",
  "name": "Stellar Rorqual",
  "size": "Gargantuan",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 165,
  "hit_dice": "10d20+60",
  "speed": {
    "walk": 0,
    "fly": 80,
    "swim": 40
  },
  "strength": 26,
  "dexterity": 8,
  "constitution": 22,
  "intelligence": 7,
  "wisdom": 18,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": 2,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "perception": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "force",
  "damage_immunities": "cold, fire, radiant",
  "condition_immunities": "",
  "senses": "blindsight 360 ft., passive Perception 18",
  "languages": "understands Void Speech but can’t speak, telepathy 360 ft.",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The stellar rorqual makes two attacks: one with its head smash and one with its tail slap. Alternatively, it can use Energy Burst twice."
    },
    {
      "name": "Head Smash",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 30 (4d10 + 8) bludgeoning damage.",
      "attack_bonus": 12,
      "damage_dice": "4d10+8"
    },
    {
      "name": "Tail Slap",
      "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 26 (4d8 + 8) bludgeoning damage.",
      "attack_bonus": 12,
      "damage_dice": "4d8+8"
    },
    {
      "name": "Energy Burst",
      "desc": "Ranged Spell Attack: +8 to hit, range 120 ft., one target. Hit: 24 (7d6) force damage.",
      "attack_bonus": 8,
      "damage_dice": "7d6"
    },
    {
      "name": "Planar Dive",
      "desc": "The stellar rorqual can transport itself and any willing creature inside its mouth to the Astral, Ethereal, or Material Planes or to the Void. This works like the plane shift spell, except the stellar rorqual can transport any number of willing creatures as long as they are inside its mouth. The stellar rorqual can't use this action to banish an unwilling creature."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Mouth Compartment",
      "desc": "The stellar rorqual's mouth is a compartment that is 60 feet long, 40 feet wide, and 30 feet high with a single entry and exit. The rorqual can control the ambient pressure, temperature, gravity, moisture, and breathable air levels inside its mouth, allowing creatures and objects within it to exist comfortably in spite of conditions outside the rorqual. Creatures and objects within the rorqual have total cover against attacks and other effects outside the rorqual. As an action, a creature inside the rorqual can interact with the crystalline growths inside the rorqual's mouth and sense what the rorqual senses, gaining the benefits of its blindsight."
    },
    {
      "name": "Stellar Burst",
      "desc": "When the stellar rorqual dies, it releases all of its stored solar energy in a massive explosion. Each creature within 120 feet of the rorqual must make a DC 18 Dexterity saving throw, taking 21 (6d6) fire damage and 21 (6d6) radiant damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Void Flier",
      "desc": "When flying between stars, the stellar rorqual magically glides on solar winds, making the immense journey through the Void in an impossibly short time."
    }
  ],
  "spell_list": [],
  "page_no": 338,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_stellar-rorqual/"
}