{
  "slug": "swamp-lily",
  "desc": "This large, delicate, orange flower stands guard over a sumptuous banquet laid out near its roots._  \n**Deceivingly Delectable.** Swamp lilies are carnivorous plants that thrive on the rotting remains of creatures they poison. While they can envenom victims with their tentacle-like roots, they prefer to lure in prey with an illusion of a seemingly benign feast. The lilies exude a scent of fruit with the musk from prey animals to complement the illusion. Their victims then peaceably eat the food, unwittingly ingesting the lily’s roots and deadly toxin.  \n**Wandering Menace.** After killing enough prey to keep it well fed and provide nourishment for its seeds, it travels where it can sense creatures with a strong desire for food. Though the plant does not understand the dynamics of food supply, its ability to understand thoughts pertaining to food allows it to relocate where the inhabitants are desperate and more susceptible to its illusory feast.  \n**Grove Guardians.** Druids and creatures respectful of poisonous plants or resistant to the swamp lilies’ illusions often establish a rapport with the lilies as protectors. Partners to the lilies give additional credence to the illusions produced by the plants and encourage unwanted guests to partake of the nonexistent food.",
  "name": "Swamp Lily",
  "size": "Medium",
  "type": "Plant",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 136,
  "hit_dice": "16d8+64",
  "speed": {
    "walk": 15
  },
  "strength": 16,
  "dexterity": 9,
  "constitution": 18,
  "intelligence": 4,
  "wisdom": 12,
  "charisma": 17,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, deafened, poisoned",
  "senses": "tremorsense 60 ft. (blind beyond this radius), passive Perception 11",
  "languages": "—",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The swamp lily makes two root attacks."
    },
    {
      "name": "Root",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one creature. Hit: 12 (2d8 + 3) bludgeoning damage, and the target must make a DC 15 Constitution saving throw, taking 10 (3d6) poison damage on a failed save, or half as much damage on a successful one.",
      "attack_bonus": 6,
      "damage_dice": "2d8+3"
    },
    {
      "name": "Fake Feast",
      "desc": "The swamp lily magically creates the image of a banquet within 5 feet of itself that compels creatures to eat from it. Each creature within 60 feet of the banquet that can see the banquet must succeed on a DC 15 Wisdom saving throw or be charmed by the lily. The lily must take a bonus action on its subsequent turns to maintain the illusion. The illusion ends if the lily is incapacitated.\n\nWhile charmed by the lily, a target is incapacitated and ignores the banquets of other lilies. If the charmed target is more than 5 feet away from the lily's banquet, the target must move on its turn toward the banquet by the most direct route, trying to get within 5 feet. It doesn't avoid opportunity attacks, but before moving into damaging terrain, such as lava or a pit, and whenever it takes damage from a source other than the lily, the target can repeat the saving throw. A charmed target can also repeat the saving throw at the end of each of its turns. If the saving throw is successful, the effect ends on it. A target that successfully saves is immune to this swamp lily's Fake Feast for the next 24 hours.\n\nIf the charmed target starts its turn within 5 feet of the banquet, it eats the feast and must make a DC 15 Constitution saving throw. On a failure, the creature takes 21 (6d6) poison damage and is poisoned for 1 minute. On a success, the creature takes half the damage and isn't poisoned."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Discern Food Preferences",
      "desc": "The swamp lily can use an action to read the surface thoughts of all creatures within 60 feet of it. This works like the detect thoughts spell, except the lily can only determine each creature's favorite food. Each creature within range must succeed on a DC 15 Wisdom saving throw or have disadvantage on its saving throw against the lily's Fake Feast action."
    }
  ],
  "spell_list": [],
  "page_no": 342,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_swamp-lily/"
}