{
  "slug": "swampgas-bubble",
  "desc": "A semi-permeable bubble surrounds a blue-tinged gas. The bubble jauntily bobs in the air._  \n**Consumers of Exhaled Gases.** Swampgas bubbles feed on concentrated exhalations from living creatures. They surround their victims’ heads and extract these gases, usually in copious quantities as their victims panic and breathe harder. This leads many to believe the bubbles are sadistic. However, encounters with swampgas bubbles are rarely fatal, since the bubbles typically sate themselves by the time their prey falls unconscious, losing interest as the creature’s breathing slows.  \n**Attracted to Fire.** A swampgas bubble is instinctively drawn to fire, even though they are highly flammable. Its susceptibility to fire makes it relatively easy to dispatch, but its explosive ending makes the use of fire risky for its foes. In fact, this form of death, accompanied by a beautiful burst of blue light, is just part of the bubble’s overall lifecycle. Its outer layer hardens and shatters, and the remaining bits fall into the swamp where they grow and encase swamp gasses, developing into new swampgas bubbles.  \n**Ooze Nature.** A swampgas bubble doesn’t require sleep.",
  "name": "Swampgas Bubble",
  "size": "Medium",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 8,
  "armor_desc": null,
  "hit_points": 59,
  "hit_dice": "7d8+28",
  "speed": {
    "fly": 30,
    "hover": true,
    "walk": 20
  },
  "strength": 16,
  "dexterity": 7,
  "constitution": 18,
  "intelligence": 1,
  "wisdom": 10,
  "charisma": 3,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "fire",
  "damage_resistances": "",
  "damage_immunities": "bludgeoning, poison",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, poisoned, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 10",
  "languages": "—",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Pseudopod",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage plus 4 (1d8) poison damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Suffocating Grasp",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d6 + 3) bludgeoning damage. If the target is Medium or smaller, the swampgas bubble attaches to the target's head, and the target is blinded while the bubble is attached. While attached, the bubble can't make pseudopod attacks against the target. At the start of each of the bubble's turns, the target takes 9 (2d8) poison damage and begins suffocating as it breathes in the poisonous gases within the bubble. A creature is affected even if it holds its breath, but creatures that don't need to breathe aren't affected.\n\nThe bubble can detach itself by spending 5 feet of its movement. It does so if its target falls unconscious or dies. A creature, including the target, can take its action to detach the bubble by succeeding on a DC 13 Strength check.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Bludgeoning Bounce",
      "desc": "Whenever the swampgas bubble is subjected to bludgeoning damage, it takes no damage and instead is pushed up to 10 feet away from the source of the bludgeoning damage. If the bubble is subjected to bludgeoning damage while attached to a creature, the bubble must succeed on a DC 13 Strength saving throw or detach from the creature and be pushed up to 5 feet away."
    },
    {
      "name": "Fiery Death",
      "desc": "If the swampgas bubble has half its hp or fewer and takes any fire damage, it dies explosively. Each creature within 20 feet of the bubble must make a DC 13 Dexterity saving throw, taking 7 (2d6) fire damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "spell_list": [],
  "page_no": 343,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_swampgas-bubble/"
}