{
  "slug": "timingila",
  "desc": "This massive shark-eel surges out of the water, opening titanic jaws large enough to bite a ship in half._  \n**Bribable.** Wise captains traveling through timingila hunting grounds often carry tithes and offerings in hopes of placating the creatures.  \n**Lesser Leviathan.** The timingila is one of the largest creatures in the seas. Some scholarly tomes suggest a connection between the timingila and rarer leviathans but no definitive proof has yet been found.  \n**Master of the Seas.** The timingila is an apex predator of the oceans. It hunts whales primarily but eats anything it can catch. The timingila is fiercely territorial and considers all of the ocean its personal domain.",
  "name": "Timingila",
  "size": "Gargantuan",
  "type": "Monstrosity",
  "subtype": "titan",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 232,
  "hit_dice": "15d20+75",
  "speed": {
    "swim": 60,
    "walk": 0
  },
  "strength": 28,
  "dexterity": 5,
  "constitution": 21,
  "intelligence": 8,
  "wisdom": 7,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 10,
  "intelligence_save": null,
  "wisdom_save": 3,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "perception": 8,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "cold, thunder",
  "condition_immunities": "frightened",
  "senses": "blindsight 120 ft., passive Perception 18",
  "languages": "understands Abyssal, Celestial, Draconic, and Infernal but can’t speak",
  "challenge_rating": "15",
  "cr": 15,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The timingila makes four attacks: one with its bite, one with its tail slap, and two with its flippers."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 25 (3d10 + 9) piercing damage. If the target is a Large or smaller creature, it must succeed on a DC 18 Dexterity saving throw or be swallowed by the timingila. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the timingila, and it takes 21 (6d6) acid damage at the start of each of the timingila's turns.\n\nIf the timingila takes 30 damage or more on a single turn from a creature inside it, the timingila must succeed on a DC 20 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the timingila. If the timingila dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 20 feet of movement, exiting prone.",
      "attack_bonus": 14,
      "damage_dice": "3d10+9"
    },
    {
      "name": "Flipper",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 16 (2d6 + 9) bludgeoning damage.",
      "attack_bonus": 14,
      "damage_dice": "2d6+9"
    },
    {
      "name": "Tail Slap",
      "desc": "Melee Weapon Attack: +14 to hit, reach 20 ft., one target. Hit: 18 (2d8 + 9) bludgeoning damage, and the target must succeed on a DC 18 Strength saving throw or be pushed up to 10 feet away from the timingila and knocked prone.",
      "attack_bonus": 14,
      "damage_dice": "2d8+9"
    },
    {
      "name": "Breach",
      "desc": "The timingila swims up to its swimming speed without provoking opportunity attacks. If it breaches the water's surface, it crashes back down, creating a wave in a 30-foot-wide, 120-footlong line that is 30 feet tall. Any Gargantuan or smaller vehicles in the line are carried up to 100 feet away from the timingila and have a 50 percent chance of capsizing."
    },
    {
      "name": "Resonating Roar (Recharge 5-6)",
      "desc": "The timingila roars in a 90-foot cone. Each creature in the area must make a DC 18 Constitution saving throw. On a failure, a creature takes 45 (10d8) thunder damage and is deafened for 1 minute. On a success, a creature takes half the damage and isn't deafened. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nIf a vehicle is in the area, the roar travels into the vehicle and resonates inside it. Each creature inside the vehicle, even if the creature is outside the roar's area, must succeed on a DC 18 Constitution saving throw or take half the damage from the roar."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Siege Monster",
      "desc": "The timingila deals double damage to objects and structures."
    },
    {
      "name": "Water Breathing",
      "desc": "The timingila can breathe only underwater."
    }
  ],
  "spell_list": [],
  "page_no": 349,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_timingila/"
}