{
  "slug": "treacle",
  "desc": "_A curious bunny, an abandoned infant, or a delicate songbird can spell slow and agonizing death for the unprepared. Beneath any of these facades may lurk a treacle waiting to feed on a gullible victim, mewling and cooing all the while. Whether by natural selection or arcane tampering, these compact oozes prey on kindness._  \n**Diet of Blood.** Treacles feed on blood but lack the natural weapons or acid of larger slimes. To survive, prey must welcome and embrace them, unaware of the threat. The treacles’ soft bodies absorb psychic impressions and take the shape of unthreatening creatures. In the wild, treacles assume the form of an animal’s offspring to lie close for several hours.  \n**Pet Polymorph.** Among humanoids, treacles transform into pets, infants, or injured animals. In the most horrific cases, these oozes resemble children’s toys. Treacles don’t choose their forms consciously, but instead rely on a primitive form of telepathy to sense which shapes a potential victim finds least threatening or most enticing. They can hold a new shape for several hours, even if the intended victim is no longer present.  \n**Slow Drain.** Once they have assumed a nonthreatening form, treacles mewl, sing, or make pitiful noises to attract attention. Once they’re in contact with a potential victim, treacles drain blood slowly, ideally while their prey sleeps or is paralyzed. If threatened or injured, treacles flee. A sated treacle detaches from its victim host and seeks a cool, dark place to rest and digest. With enough food and safety, a treacle divides into two fully-grown oozes. Rarely, a mutation prevents this division, so that the sterile treacle instead grows in size. The largest can mimic human children and the elderly.  \nTreacles are small, weighing less than six lb. Their natural forms are pale and iridescent, like oil on fresh milk, but they’re seldom seen this way.",
  "name": "Treacle",
  "size": "Tiny",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 22,
  "hit_dice": "4d4+12",
  "speed": {
    "walk": 15,
    "climb": 10
  },
  "strength": 4,
  "dexterity": 6,
  "constitution": 17,
  "intelligence": 1,
  "wisdom": 1,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "deception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 60 ft., passive Perception 10",
  "languages": "-",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Reshape",
      "desc": "The treacle assumes the shape of any tiny creature or object. A reshaped treacle gains the movement of its new form but no other special qualities."
    },
    {
      "name": "Blood Drain (1/hour)",
      "desc": "A treacle touching the skin of a warm-blooded creature inflicts 4 (1d8) necrotic damage per hour of contact, and the victim's maximum hit points are reduced by the same number. Blood is drained so slowly that the victim doesn't notice the damage unless he or she breaks contact with the treacle (sets it down or hands it to someone else, for example). When contact is broken, the victim notices blood on his or her skin or clothes with a successful DC 13 Wisdom (Perception) check."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The treacle can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Charming Presence",
      "desc": "The treacle has an uncanny ability to sense and to play off of another creature's emotions. It uses Charisma (Deception) to oppose Wisdom (Insight or Perception) skill checks made to see through its ruse, and it has advantage on its check."
    }
  ],
  "spell_list": [],
  "page_no": 387,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_treacle/"
}