{
  "slug": "urochar-tob1-2023",
  "desc": "False",
  "name": "Urochar",
  "size": "Huge",
  "type": "Aberration",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Evil",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 256,
  "hit_dice": "19d12 + 133",
  "speed": {
    "walk": 40
  },
  "strength": 24,
  "dexterity": 15,
  "constitution": 24,
  "intelligence": 14,
  "wisdom": 14,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 8,
  "constitution_save": 13,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": 11,
  "perception": 18,
  "skills": {
    "Perception": 8,
    "Stealth": 8
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "cold, lightning; bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "thunder",
  "condition_immunities": "frightened",
  "senses": "truesight 120 ft., passive Perception 18",
  "languages": "understands Darakhul and Void Speech but can’t speak",
  "challenge_rating": "17",
  "cr": 17,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The urochar can use its Paralyzing Gaze. It then makes four Tentacle attacks."
    },
    {
      "name": "Tentacle",
      "desc": "Melee Weapon Attack: +13 to hit, reach 20 ft., one target. Hit: 25 (4d8 + 7) bludgeoning damage, and the target is grappled (escape DC 19) if it is a Large or smaller creature. Until this grapple ends, the target is restrained. The urochar has four tentacles, each can grapple only one target."
    },
    {
      "name": "Paralyzing Gaze",
      "desc": "The urochar turns its eerie gaze upon one creature it can see within 60 feet of it. The target must succeed on a DC 19 Wisdom saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to the urochar's Paralyzing Gaze for the next 24 hours."
    },
    {
      "name": "Strangling Grasp",
      "desc": "Each creature grappled by the urochar must make a DC 19 Strength saving throw. On a failure, a creature takes 36 (8d8) bludgeoning damage and can't breathe until the grapple ends. On a success, a creature takes half the damage and can still breathe."
    }
  ],
  "bonus_actions": [
    {
      "name": "Hidden Step",
      "desc": "The urochar magically teleports, along with any equipment it is wearing or carrying, up to 30 feet to an unoccupied space it can see and takes the Hide action. Grappled creatures are no longer grappled and don't teleport with it."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Mind-Rending Death",
      "desc": "When the urochar dies, it releases all the fear it consumed in its lifetime in a single, mind-rending wave. Each creature within 30 feet of it must succeed on a DC 19 Charisma saving throw or be frightened for 1 minute. A frightened creature takes 14 (4d6) psychic damage at the start of each of its turns. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    {
      "name": "Rubbery Body",
      "desc": "The urochar's body is rubbery with few bones, allowing it to easily move through any opening large enough for a Medium creature. It can squeeze through any opening large enough for a Small creature. The urochar's destination must still have suitable room to accommodate its volume."
    },
    {
      "name": "Spider Climb",
      "desc": "The urochar can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    }
  ],
  "spell_list": [],
  "page_no": 374,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_urochar/"
}