{
  "slug": "yaojing",
  "desc": "This long-nosed, fox-like humanoid gestures silently with a smile on its lips and a twinkle in its eyes._  \nYaojing find peace traveling the wilds and quietly helping homesteaders and other travelers. They appear to be wiry redheaded men in light clothing. Their features are a mix of human and fox with a long nose, weak chin, and clever eyes.  \n**Silent Servitors.** Before they arrive on the Material Plane, yaojing take a vow of silence. Their vow precludes them from using their telepathy or voice to communicate with mortals. If a yaojing under vow is forced to communicate with more than sign or body language, it must retire to its planar home to live in silent contemplation for 108 years before it can once again travel the Material.  \n**Charlatan Haters.** Yaojing hate nothing so much as those who would use a mortal’s faith in the gods against them. When yaojing encounter such shysters in their travels, they work tirelessly to bring the charlatans to justice and remove the blight such creatures represent. Yaojing prefer to turn the charlatans over to local authorities for punishment appropriate to the laws of the land they are traveling, but they take on the role of judge when representatives of the law are absent.  \n**Mountain Mystics.** Some yaojing take up a monastic life. They build shrines on mountaintops where they silently teach their small congregations of adherents the joys of a quiet life of service and contemplation. They also teach their disciples how to avoid being fooled by charlatans and that harmonious societies must be free of such liars.",
  "name": "Yaojing",
  "size": "Medium",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Good",
  "armor_class": 15,
  "armor_desc": null,
  "hit_points": 202,
  "hit_dice": "27d8+81",
  "speed": {
    "walk": 40
  },
  "strength": 14,
  "dexterity": 21,
  "constitution": 16,
  "intelligence": 16,
  "wisdom": 18,
  "charisma": 21,
  "strength_save": null,
  "dexterity_save": 10,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 10,
  "perception": 9,
  "skills": {
    "insight": 9,
    "perception": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "charmed, deafened, exhaustion, frightened",
  "senses": "truesight 60 ft., passive Perception 19",
  "languages": "all, telepathy 120 ft.",
  "challenge_rating": "15",
  "cr": 15,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The yaojing uses Blasphemer's Bane. It then makes three attacks."
    },
    {
      "name": "Sacred Fist",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage and 13 (3d8) radiant damage.",
      "attack_bonus": 10,
      "damage_dice": "2d8+5"
    },
    {
      "name": "Sacred Bolt",
      "desc": "Ranged Spell Attack: +10 to hit, range 60 ft., one target. Hit: 22 (5d8) radiant damage.",
      "attack_bonus": 10,
      "damage_dice": "5d8"
    },
    {
      "name": "Blasphemer's Bane",
      "desc": "The yaojing makes a ward of censure against a creature it can see within 30 feet of it. The target must succeed on a DC 18 Wisdom saving throw or be unable to cast spells or maintain concentration on spells until the beginning of the yaojing's next turn."
    },
    {
      "name": "Radiant Spin (Recharge 5-6)",
      "desc": "The yaojing performs a spinning kick brimming with radiant energy. Each creature within 10 feet of the yaojing must make a DC 18 Dexterity saving throw. On a failure, a creature takes 22 (5d8) bludgeoning damage and 22 (5d8) radiant damage and is pushed up to 10 feet away from the yaojing. On a success, a creature takes half the damage and isn't pushed."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Charlatan's Bane",
      "desc": "The yaojing knows if it hears a lie, and it has advantage on Wisdom (Insight) checks to determine if a creature is attempting to deceive it."
    },
    {
      "name": "Magic Resistance",
      "desc": "The yaojing has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The yaojing's weapon attacks are magical."
    },
    {
      "name": "Motion Blur",
      "desc": "If the yaojing moves at least 10 feet on its turn, attack rolls against it have disadvantage until the start of its next turn."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The yaojing's innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no verbal or material components.\nAt will: detect evil and good, silence\n3/day each: beacon of hope, bestow curse\n1/day each: death ward, dispel evil and good"
    }
  ],
  "spell_list": [],
  "page_no": 377,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_yaojing/"
}