{
  "slug": "apaxrusl",
  "desc": "Thick desert grit encrusts a decayed form as it stalks forward, clouds of biting sand flitting about at its behest._  \nApaxrusl, or sand drudges, are created through dark rituals that merge a corpse with desert sand.  \n**Soul Infusion.** The rituals used to create an apaxrusl call for infusing damned souls into the sand, and would-be creators regularly make bargains with demons to acquire this unique component. Oftentimes, the deal goes poorly for the creator, leaving the resulting apaxrusl to wander the desert without a master.  \n**Abyssal Intelligence.** The damned souls filling the apaxrusl give it intelligence, but its constructed form keeps it loyal, making it a valuable asset to its creator. Necromancers often create apaxrusl to lead small groups of undead on specific tasks, confident in the construct’s ability to execute orders and lead the undead while away from the direct control of the necromancer.  \n**Construct Nature.** The apaxrusl doesn’t require air, food, drink, or sleep.",
  "name": "Apaxrusl",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 60,
  "hit_dice": "8d8+24",
  "speed": {
    "burrow": 30,
    "walk": 30
  },
  "strength": 17,
  "dexterity": 13,
  "constitution": 16,
  "intelligence": 9,
  "wisdom": 6,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 3
  },
  "damage_vulnerabilities": "thunder",
  "damage_resistances": "",
  "damage_immunities": "fire, poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., tremorsense 30 ft., passive Perception 8",
  "languages": "Abyssal and one language of its creator",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The apaxrusl makes two slam attacks. If both attacks hit the same creature, the target is blinded for 1 minute or until it uses an action to wipe its eyes."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage.",
      "attack_bonus": 5,
      "damage_dice": "1d8+3"
    },
    {
      "name": "Fiery Sands (Recharge 5-6)",
      "desc": "Sand whips violently around the apaxrusl. Each creature within 10 feet of the apaxrusl must make a DC 13 Constitution saving throw, taking 10 (3d6) slashing damage and 10 (3d6) fire damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Shifting Sands",
      "desc": "The apaxrusl can shift the flowing sands of its body to avoid harm. When the apaxrusl takes damage, roll a d12. Reduce the damage it takes by the number rolled."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Earth Glide",
      "desc": "The apaxrusl can burrow through nonmagical, unworked earth and stone. While doing so, the apaxrusl doesn't disturb the material it moves through."
    },
    {
      "name": "Fiendish Construct",
      "desc": "The apaxrusl's sand is infused with the souls of the damned. Its type is fiend in addition to construct when determining the effects of features such as a paladin's Divine Smite or a ranger's Primeval Awareness."
    }
  ],
  "spell_list": [],
  "page_no": 27,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_apaxrusl/"
}