{
  "slug": "ash-drake",
  "desc": "_A lean and dull-scaled ash drake often perches on a chimney as if it just crawled out, its tail still hanging into the chimney as smoke billows out._  \n**Chimney Nesting.** Ash drakes clog chimney flues and delight in dusting crowds with thick, choking ash and soot, while the drakes laugh with sneering, wheezing tones. To placate the creatures, owners of smelters and smithies leave large piles of ash for the drakes to play in, with the hope they leave the shop and its workers alone. Anyone hunting ash drakes finds them very difficult to attack in their cramped lairs because the creatures blend in with the surroundings. Ash drakes often befriend kobolds, who have little trouble appeasing the beasts and appreciate the added security they bring.  \n**Hunt Strays and Pets.** Ash drakes eat rats and stray animals, although few can resist snatching an unattended, possibly beloved pet. Contrary to popular opinion, this drake doesn’t consume ash, but enjoys a pile of ash like a cat would catnip, rolling around in it and becoming wild-eyed. Anyone who disrupts such play becomes the target of the creature’s intensely hot and sooty breath weapon.  \nWhile an ash drake is three feet long with a four-foot long tail that seems to trail off into smoke, it weighs less than one might expect—approximately ten lb. Every third winter, when chimneys are active, a male drake leaves his lair to find a mate. If the new couple roosts in a city or town, the nearby streets know it, as the air becomes nearly unbreathable with soot. The resulting eggs are left in a suitable chimney, and one of the parents protects the young until they leave the nest at two years of age.  \n**Volcanic Haunts.** Ash drakes outside a city live in or near volcanic plateaus, and mutter about the lack of neighbors to bully. In the wild, an ash drake may partner with a red dragon or flame dragon, since the dragon provides its lesser cousin with plenty of ash.",
  "name": "Ash Drake",
  "size": "Small",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 117,
  "hit_dice": "18d6+54",
  "speed": {
    "walk": 30,
    "fly": 60
  },
  "strength": 14,
  "dexterity": 15,
  "constitution": 16,
  "intelligence": 9,
  "wisdom": 15,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": 4,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "fire",
  "damage_immunities": "",
  "condition_immunities": "paralyzed, unconscious",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "Common, Draconic",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The ash drake makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) piercing damage + 3 (1d6) fire damage.",
      "attack_bonus": 4,
      "damage_dice": "2d6"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage.",
      "attack_bonus": 4,
      "damage_dice": "2d6"
    },
    {
      "name": "Ash Cloud",
      "desc": "An ash drake can beat its wings and create a cloud of ash that extends 10 feet in all directions, centered on itself. This cloud provides half cover, though the ash drake can see normally through its own cloud. Any creature that enters or starts its turn in the cloud must succeed on a DC 14 Constitution saving throw or become blinded for 1d6 rounds."
    },
    {
      "name": "Ash Breath (recharge 6)",
      "desc": "An ash drake spews a 20-foot cone of blistering hot, choking ash. Any targets in the path of this spray takes 14 (4d6) fire damage and become poisoned for one minute; a successful DC 13 Dexterity saving throw reduces damage by half and negates the poisoning. A poisoned creature repeats the saving throw at the end of each of its turns, ending the effect on itself with a successful save."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": null,
  "spell_list": [],
  "page_no": 149,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_ash-drake/"
}