{
  "slug": "ashen-custodian",
  "desc": "A fire-haired woman with ashen skin gently touches a dying tree, igniting it and the surrounding undergrowth._  \n**Wardens of Wildfire.** This beautiful fey with fiery hair and ashen skin wears a cloak of soot as she treads the forests of the world. The ashen custodian cleanses forests with flames, allowing them to grow anew and maintaining the natural cycle of death and rebirth. Though ashen custodians primarily live solitary lives, Open Game License",
  "name": "Ashen Custodian",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 15,
  "armor_desc": null,
  "hit_points": 99,
  "hit_dice": "18d8+18",
  "speed": {
    "walk": 30
  },
  "strength": 10,
  "dexterity": 21,
  "constitution": 12,
  "intelligence": 14,
  "wisdom": 15,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 4,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 5,
  "skills": {
    "nature": 5,
    "perception": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "fire",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 15",
  "languages": "Elvish, Sylvan",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The ashen custodian makes two cleansing strike attacks."
    },
    {
      "name": "Cleansing Strike",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) bludgeoning damage plus 9 (2d8) fire damage. If the target is a creature or a flammable object, it ignites. Until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns.",
      "attack_bonus": 8,
      "damage_dice": "1d8+5"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fire Controller",
      "desc": "As a bonus action, the ashen custodian can create or extinguish a nonmagical fire in a 5-foot cube within 30 feet of her, or she can expand an existing fire within 30 feet of her by 5 feet in one direction. If she creates or expands a fire, the target location must have suitable fuel for the fire, such as paper or wood. If the ashen custodian targets a fire elemental with this trait, the fire elemental has advantage (expanded) or disadvantage (extinguished) on attack rolls until the end of its next turn."
    },
    {
      "name": "Forest Cleanser",
      "desc": "When the ashen custodian hits a plant or plant creature with her Cleansing Strike, the target takes an extra 2d8 fire damage."
    },
    {
      "name": "Magic Resistance",
      "desc": "The ashen custodian has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Warming Presence",
      "desc": "When a hostile creature starts its turn within 10 feet of the ashen custodian, the creature must succeed on a DC 15 Constitution saving throw or take 3 (1d6) fire damage. When a friendly creature within 10 feet of the ashen custodian regains hp, the creature regains an extra 1d6 hp."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The ashen custodian's innate spellcasting ability is Charisma (spell save DC 15). The ashen custodian can innately cast the following spells, requiring no material components:\nAt will: druidcraft, produce flame\n3/day each: burning hands, cure wounds, flame blade, fog cloud\n1/day each: conjure elemental (fire elemental only), wall of fire"
    }
  ],
  "spell_list": [],
  "page_no": 29,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_ashen-custodian/"
}