{
  "slug": "bleakheart",
  "desc": "A humanoid in blurred gray tones settles in the shadowed corner of a dimly-lit room and disappears from view._  \n**Poor Players.** Some people are driven to perform. They crave the adulation of their peers, the attention of strangers, the promise of fame and the immortality it brings. Unfortunately, not every such artist has the talent and perseverance to succeed. Whenever a minstrel flees a stage pelted by rotting produce and ends their life in despair, or an actor’s alcoholism leads them to an early grave after a scathing review, a bleakheart is born. Once a bleakheart rises, it seeks to spread hopelessness and create new bleakhearts.  \n**Walking Shadows.** Bleakhearts exist on the fringes of the societies where they once lived. When they are not skulking in the dark, the citizenry ignores them as they would any other drifter. They linger around taverns, theaters, and other places the living visit for entertainment. Sometimes the sight and sound of merriment rouses the bleakhearts from cold despair to hot rage. The resulting carnage invariably leads to the destruction of the originating bleakheart and the creation of several new ones.  \n**Familiar Faces.** A bleakheart gains grim satisfaction in causing distress to the living, especially those who have recently experienced joy. By day, they lurk in deeply shadowed areas of settlements, usually around places of entertainment, and skim the thoughts of passersby. When a bleakheart detects someone who is elated, it follows them home for further observation. While its victim sleeps, the bleakheart probes their mind, causing the victim nightmares about the subject of their happiness. Once the victim awakens, its joy turned to pain, the bleakheart disguises itself as the personage who once brought the victim joy and reveals itself. Even while magically disguised, a bleakheart appears disquietingly out of focus.  \n**Undead Nature.** A bleakheart doesn’t require air, food, drink, or sleep.",
  "name": "Bleakheart",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 12,
  "armor_desc": null,
  "hit_points": 66,
  "hit_dice": "12d8+12",
  "speed": {
    "walk": 30
  },
  "strength": 10,
  "dexterity": 15,
  "constitution": 12,
  "intelligence": 10,
  "wisdom": 10,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "persuasion": 5,
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, poisoned",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Common",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Disheartening Touch",
      "desc": "Melee Spell Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (3d6) psychic damage.",
      "attack_bonus": 5,
      "damage_dice": "3d6"
    },
    {
      "name": "Steal Joy (Recharge 5-6)",
      "desc": "Each creature of the bleakheart's choice that is within 20 feet of the bleakheart and aware of it must succeed on a DC 13 Wisdom saving throw or its Charisma score is reduced by 1d4. A creature that has taken psychic damage from the bleakheart's Disheartening Touch within the last minute has disadvantage on this saving throw. A creature that has its Charisma reduced to 0 ends its life at the earliest opportunity, and a new bleakheart rises from its corpse 1d4 hours later. Otherwise, the Charisma reduction lasts until the target finishes a long rest."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Indiscernible in Shadows",
      "desc": "While in dim light or darkness, the bleakheart is invisible."
    },
    {
      "name": "Silent Entry (3/Day)",
      "desc": "As a bonus action, the bleakheart can silently unlock a door within 10 feet of it that is held shut by a mundane lock. If a door has multiple locks, only one is unlocked per use of this trait."
    },
    {
      "name": "Sunlight Weakness",
      "desc": "While in sunlight, the bleakheart has disadvantage on attack rolls, ability checks, and saving throws."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The bleakheart's innate spellcasting ability is Charisma (spell save DC 13). It can innately cast the following spells, requiring no material components:\nAt will: detect thoughts, minor illusion\n3/day each: disguise self"
    }
  ],
  "spell_list": [],
  "page_no": 43,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_bleakheart/"
}