{
  "slug": "bonepowderghoul-tob1-2023",
  "desc": "False",
  "name": "Bonepowder Ghoul",
  "size": "Small",
  "type": "Undead",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 180,
  "hit_dice": "24d6 + 96",
  "speed": {
    "walk": 30
  },
  "strength": 10,
  "dexterity": 20,
  "constitution": 18,
  "intelligence": 19,
  "wisdom": 15,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 9,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": 8,
  "perception": 16,
  "skills": {
    "Perception": 6,
    "Stealth": 9
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "cold, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 16",
  "languages": "Common, Darakhul, Draconic, Dwarvish",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 18 (3d8 + 5) piercing damage plus 9 (2d8) necrotic damage, and the target's Strength score is reduced by 1d4. The target dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. If the target is a Humanoid, it must succeed on a DC 17 Constitution saving throw or contract the darakhul fever disease (see the Darakhul Fever sidebar)."
    },
    {
      "name": "Gravedust",
      "desc": "The ghoul projects a 30-foot cone of grave dust. Each creature in the area must succeed on a DC 17 Dexterity saving throw or take 13 (3d8) necrotic damage. If a creature is a Humanoid, it must also succeed on a DC 17 Constitution saving throw or contract the darakhul fever disease (see the Darakhul Fever sidebar)."
    },
    {
      "name": "Whirlwind (Dust Form Only; Recharge 5-6)",
      "desc": "The ghoul creates a whirlwind of bones and teeth in a 20-foot cube originating from it. Each creature in that area must make a DC 17 Dexterity saving throw. On a failure, a creature takes 55 (10d10) slashing damage, and its Strength score is reduced by 1d6. The creature dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. On a success, a creature takes half the damage and its Strength score isn't reduced."
    },
    {
      "name": "Spellcasting",
      "desc": "(Coalesced Form Only)The bonepowder ghoul casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 16):\nAt will: dispel magic, mage hand, ray of enfeeblement\n3/day each: blindness/deafness, fear\n1/day: phantasmal killer"
    }
  ],
  "bonus_actions": [],
  "reactions": [
    {
      "name": "Coalesce",
      "desc": "When a bonepowder ghoul deals necrotic damage with Gravedust to at least one creature that isn't a Construct or Undead, it can magically transform from its dusty form into a coalesced form. Its statistics are the same in each form, except it can speak audibly only in its coalesced form. The coalesced form lasts for a number of minutes equal to the total necrotic damage it dealt with Gravedust to creatures that aren't Constructs or Undead or until the ghoul ends it as a bonus action."
    }
  ],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Amorphous (Dust Form Only)",
      "desc": "The bonepowder ghoul can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Hungry Dead Nature",
      "desc": "The ghoul requires no air or sleep."
    },
    {
      "name": "Turning Defiance",
      "desc": "The bonepowder ghoul and any ghouls within 30 feet of it have advantage on saving throws against effects that turn Undead."
    }
  ],
  "spell_list": [],
  "page_no": 201,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_bonepowder-ghoul/"
}