{
  "slug": "bouda-tob1-2023",
  "desc": "False",
  "name": "Bouda",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 93,
  "hit_dice": "11d8 + 44",
  "speed": {
    "walk": 50
  },
  "strength": 19,
  "dexterity": 14,
  "constitution": 18,
  "intelligence": 10,
  "wisdom": 12,
  "charisma": 15,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": 7,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": 5,
  "perception": 14,
  "skills": {
    "Athletics": 7,
    "Deception": 5,
    "Intimidation": 5,
    "Perception": 4,
    "Stealth": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "acid, lightning; bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "fire, poison",
  "condition_immunities": "charmed, exhaustion, poisoned",
  "senses": "darkvision 120 ft., passive Perception 14",
  "languages": "Common, Celestial, Infernal, telepathy 100 ft.",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The bouda makes one Bite attack and one Mephitic Claw attack."
    },
    {
      "name": "Bite (Giant Hyena or Hybrid Form Only)",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage plus 10 (3d6) poison damage."
    },
    {
      "name": "Mephitic Claw (Giant Hyena or Hybrid Form Only)",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage, and the target must succeed on a DC 15 Constitution saving throw or become poisoned until the end of its next turn."
    },
    {
      "name": "Ravenous Gorge",
      "desc": "The bouda consumes the organs of a corpse within 5 feet of it that is less than 7 days old. It gains temporary hp equal to twice the dead creature's CR for 1 hour. The bouda can't use Ravenous Gorge on a corpse if it or another bouda has already use Ravenous Gorge on the corpse."
    }
  ],
  "bonus_actions": [
    {
      "name": "Change Shape",
      "desc": "The bouda transforms into a human, a hyena, or back into its true form, which is a hyena-human hybrid. Its statistics, other than its speed, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies, then crumbles to dust moments later."
    },
    {
      "name": "Defiling Smear (1/Day)",
      "desc": "The bouda secretes a disgusting whitish-yellow substance with the viscosity of tar and smears the substance on an object, unoccupied space, or creature within 5 feet of it. An unwilling creature must succeed on a DC 15 Dexterity saving throw to avoid the smear. Each creature, other than a bouda or hyena, that starts its turn within 30 feet of the smeared target must succeed on a DC 15 Constitution saving throw or be poisoned for 1 minute. If a creature's saving throw is successful or the effect ends for it, the creature is immune to that source of Defiling Smear for the next 24 hours. The stench of a smear remains potent for 7 days or until removed by the greater restoration spell or similar magic."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Sense Consecrated",
      "desc": "The bouda can pinpoint, by scent, the location of celestials, consecrated places or objects, and creatures wielding divine or celestial power, such as clerics, paladins, or aasimars, within 60 feet of it."
    },
    {
      "name": "Sense Magic",
      "desc": "The bouda senses magic within 30 feet of it at will. This trait otherwise works like the detect magic spell but isn't itself magical."
    }
  ],
  "spell_list": [],
  "page_no": 42,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_bouda/"
}