{
  "slug": "cloaker_bf",
  "desc": "",
  "name": "Cloaker",
  "size": "Large",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 105,
  "hit_dice": "",
  "speed": {
    "walk": 10,
    "fly": 40
  },
  "strength": 18,
  "dexterity": 20,
  "constitution": 12,
  "intelligence": 12,
  "wisdom": 12,
  "charisma": 14,
  "strength_save": 4,
  "dexterity_save": 5,
  "constitution_save": 1,
  "intelligence_save": 1,
  "wisdom_save": 1,
  "charisma_save": 2,
  "perception": 11,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Aberrant Resilience",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft.",
  "languages": "Deep Speech,Undercommon",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The cloaker makes one Bite attack and two Tail attacks."
    },
    {
      "name": "Bite",
      "desc": "_Melee Weapon Attack:_ +7 to hit, reach 5 ft., one creature. _Hit:_ 18 (4d6+4) piercing damage, and if the target is Large or smaller, the cloaker attaches to it. If the cloaker has advantage on the attack roll, the cloaker attaches to the target's head, and the target is blinded and unable to breathe while the cloaker is attached. While attached, the cloaker can't make Bite attacks, and at the start of each of the cloaker's turns, the target takes 18 (4d6+4) piercing damage. The attached cloaker moves with the target whenever the target moves, requiring none of the cloaker's movement. It can detach itself by spending 5 feet of its movement on its turn. A creature, including the target, can take its action to detach the cloaker by succeeding on a DC 15 STR check."
    },
    {
      "name": "Tail",
      "desc": "_Melee Weapon Attack:_ +7 to hit, reach 10 ft., one target. _Hit:_ 17 (3d8+4) slashing damage."
    },
    {
      "name": "Moan (Recharge 6)",
      "desc": "The cloaker releases a deep, thrumming moan that rattles the nerves of all who hear it. Each creature within 30 feet of the cloaker that can hear the moan and that isn't an Aberration must make a DC 15 WIS save. On a failure, a creature takes 40 (9d8) psychic damage and is frightened until the end of its next turn. On a success, a creature takes half the damage and isn't frightened."
    }
  ],
  "bonus_actions": [
    {
      "name": "Cloak of Shadows (3/Day)",
      "desc": "While the cloaker isn't in bright light, it pulls shadows around itself, partially obscuring its form. For 1 minute or until the cloaker is hit with an attack, the cloaker's Stealth is 20, and creatures have disadvantage on attack rolls against the cloaker."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Aberrant Resilience",
      "desc": "The cloaker is resistant to the charmed, frightened, paralyzed, and stunned conditions, and it has advantage on saves against spells or effects that would alter its form."
    },
    {
      "name": "Damage Transfer",
      "desc": "While attached to a creature, the cloaker takes only half the damage dealt to it (rounded down), and that creature takes the other half."
    },
    {
      "name": "False Appearance",
      "desc": "While the cloaker remains motionless without its underside exposed, it is indistinguishable from a dark leather cloak."
    },
    {
      "name": "Light Sensitivity",
      "desc": "While in bright light, the cloaker has disadvantage on attack rolls, and its Perception is 6 when perceiving by sight."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_cloaker/"
}