{
  "slug": "conjoined-queen",
  "desc": "The torso of a pale humanoid woman melds into the thorax of a massive insect. It moves about on six pointed legs, stabbing through stone and metal alike._  \n**Born in Chaos.** The first conjoined queen was created when cultists sacrificed a captured queen to their dark insectoid god. In a ritual of chaotic magic, the human queen and an insect queen were joined, forming a chitinous chrysalis from which the conjoined queen eventually emerged.  \n**Rulers of the Many-Legged.** A conjoined queen rules from a subterranean throne room, often in a burrow under the ruins of a fallen monarchy’s castle. There she commands her insectoid host and sits atop a pile of incubating eggs.  \n**Hungry for Power.** The conjoined queen hungers for humanoid flesh but also for power. She seeks to rule and conquer humanoids and insects alike. Her armies consist of giant insects and the humanoids who ride them into battle.",
  "name": "Conjoined Queen",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 168,
  "hit_dice": "16d10+80",
  "speed": {
    "burrow": 20,
    "climb": 30,
    "walk": 40
  },
  "strength": 18,
  "dexterity": 16,
  "constitution": 21,
  "intelligence": 13,
  "wisdom": 14,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": null,
  "perception": 6,
  "skills": {
    "perception": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, frightened, poisoned",
  "senses": "darkvision 60 ft., tremorsense 60 ft., passive Perception 16",
  "languages": "Common",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The conjoined queen makes two slam attacks and one sting attack."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
      "attack_bonus": 8,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Sting",
      "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 9 (1d10 + 4) piercing damage plus 14 (4d6) poison damage.",
      "attack_bonus": 8,
      "damage_dice": "1d10+4"
    },
    {
      "name": "Queen's Wrathful Clattering (1/Day)",
      "desc": "The conjoined queen clacks her long chitinous legs together, inciting rage in her allies. Each ally within 60 feet of the queen who can hear her has advantage on its next attack roll, and its speed is increased by 10 until the end of its next turn."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The conjoined queen has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Pheromones",
      "desc": "A creature that starts its turn within 30 feet of the conjoined queen must succeed on a DC 14 Constitution saving throw or be charmed for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. While charmed, the creature drops anything it is holding and is stunned. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the conjoined queen's Pheromones for the next 24 hours."
    },
    {
      "name": "Tunneler",
      "desc": "The queen can burrow through solid rock at half her burrowing speed and leaves a 5-foot-diameter tunnel in her wake."
    },
    {
      "name": "Spellcasting",
      "desc": "The conjoined queen is a 9th-level spellcaster. Her spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). The queen has the following sorcerer spells prepared:\nCantrips (at will): acid splash, mage hand, prestidigitation, ray of frost\n1st Level (4 slots): burning hands, magic missile, shield, thunderwave\n2nd Level (3 slots): detect thoughts, misty step, web\n3rd Level (3 slots): clairvoyance, counterspell, haste\n4th Level (3 slots): banishment, confusion\n5th Level (1 slot): insect plague"
    }
  ],
  "spell_list": [],
  "page_no": 70,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_conjoined-queen/"
}