{
  "slug": "cryoceros",
  "desc": "This enormous, squat beast has a shaggy hide of ice. Two translucent horns protrude from its snout, the frontmost of which looks like a scimitar._  \n**Elemental-Touched Rhino.** A cryoceros resembles a woolly rhinoceros made of ice. Its thick, frozen hide protects the soft flesh at its core, and a layer of ice forms over its already formidable, keratinous horns. The creature’s body is efficient at transferring warmth to its fleshy interior; fire still harms a cryoceros, but its icy form is not unduly damaged by fiery attacks. A cryoceros has a second stomach that stores ice it consumes. As a defense mechanism, the cryoceros can spew stinging, pulverized ice from this alternate stomach.  \n**Slow Metabolisms.** Cryoceroses survive on stunted grasses and other plants that thrive in the tundra, as well as ice and snow, to replenish their icy exteriors. Despite their size, they don’t require a great deal of sustenance, and they conserve their energy by slowly grazing across frozen plains. Their ponderous movement fools the unwary into believing that distance equals safety. Indeed, cryoceroses endure much provocation before they decide to act, but they run at and spear or crush those who irritate them. Once their ire is up, they rarely give up pursuing the source of their anger; only by leaving their vast territories can one hope to escape them.  \n**Cantankerous Mounts.** Gentleness and a regular source of food temporarily earns the cryoceroses’ trust, and patient humanoids can manage to train the creatures to accept riders. This works for convenience much more than for combat, since cryoceroses balk at fighting with loads on their backs. A cryoceros in combat with a rider either stands stock still until its rider dismounts or, worse, rolls over to throw its rider, often crushing the rider in the process. Because of this, most tribes who train cryoceroses use the creatures as beasts of burden rather than war mounts.",
  "name": "Cryoceros",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 133,
  "hit_dice": "14d10+56",
  "speed": {
    "walk": 40
  },
  "strength": 19,
  "dexterity": 11,
  "constitution": 18,
  "intelligence": 3,
  "wisdom": 13,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, cold",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "passive Perception 11",
  "languages": "—",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Gore",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one creature. Hit: 13 (2d8 + 4) piercing damage plus 9 (2d8) cold damage.",
      "attack_bonus": 7,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Stomp",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one prone creature. Hit: 20 (3d10 + 4) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "3d10+4"
    },
    {
      "name": "Shards of Ice (Recharge 4-6)",
      "desc": "The cryoceros exhales razor-sharp ice in a 15-foot cone. Each creature in that area must make a DC 15 Dexterity saving throw, taking 10 (3d6) cold damage and 10 (3d6) piercing damage on a failed save, or half as much on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Snow Camouflage",
      "desc": "The cryoceros has advantage on Dexterity (Stealth) checks made to hide in snowy terrain."
    },
    {
      "name": "Trampling Charge",
      "desc": "If the cryoceros moves at least 20 feet straight toward a target and then hits it with its gore attack on the same turn, the target must succeed on a DC 15 Strength saving throw or be knocked prone. If the target is prone, the cryoceros can make one stomp attack against it as a bonus action."
    }
  ],
  "spell_list": [],
  "page_no": 76,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_cryoceros/"
}