{
  "slug": "death-shroud-golem",
  "desc": "A filthy burial shroud glides silently through the air, the vague features of a humanoid outlined on its cotton surface. The stench of an open grave hangs around it._  \n**Suffocating Automatons.** A death shroud golem is created from the used burial shroud of a humanoid. Most death shroud golems are stained with dirt, blood, or mold, and a few are covered in even more unsavory substances. Despite their appearance, death shroud golems are sturdy constructs and can take quite a beating. A death shroud golem typically strikes from a hidden location, grappling and suffocating its victim.  \n**Funerary Constructs.** Death shroud golems are normally found guarding tombs or other locations where their appearance wouldn’t arouse suspicion. Occasionally, necromancers and intelligent undead wear death shroud golems like a cloak or robe, releasing the creature to attack their enemies.  \n**Construct Nature.** A death shroud golem doesn’t require air, food, drink, or sleep.",
  "name": "Death Shroud Golem",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 12,
  "armor_desc": null,
  "hit_points": 95,
  "hit_dice": "10d10+40",
  "speed": {
    "fly": 40,
    "walk": 10,
    "hover": true
  },
  "strength": 17,
  "dexterity": 15,
  "constitution": 18,
  "intelligence": 3,
  "wisdom": 10,
  "charisma": 1,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, necrotic; bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned, prone",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "understands the languages of its creator but can’t speak",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Smothering Slam",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one Medium or smaller creature. Hit: 10 (2d6 + 3) bludgeoning damage and the creature is grappled (escape DC 15). Until this grapple ends, the target is restrained, blinded, and unable to breathe, and the golem can automatically hit the target with its smothering slam but can't use its smothering slam on another target.",
      "attack_bonus": 6,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Direct Victim",
      "desc": "The death shroud golem forces a creature it is grappling to move up to the creature's speed and make one attack with a melee weapon the creature is holding. If the creature isn't holding a melee weapon, it makes one unarmed strike instead. The death shroud golem decides the direction of the movement and the target of the attack. The grappled creature can use its reaction and isn't considered blinded or restrained when moving and attacking in this way."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fabric Form",
      "desc": "The golem can move through any opening large enough for a Tiny creature without squeezing."
    },
    {
      "name": "False Appearance",
      "desc": "While the golem remains motionless, it is indistinguishable from a shroud, cloak, or similar piece of fabric."
    },
    {
      "name": "Immutable Form",
      "desc": "The golem is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The golem has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The golem's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": 179,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_death-shroud-golem/"
}