{
  "slug": "falsifier-fog",
  "desc": "Falsifier fogs are foul urban mists that seek to distort the memory and manipulate the reality of victims using illusion and enchantment._  \n**Delusory Misery.** Falsifier fogs feed on the continued anxiety and depression they foment in populated towns and cities, using their unique abilities to infect large groups at a time. They do not look to kill victims, instead hoping to feed on distress for as long as possible.  \n**Relishing Manipulators.** Falsifier fogs are the souls of abusers and cult leaders who died collaborating with or benefitting from the manipulations of dark forces. Sometimes falsifier fogs form mutually beneficial relationships, willingly cooperating with evil spellcasters to spread misery. Open Game License",
  "name": "Falsifier Fog",
  "size": "Huge",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 52,
  "hit_dice": "8d12",
  "speed": {
    "hover": true,
    "walk": 0,
    "fly": 60
  },
  "strength": 1,
  "dexterity": 17,
  "constitution": 10,
  "intelligence": 14,
  "wisdom": 16,
  "charisma": 15,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, grappled, paralyzed, poisoned, prone, restrained, unconscious",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 13",
  "languages": "understands Common but can’t speak",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The falsifier fog makes two chill attacks."
    },
    {
      "name": "Chill",
      "desc": "Melee Spell Attack: +5 to hit, reach 5 ft., one target in the fog's space. Hit: 10 (3d6) cold damage.",
      "attack_bonus": 5,
      "damage_dice": "3d6"
    },
    {
      "name": "Reaching Phantasms (Recharge 5-6)",
      "desc": "The phantasmal images within the falsifier fog reach outward. Each creature within 10 feet of the fog must make a DC 13 Wisdom saving throw, taking 18 (4d8) psychic damage on a failed save, or half as much damage on a successful one. Creatures in the fog's space have disadvantage on the saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Enveloping Fog",
      "desc": "The falsifier fog can occupy another creature's space and vice versa, and the falsifier fog can move through any opening as narrow as 1 inch wide without squeezing. The fog's space is lightly obscured, and a creature in the fog's space has threequarters cover against attacks and other effects outside the fog."
    },
    {
      "name": "False Appearance",
      "desc": "While the falsifier fog hovers motionlessly, it is indistinguishable from ordinary fog."
    },
    {
      "name": "Horrific Illusions",
      "desc": "A creature that starts its turn in the falsifier fog's space must succeed on a DC 13 Wisdom saving throw or be frightened until the start of its next turn, as it sees visions of its worst fears within the fog. While frightened, a creature's speed is reduced to 0. If a creature fails the saving throw by 5 or more, it is afflicted with short-term madness."
    },
    {
      "name": "Limited Telepathy",
      "desc": "The falsifier fog can communicate telepathically with any creature in its space."
    }
  ],
  "spell_list": [],
  "page_no": 140,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_falsifier-fog/"
}