{
  "slug": "feyward-tree",
  "desc": "_Dark, bark-like rust encrusts the trunk of this cold-forged metal tree, and its dull metallic leaves rustle with the sound of sharp metal._  \n**Cold Iron Trees.** These ferrous constructs are cold-forged in a process taking several years, as bits of rust and other oxidation are cultivated one layer at a time into bark and branches. In this way, the artificers create massive, twisted trunks resembling real, gnarled trees. Green-tinged leaves of beaten cold iron are welded in place by the master craftsmen, and trained warmages bring the construct to life through intense magical rituals rumored to take a full turn of seasons.  \n**Fey Destroyers.** The tree unswervingly obeys the commands of its creators, guarding key points of entry across fey rivers and streams, abandoned sacred groves deep in the forest, suspected faerie rings, or possible elf encampments. Many are released deep in the deep elvish woods with orders to attack any fey on sight. These feyward trees are rarely, if ever, heard from again and whether they leave a bloody trail of flayed elves in their wake after rampages lasting for decades or some fey counter-measure neutralizes them is unknown.  \n**Growing Numbers.** Each year, the feywardens order their construction and release, trusting in the destructive nature of the constructs. A half-dozen might guard a single ring of toppled elven standing stones. The feywardens leave nothing to chance.  \n**Constructed Nature.** A feyward tree doesn’t require air, food, drink, or sleep.",
  "name": "Feyward Tree",
  "size": "Huge",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 94,
  "hit_dice": "9d12+36",
  "speed": {
    "walk": 20
  },
  "strength": 26,
  "dexterity": 10,
  "constitution": 18,
  "intelligence": 2,
  "wisdom": 11,
  "charisma": 6,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 7,
  "intelligence_save": null,
  "wisdom_save": 3,
  "charisma_save": 1,
  "perception": 3,
  "skills": {
    "perception": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "-",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The tree makes two razor-leafed branch attacks, and may use a bonus action to make a razor-leafed branch attack against any creature standing next to it."
    },
    {
      "name": "Razor-Leafed Branch",
      "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 21 (3d8 + 8) slashing damage.",
      "attack_bonus": 11,
      "damage_dice": "3d8"
    },
    {
      "name": "Flaying Leaves (Recharge 5-6)",
      "desc": "The tree can launch a barrage of razor-sharp cold iron leaves from its branches in a 20-foot-radius burst. All creatures caught within this area must make a successful DC 16 Dexterity saving throw or take 21 (6d6) slashing damage, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "A feyward tree has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Contractibility and Conductivity",
      "desc": "certain spells and effects function differently against feyward trees:\n\na magical attack that deals cold damage slows a feyward tree (as the slow spell) for 3 rounds.\n\na magical attack that deals lightning damage breaks any slow effect on the feyward tree and heals 1 hit point for each 3 damage the attack would otherwise deal. If the amount of healing would cause the tree to exceed its full normal hp, it gains any excess as temporary hp. The tree gets no saving throw against lightning effects."
    },
    {
      "name": "Immutable Form",
      "desc": "The feyward tree is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Weapons",
      "desc": "The feyward tree's weapon attacks are magical."
    },
    {
      "name": "Warden's Reach",
      "desc": "Creatures within 15 feet of a feyward tree provoke opportunity attacks even if they take the Disengage action before leaving its reach."
    }
  ],
  "spell_list": [],
  "page_no": 200,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_feyward-tree/"
}