{
  "slug": "ghost_bf",
  "desc": "",
  "name": "Ghost",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 12,
  "armor_desc": null,
  "hit_points": 68,
  "hit_dice": "",
  "speed": {
    "walk": 0,
    "fly": 40,
    "hover": true
  },
  "strength": 6,
  "dexterity": 14,
  "constitution": 10,
  "intelligence": 10,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": -2,
  "dexterity_save": 2,
  "constitution_save": 0,
  "intelligence_save": 0,
  "wisdom_save": 3,
  "charisma_save": 4,
  "perception": 13,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid,fire,lightning,thunder; bludgeoning,piercing,and slashing from nonmagical attacks",
  "damage_immunities": "cold,necrotic,charmed,frightened,grappled,paralyzed,petrified,prone,restrained,Undead Resilience",
  "condition_immunities": "",
  "senses": "darkvision 60 ft.",
  "languages": "any languages it knew in life",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The ghost makes two Withering Touch or Telekinetic Throw attacks."
    },
    {
      "name": "Withering Touch",
      "desc": "Melee Spell Attack: +6 to hit, reach 5 ft., one target. _Hit:_ 18 (4d6+4) necrotic damage."
    },
    {
      "name": "Telekinetic Throw",
      "desc": "_Ranged Weapon Attack:_ +4 to hit, range 20/60 ft., one target. _Hit:_ 17 (6d4+2) bludgeoning, piercing, or slashing damage, depending on the type of object thrown. The ghost can throw only Small or smaller objects within range that aren't being worn or carried."
    },
    {
      "name": "Horrify (Recharge 5-6)",
      "desc": "The ghost speaks a haunting phrase, reveals the wounds from its death, or performs some other expression to scare creatures in a 30-foot cone. Each creature in that area must make a DC 14 WIS save. On a failure, a creature takes 21 (6d6) psychic damage and is frightened until the end of its next turn. On a success, a creature takes half the damage and isn't frightened. A creature that fails the save by 5 or more increases its age in years by 10 percent, rounded up. This aging can be reversed with a greater restoration spell or similar magic, but only within 24 hours of the aging occurring."
    }
  ],
  "bonus_actions": [
    {
      "name": "Etherealness",
      "desc": "The ghost enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Ethereal Plane, and vice versa, yet it can't affect or be affected by anything on the other plane."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Ethereal Sight",
      "desc": "The ghost can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa."
    },
    {
      "name": "Incorporeal Movement",
      "desc": "The ghost can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    },
    {
      "name": "Undead Nature",
      "desc": "The ghost doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Undead Resilience",
      "desc": "The ghost is immune to poison damage, to exhaustion, and to the poisoned condition."
    },
    {
      "name": "Unfinished Business",
      "desc": "Unless its unfinished business is fulfilled, a destroyed ghost returns in 1d4 days, regaining all its HP and becoming active again within 10 feet of where it died. If presented with an object or piece of information related to its unfinished business, the ghost must succeed on a DC 13 WIS save or be incapacitated until the end of its next turn. After it has been incapacitated by a particular source, the ghost can't be incapacitated by that same source again for 24 hours. If presented with everything it needs to complete its unfinished business, the ghost permanently dies after completing it."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_ghost/"
}