{
  "slug": "grimmlet",
  "desc": "A jagged shard of smoky translucent crystal, approximately the size and mass of a housecat, hovers silently across the field._  \n**Strange Families.** Grimmlets reproduce by creating near clones of themselves when injured by arcane energy, leading them to quickly gather in large familial swarms. Strangely, a grimmlet can only swarm with other grimmlets created from the same progenitor grimmlet, which leads the swarm. Not long after the swarm forms, it disperses, each grimmlet moving on to create new swarms through magic injury.  \n**Whispering Menace.** Grimmlets do not speak. In fact, they never communicate with other creatures via any known form of language or telepathy, though they do seem to understand creatures of the Void. Despite this, the air around a grimmlet mutters and whispers at all times in a foul-sounding invocation. When the creature uses its innate magic, these whispers rise in volume slightly, giving canny listeners a split-second warning that something, likely unpleasant, is about to occur.",
  "name": "Grimmlet",
  "size": "Tiny",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 11,
  "armor_desc": null,
  "hit_points": 28,
  "hit_dice": "8d4+8",
  "speed": {
    "walk": 0,
    "hover": true,
    "fly": 30
  },
  "strength": 8,
  "dexterity": 12,
  "constitution": 13,
  "intelligence": 3,
  "wisdom": 10,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "psychic",
  "condition_immunities": "blinded, charmed, deafened, petrified, poisoned, prone, stunned",
  "senses": "blindsight 60 ft., passive Perception 10",
  "languages": "understands Void Speech but can’t speak",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Crystal Edge",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 3 (1d4 + 1) slashing damage plus 2 (1d4) psychic damage.",
      "attack_bonus": 3,
      "damage_dice": "1d4+1"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Reproduce",
      "desc": "When a grimmlet takes damage from a spell and isn't reduced to 0 hp, a number of new grimmlets equal to the spell's level appear in unoccupied spaces within 10 feet of the grimmlet. If the spell is a cantrip, only one grimmlet is created. Sixteen or more grimmlets within 30 feet of each other can use their reactions to come together and form a grimmlet swarm in a space within 5 feet of one grimmlet."
    },
    {
      "name": "Self-destruct",
      "desc": "When the grimmlet dies, it explodes in a spray of Void-infused crystal shards. Each creature within 5 feet of the grimmlet must succeed on a DC 12 Dexterity saving throw or take 3 (1d6) slashing damage and 3 (1d6) psychic damage. Grimmlets damaged by this trait don't Reproduce."
    },
    {
      "name": "Innate Spellcasting (Psionics)",
      "desc": "The grimmlet's innate spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It can innately cast the following spells, requiring no components:\nAt will: crushing curse, minor illusion\n3/day each: maddening whispers"
    }
  ],
  "spell_list": [],
  "page_no": 186,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_grimmlet/"
}