{
  "slug": "haleshi",
  "desc": "A tall, gangly humanoid creature with pale-green skin and the head of a mackerel strides out of the water. It wears a loose-fitting tunic and carries a clamshell in its long, spindly hands._  \n**Diplomatic Fey.** Haleshi are fey that act as intermediaries between fey who live on the land and those who live in oceans and rivers, settling disputes that arise between the two groups. Haleshi are impartial in their rulings and prefer to make decisions based on evidence rather than rumor and speculation. The job of an haleshi is a difficult one due to the chaotic and unpredictable nature of many fey, but they usually receive the backing of the fey lords, particularly the River King, whose court they frequent, and the Bear King, who admires their stoic adherence to duty in the face of adversity.  \n**Clam Riders.** Haleshi have a mystical connection with ordinary clams and similar mollusks and are able to use mollusks to magically transport themselves from one body of water to another.  \n**Food-Lovers.** While haleshi have little to do with humanoids in their role as fey diplomats and judges, they have a predilection for human and elven cuisine, particularly desserts such as apple pies and strawberry tartlets. Some fey try to bribe haleshi with human or elven sweets, only to find that the fey are all but incorruptible.",
  "name": "Haleshi",
  "size": "Large",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 17,
  "armor_desc": null,
  "hit_points": 123,
  "hit_dice": "13d10+52",
  "speed": {
    "swim": 40,
    "walk": 30
  },
  "strength": 16,
  "dexterity": 16,
  "constitution": 18,
  "intelligence": 14,
  "wisdom": 17,
  "charisma": 19,
  "strength_save": null,
  "dexterity_save": 6,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 7,
  "perception": 6,
  "skills": {
    "insight": 9,
    "nature": 5,
    "perception": 6,
    "persuasion": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "",
  "condition_immunities": "charmed",
  "senses": "darkvision 60 ft., passive Perception 16",
  "languages": "Aquan, Common, Elvish, Sylvan",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The haleshi makes two attacks with its stupefying touch."
    },
    {
      "name": "Stupefying Touch",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 16 (3d8 + 3) psychic damage, and the target must succeed on a DC 15 Intelligence saving throw or be incapacitated until the end of its next turn.",
      "attack_bonus": 6,
      "damage_dice": "3d8+3"
    },
    {
      "name": "Clamport (3/Day)",
      "desc": "The haleshi touches a clam within 5 feet of it, which enlarges and swallows the haleshi and up to three willing Medium or smaller creatures within 15 feet of the haleshi. The clam then teleports to a body of water the haleshi has visited that is large enough to hold the clam's passengers and releases them. After releasing the passengers, the clam returns to normal."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Water Shield (Recharge 5-6)",
      "desc": "The haleshi adds 3 to its AC against one attack that would hit it. To do so, the haleshi must be within 5 feet of a gallon or more of water. Alternatively, if the haleshi would take fire damage from an attack or spell, it can negate that damage if it is within 5 feet of a gallon or more of water."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The haleshi can breathe air and water."
    },
    {
      "name": "Charming Defense",
      "desc": "While the haleshi is wearing no armor and wielding no shield, its AC includes its Charisma modifier (included in the Armor Class)."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The haleshi's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spells, requiring no material components:\n3/day each: charm person, invisibility (self only)\n1/day each: major image, water walk, zone of truth"
    }
  ],
  "spell_list": [],
  "page_no": 191,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_haleshi/"
}