{
  "slug": "helashruu",
  "desc": "An enormous looking glass floats forward, its enormous, warped frame composed of writhing purple tendrils, and its surface covered in dozens of hideous, swirling eyes. Several razor-sharp whips whirl through the air around it._  \n**Mirrors from Beyond.** The helashruu are bizarre and terrifying aberrations that travel the planes, spreading chaos and destruction. Resembling towering mirrors covered in tentacles and eyes, helashruu defy rational explanation. When they deem it necessary to communicate with other creatures, it is usually through a jumbled mishmash of thoughts with their telepathy, though making sense of what they say is often next to impossible.  \n**Trapping Gone Astray.** Sages versed in planar lore believe the helashruu were created when a mirror of life trapping swallowed a powerful, deity of chaos and shattered under the strain of the energies it tried to contain. The pieces then scattered across the planes before forming into the first helashruu. The helashruu sometimes trap creatures within themselves, giving credence to this belief. Some sages hypothesize that if all the helashruu were to gather together in one place, they would reform the original mirror, and the evil entity would be released from its confinement. Thankfully, these creatures are extremely rare and hold nothing but contempt for others of their own kind.",
  "name": "Helashruu",
  "size": "Huge",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 184,
  "hit_dice": "16d12+80",
  "speed": {
    "fly": 50,
    "walk": 0,
    "hover": true
  },
  "strength": 20,
  "dexterity": 15,
  "constitution": 20,
  "intelligence": 14,
  "wisdom": 17,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": null,
  "perception": 13,
  "skills": {
    "perception": 13
  },
  "damage_vulnerabilities": "bludgeoning, thunder",
  "damage_resistances": "acid, cold, fire, lightning, piercing, psychic",
  "damage_immunities": "slashing",
  "condition_immunities": "charmed, paralyzed, petrified, prone",
  "senses": "truesight 90 ft., passive Perception 23",
  "languages": "Void Speech, telepathy 120 ft.",
  "challenge_rating": "13",
  "cr": 13,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The helashruu uses Trap Life if it can. It then makes four shard whip attacks."
    },
    {
      "name": "Shard Whip",
      "desc": "Melee Weapon Attack: +10 to hit, reach 15 ft., one target. Hit: 15 (3d6 + 5) slashing damage.",
      "attack_bonus": 10,
      "damage_dice": "3d6+5"
    },
    {
      "name": "Reflect Energy (Recharge 5-6)",
      "desc": "The helashruu releases stored energy in a 60-foot cone. Each creature in that area must make a DC 18 Dexterity saving throw, taking 35 (10d6) damage of the most recent type dealt to the helashruu on a failed save, or half as much damage on a successful one. If the helashruu hasn't taken damage within the past 1 minute, the damage type is force."
    },
    {
      "name": "Trap Life (Recharge 6)",
      "desc": "One creature of the helashruu's choice that is within 30 feet of the helashruu and that can see it must succeed on a DC 18 Wisdom saving throw or be trapped inside the helashruu's mirror. While trapped, the target is blinded and restrained, it has total cover against attacks and other effects outside the helashruu, and it takes 21 (6d6) force damage at the start of each of the helashruu's turns. The helashruu can have only one creature trapped at a time. A fragmented caricature of the trapped creature appears on the helashruu's surface while a creature is trapped inside it.\n\nIf the helashruu takes 30 or more bludgeoning or thunder damage on a single turn, the helashruu must succeed on a DC 15 Constitution saving throw or release the creature, which falls prone in a space within 10 feet of the helashruu. If the helashruu dies, a trapped creature is immediately released into a space within 10 feet of the helashruu."
    },
    {
      "name": "Teleport",
      "desc": "The helashruu magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    },
    {
      "name": "Dimensional Hop (3/Day)",
      "desc": "The helashruu can transport itself to a different plane of existence. This works like the plane shift spell, except the helashruu can affect only itself and can't use this action to banish an unwilling creature to another plane."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Innate Spellcasting (1/Day)",
      "desc": "The helashruu can innately cast gate, requiring no material components. Its innate spellcasting ability is Charisma."
    }
  ],
  "spell_list": [],
  "page_no": 197,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_helashruu/"
}