{
  "slug": "incarnate-gloom",
  "desc": "This inky black cloud exudes a terrible chill and seems to tear at the soul, inducing a feeling of despondency and loneliness._  \n**Despair Given Form.** Incarnate glooms result when a group of at least a dozen people suffer from hopelessness and die without receiving any relief from the feeling. This collective negative emotion coalesces into a nebulous form that seeks out more despair.  \n**Whispers in the Darkness.** An incarnate gloom takes perverse pleasure in picking off members of a large group one at a time. It surrounds a chosen victim and telepathically imparts a sense of isolation on its quarry.  \n**Will-o’-Wisp Symbiosis.** Incarnate glooms work with Open Game License",
  "name": "Incarnate Gloom",
  "size": "Gargantuan",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 184,
  "hit_dice": "16d20+16",
  "speed": {
    "walk": 0,
    "hover": true,
    "fly": 40
  },
  "strength": 4,
  "dexterity": 19,
  "constitution": 13,
  "intelligence": 12,
  "wisdom": 15,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "intimidation": 10,
    "stealth": 9
  },
  "damage_vulnerabilities": "radiant",
  "damage_resistances": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "truesight 120 ft., passive Perception 12",
  "languages": "Common, telepathy 120 ft.",
  "challenge_rating": "13",
  "cr": 13,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The incarnate gloom makes three attacks with its despairing touch."
    },
    {
      "name": "Despairing Touch",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one creature. Hit: 19 (4d6 + 5) psychic damage.",
      "attack_bonus": 9,
      "damage_dice": "4d6+5"
    },
    {
      "name": "Engulf in Shadow",
      "desc": "The incarnate gloom moves up to its speed. While doing so, it can enter Huge or smaller creatures' spaces. Whenever the gloom enters a creature's space, the creature must make a DC 18 Dexterity saving throw.\n\nOn a successful save, the creature can choose to sidestep to just outside the gloom's space. A creature that chooses not to sidestep suffers the consequences of a failed saving throw.\n\nOn a failed save, the gloom enters the creature's space, the creature takes 18 (4d8) necrotic damage, suffers one level of exhaustion, and is engulfed in shadow. The engulfed creature is blinded and restrained, it has total cover against attacks and other effects outside the gloom, and it takes 18 (4d8) necrotic damage at the start of each of the gloom's turns. When the gloom moves, the engulfed creature doesn't move with it.\n\nAn engulfed creature can try to escape by taking an action to make a DC 18 Wisdom check. On a success, the creature escapes the gloom and enters a space of its choice within 5 feet of the gloom."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Calm Vulnerability",
      "desc": "The incarnate gloom can be targeted by the calm emotions spell. If it fails the saving throw, it takes 11 (2d10) psychic damage at the start of each of its turns, as long as the spellcaster maintains concentration on the spell. If it succeeds on the saving throw, it takes 11 (2d10) psychic damage but isn't further affected by that casting of the spell."
    },
    {
      "name": "Deepening Gloom",
      "desc": "A 30-foot radius of magical darkness extends out from the incarnate gloom at all times, moving with it and spreading around corners. Darkvision can't penetrate this darkness, and no natural light can illuminate it. If any of the darkness overlaps with an area of light created by a spell of 3rd level or lower, the spell creating the light is dispelled. A successful dispel magic (DC 16) cast on the gloom suppresses this aura for 1 minute or until the incarnate gloom reduces a creature to 0 hp."
    },
    {
      "name": "Incorporeal Movement",
      "desc": "The incarnate gloom can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    }
  ],
  "spell_list": [],
  "page_no": 213,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_incarnate-gloom/"
}