{
  "slug": "leshy",
  "desc": "_A leshy is a strange man wearing loose scraps of clothing and covered in bark and root-like growths. The hair and beard that frame his piercing green eyes writhe like living vines._  \n**Expanding the Wild.** Solitary leshy tend plants and animals in groves around great forests, and they are the self-proclaimed protectors of the forest outskirts. Leshy have little patience for interlopers and often kill, abduct, or frighten off trailblazers and guides. With their plant growth ability, they sabotage cultivated land, wipe out trails, and create weed walls and thickets to keep civilization at bay. Using speak with plants, they transplant dangerous plant creatures to discourage new settlements. Some have wrangled rabid animals to the same purpose.  \n**Ax Thieves.** Leshy prefer trickery to combat, particularly enjoying leading interlopers astray through use of their mimicry. If challenged, they use their ability to change size to scare intruders away, but they never hesitate to fight to the death in service to the forest if necessary. Leshy hate metal, especially axes, and they go out of their way to steal metal items and lead those who use them astray.  \n**Accept Bribes.** With careful courting and appropriate gifts, it is possible to gain a leshy’s capricious assistance. This can be risky, because leshy love mischief. Still, at times a leshy’s help is essential to a group traversing ancient woodlands.",
  "name": "Leshy",
  "size": "Medium",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 84,
  "hit_dice": "13d8+26",
  "speed": {
    "walk": 30
  },
  "strength": 16,
  "dexterity": 12,
  "constitution": 14,
  "intelligence": 14,
  "wisdom": 15,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "deception": 5,
    "perception": 4,
    "stealth": 3,
    "survival": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Common, Elvish, Sylvan",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The leshy makes two club attacks."
    },
    {
      "name": "Change Size",
      "desc": "The leshy appears to change its size, becoming as tall as a massive oak (Gargantuan) or as short as a blade of grass (Tiny). The change is entirely illusory, so the leshy's statistics do not change."
    },
    {
      "name": "Club",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Innate Spellcasting",
      "desc": "the leshy's innate spellcasting ability is Charisma (spell save DC 13). It can innately cast the following spells, requiring no material components:\n\nat will: animal friendship, pass without trace, speak with animals\n\n1/day each: entangle, plant growth, shillelagh, speak with plants, hideous laughter"
    },
    {
      "name": "Camouflage",
      "desc": "A leshy has advantage on Stealth checks if it is at least lightly obscured by foliage."
    },
    {
      "name": "Mimicry",
      "desc": "A leshy can mimic the calls and voices of any creature it has heard. To use this ability, the leshy makes a Charisma (Deception) check. Listeners who succeed on an opposed Wisdom (Insight) or Intelligence (Nature)-DM's choice-realize that something is mimicking the sound. The leshy has advantage on the check if it's mimicking a general type of creature (a crow's call, a bear's roar) and not a specific individual's voice."
    }
  ],
  "spell_list": [],
  "page_no": 272,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_leshy/"
}