{
  "slug": "mallqui",
  "desc": "_With skin stretched like vellum over wizened limbs, a desiccated humanoid form clad in splendid regalia emerges from a funerary tower. Suddenly, the air becomes so dry as to make the eyes sting and lips crack. The imposing figure has yellow points of light for eyes._  \n**Cold Plateau Mummies.** The people of the cold, rainless, mountain plateaus take advantage of their dry climes to mummify their honored dead, but without the embalming and curing of the corpse practiced in hotter lands. To preserve the knowledge and the place of their ancestors in the afterlife, their dead remain among them as counsellors and honorees on holy days.  \n**Undead Judges.** The mallqui are not seen as malevolent, though at times they are severe judges against transgressors of their culture’s ideals.  \n**Icons of Growth.** Through their ability to draw the very moisture from the air, they are seen as conduits to the fertility of the earth. “Mallqui” also means “sapling” in the language of the people who create them.  \n**Undead Nature.** A mallqui doesn’t require air, food, drink, or sleep.",
  "name": "Mallqui",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 120,
  "hit_dice": "16d8+48",
  "speed": {
    "walk": 20
  },
  "strength": 16,
  "dexterity": 9,
  "constitution": 16,
  "intelligence": 11,
  "wisdom": 16,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": 3,
  "wisdom_save": null,
  "charisma_save": 5,
  "perception": null,
  "skills": {
    "history": 3,
    "insight": 6,
    "religion": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "the languages it knew in life",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mallqui can use its xeric aura and makes two attacks with its desiccating touch."
    },
    {
      "name": "Desiccating Touch",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 20 (5d6 + 3) necrotic damage.",
      "attack_bonus": 7,
      "damage_dice": "5d6"
    },
    {
      "name": "Xeric Aura",
      "desc": "All creatures within 20 feet of the mallqui must succeed on a DC 15 Constitution saving throw or take 11 (2d10) necrotic damage and gain a level of exhaustion. A creature becomes immune to the mallqui's xeric aura for the next 24 hours after making a successful save against it."
    },
    {
      "name": "Xeric Blast",
      "desc": "Ranged Spell Attack: +7 to hit, range 30/90 ft., one target. Hit: 13 (3d6 + 3) necrotic damage.",
      "attack_bonus": 7,
      "damage_dice": "3d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Regeneration",
      "desc": "The mallqui regains 10 hit points at the start of its turn. If the mallqui takes damage from its Water Sensitivity trait, its regeneration doesn't function at the start of the mallqui's next turn. The mallqui dies only if it starts its turn with 0 hit points and doesn't regenerate."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "the mallqui's innate spellcasting ability is Wisdom (spell save DC 15, +7 to hit with spell attacks). It can cast the following spells, requiring no material components:\n\nat will: druidcraft, produce flame\n\n4/day each: create or destroy water, entangle\n\n2/day: locate animals or plants\n\n1/day each: dispel magic, plant growth, wind wall"
    },
    {
      "name": "Water Sensitivity",
      "desc": "the flesh of a mallqui putrefies and dissolves rapidly when soaked with water in the following ways:\n\n- Splashed with a waterskin or equivalent: 1d10 damage\n\n- Attacked by creature made of water: Normal damage plus an extra 1d10 damage\n\n- Caught in rain: 2d10 damage per round (DC 11 Dexterity saving throw for half)\n\n- Immersed in water: 4d10 damage per round (DC 13 Dexterity saving throw for half)\n\nalternatively, the saving throw and DC of the spell used to conjure or control the water damaging the mallqui can be used in place of the saving throws above"
    }
  ],
  "spell_list": [],
  "page_no": 282,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_mallqui/"
}