{
  "slug": "manabane-scarab-swarm",
  "desc": "_These clicking, turquoise-colored beetles have faintly luminescent golden glyphs on their backs, which grow brighter as they draw near._  \nManabane scarabs are vermin infused with the ancient magic of fallen desert empires.  \n_**Devour Magic.**_ Whether from gnawing on the flesh of the undead or nesting in areas rife with lingering enchantment, these beetles have developed a taste for the power of magic even as its power has marked them. The graven glyphs on their carapaces resemble the priestly cuneiform of long-dead kingdoms, and the more magical energy they consume, the brighter they glow, up to the equivalent of a torch.  \nManabane scarabs pursue magic without hesitation or fear, tirelessly seeking to drain it for sustenance.",
  "name": "Manabane Scarab Swarm",
  "size": "Medium",
  "type": "Beast",
  "subtype": "Swarm",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 75,
  "hit_dice": "10d8+30",
  "speed": {
    "walk": 20,
    "burrow": 5,
    "climb": 20
  },
  "strength": 3,
  "dexterity": 16,
  "constitution": 16,
  "intelligence": 1,
  "wisdom": 13,
  "charisma": 2,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, slashing",
  "damage_immunities": "",
  "condition_immunities": "charmed, frightened, paralyzed, petrified, prone, restrained, stunned",
  "senses": "blindsight 10 ft., darkvision 30 ft., tremorsense 30 ft., passive Perception 13",
  "languages": "-",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Bites",
      "desc": "Melee Weapon Attack: +5 to hit, reach 0 ft., one creature in the swarm's space. Hit: 14 (4d6) piercing damage, or 7 (2d6) piercing damage if the swarm has half of its hit points or fewer. The target must succeed on a DC 15 Dexterity saving throw or one randomly determined magic item in its possession is immediately affected by the Mana Erosion trait. A spellcaster hit by this attack must succeed on a DC 15 Charisma saving throw or one of its lowest-level, unused spell slots is expended.",
      "attack_bonus": 5,
      "damage_dice": "4d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Swarm",
      "desc": "The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny insect. The swarm can't regain hit points or gain temporary hit points."
    },
    {
      "name": "Magic Immunity",
      "desc": "The manabane scarab swarm is immune to spells and other magical effects."
    },
    {
      "name": "Scent Magic",
      "desc": "The manabane scarab swarm can detect the presence of magical creatures, active spells or spell effects, and magical items within 120 feet."
    },
    {
      "name": "Mana Erosion",
      "desc": "The manabane scarab swarm consumes magic. Unattended magic items in the swarm's space at the end of the swarm's turn have their effects suppressed for 1 minute. Additionally, charged items in the swarm's space lose 1d6 charges at the start of each of the swarm's turns; items with limited uses per day lose one daily use instead, and single-use items such as potions or scrolls are destroyed. Magical effects in the swarm's space are dispelled (as if affected by dispel magic cast with +5 spellcasting ability)."
    }
  ],
  "spell_list": [],
  "page_no": 374,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_manabane-scarab-swarm/"
}