{
  "slug": "mystic",
  "desc": "Dressed in clean, dark robes, its claws swirling in arcane gestures, the pale reptilian sends a bolt of energy from the Void at its foes._  \nSatarre mystics are creatures with tight awareness of nearby living creatures’ fates. They rely on magic and the ability to speak words of decay to control lesser creatures. Mystics’ minds are always turned to destruction and death, though they hold their own lives more dear than that of their fellow satarres, be they non-combatant drones, rampaging destroyers, or others.  \n**Easily Distracted.** Satarre mystics are known for their ability to ponder and cogitate on larger concerns, even in the midst of a conversation with strangers or a battle with foes. Sometimes these distractions lead them to a great insight and a clever countermove; other times they are easily surprised, captured, or fooled by a shining bit of magic or an unknown arcane device.  \n**Perpetual Incantations.** Satarre mystics seem to somehow maintain a steady stream of muttered sounds. Sometimes these take a brief physical form, such as a glowing rune of destruction that circles a mystic’s head or drifts from its maker and falls apart in midair.  \n**Planar Lore and Tools.** Satarre mystics are well-versed in angelic, elemental, and fiendish magic and other arcana, although they do not perform all of these themselves. They often find and use magical items looted from their victims, or command elemental or fiendish minions using Void Speech.",
  "name": "Mystic",
  "size": "Medium",
  "type": "Humanoid",
  "subtype": "satarre",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "hide armor",
  "hit_points": 75,
  "hit_dice": "10d8+30",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 14,
  "constitution": 16,
  "intelligence": 17,
  "wisdom": 11,
  "charisma": 12,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 5,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 2,
  "skills": {
    "arcana": 5,
    "intimidation": 3,
    "perception": 2
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "necrotic",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "Common, Void Speech",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The satarre mystic makes two void claw attacks. Alternatively, it can use Void Bolt twice."
    },
    {
      "name": "Void Claw",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage plus 4 (1d8) necrotic damage. The target must succeed on a DC 13 Constitution saving throw or its speed is reduced by 10 feet until the end of its next turn.",
      "attack_bonus": 4,
      "damage_dice": "1d6+2"
    },
    {
      "name": "Void Bolt",
      "desc": "Ranged Spell Attack: +5 to hit, range 50 ft., one target. Hit: 9 (2d8) necrotic damage.",
      "attack_bonus": 5,
      "damage_dice": "2d8"
    },
    {
      "name": "Unveil (1/Day)",
      "desc": "The mystic unveils a darker reality to up to three creatures it can see within 30 feet of it. Each target must succeed on a DC 13 Wisdom saving throw or be frightened until the end of its next turn."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Void Deflection",
      "desc": "When a creature the mystic can see targets it with a ranged spell attack, the mystic can attempt to deflect the spell. The mystic makes a Constitution saving throw. If the result is higher than the attack roll, the mystic is unaffected by the spell."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Keeper of Secrets",
      "desc": "The satarre mystic has advantage on all Intelligence (Arcana) checks related to the planes and planar travel."
    },
    {
      "name": "Levitate",
      "desc": "As a bonus action, a mystic can rise or descend vertically up to 10 feet and can remain suspended there. This trait works like the levitate spell, except there is no duration, and the mystic doesn't need to concentrate to continue levitating each round."
    },
    {
      "name": "Planar Commander",
      "desc": "As a bonus action, the mystic commands an angel, elemental, or fiend ally within 30 feet of it to use a reaction to make one attack against a creature that dealt damage to the mystic in the previous round."
    },
    {
      "name": "Void Fortitude",
      "desc": "If damage reduces the satarre mystic to 0 hp, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the satarre mystic drops to 1 hp instead."
    },
    {
      "name": "Void Weapons",
      "desc": "The satarre's weapon attacks are magical. When the satarre hits with any weapon, the weapon deals an extra 1d8 necrotic damage (included in the attack)."
    }
  ],
  "spell_list": [],
  "page_no": 316,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_mystic/"
}