{
  "slug": "narshark",
  "desc": "Almost blending in with the sky, this creature looks like a large shark with cerulean-hued skin and incredibly long pectoral fins that it uses to sail through the air like a bird. Its mouth is filled with several rows of vicious teeth, and an ivory horn emerges from the top of its head._  \n**Aerial Predators.** A narshark is a creature that resembles a cross between a shark and a narwhal with dark blue skin, long serrated teeth, and a horn growing from its brow. Like many sharks, the narshark is a rapacious predator, hunting birds through the sky as a shark hunts fish. While it lacks the keen nose of most predators, the narshark has excellent eyesight and can pick out details at great distances. While narsharks are dangerous predators, they are seldom top of the aerial food chain and face fierce competition from Open Game License",
  "name": "Narshark",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 25,
  "hit_dice": "3d10+9",
  "speed": {
    "fly": 40,
    "walk": 10,
    "hover": true
  },
  "strength": 16,
  "dexterity": 12,
  "constitution": 15,
  "intelligence": 2,
  "wisdom": 14,
  "charisma": 4,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 6,
  "skills": {
    "perception": 6,
    "stealth": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "prone",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "—",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 7 (1d8 + 3) piercing damage. If the creature isn't an undead or a construct, it must succeed on a DC 13 Constitution saving throw or lose 2 (1d4) hp at the start of each of its turns as one of the shark's teeth chips off into the wound. Any creature can take an action to stanch the wound by removing the tooth. The wound also closes and the tooth pops out if the target receives magical healing.",
      "attack_bonus": 5,
      "damage_dice": "1d8+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magical Horns",
      "desc": "The narshark gains its ability to fly from its magical horn. The horn can be severed from a living narshark, but doing so drives it into a panicked rage as it attempts to slay all those around it. Strangely, narsharks never use their horns in combat, possibly in fear of accidentally breaking them. A narshark's horn is commonly used in the creation of magic items that grant flight, and narsharks are often the target of hunters seeking to turn a profit."
    },
    {
      "name": "Keen Sight",
      "desc": "The narshark has advantage on Wisdom (Perception) checks that rely on sight."
    },
    {
      "name": "Magical Horn",
      "desc": "The narshark's horn can be attacked and severed (AC 18; hp 5; immunity to bludgeoning, poison, and psychic damage) or destroyed (hp 15). If its horn is severed, the narshark loses its flying speed, loses 4 (1d8) hp at the start of each of its turns, and goes into a frenzy. While in a frenzy, the narshark has advantage on bite attack rolls and attack rolls against it have advantage."
    }
  ],
  "spell_list": [],
  "page_no": 266,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_narshark/"
}