{
  "slug": "pale-screamer",
  "desc": "This horrible, milk-white creature has the lower body of an emaciated humanoid and the upper body of a slimy jellyfish. Dark blue eyespots cover its upper body, and long, frilled, translucent tentacles trail from its frame-like tassels._  \n**Wailing in the Depths.** Adventurers traveling deep beneath the earth or in the ocean depths sometimes hear an unholy sound echoing toward them out of the blackness, followed by the sight of a creature that is neither human nor jellyfish. This is generally their first and last encounter with the pale screamer, a creature that haunts caves and waterways searching for victims to consume or transport back to the lairs of their terrible alien masters. The pale screamer pursues its mission with malicious relish and enjoys eating its prey alive, often in front of its victims’ paralyzed companions.  \n**Evil Blooms.** Though pale screamers are artificial creatures and do not breed naturally, their masters sometimes form them into blooms of two or more for mutual cooperation and protection. These pale screamers learn to communicate with one another by changing the coloration of their eyespots, allowing them to transmit information silently and better ambush or mislead their foes.  \n**Formerly Human.** Pale screamers are created by mixing human and jellyfish-like creatures together using twisted, magical surgery. Most are the result of experimentation by Open Game License",
  "name": "Pale Screamer",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 52,
  "hit_dice": "7d8+21",
  "speed": {
    "swim": 30,
    "walk": 30
  },
  "strength": 16,
  "dexterity": 14,
  "constitution": 17,
  "intelligence": 7,
  "wisdom": 13,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "athletics": 5,
    "perception": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, cold, force",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 90 ft., passive Perception 13",
  "languages": "Deep Speech",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The pale screamer makes two tentacle attacks. If both attacks hit the same target, the target must succeed on a DC 13 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    {
      "name": "Tentacle",
      "desc": "Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 8 (2d4 + 3) bludgeoning damage.",
      "attack_bonus": 5,
      "damage_dice": "2d4+3"
    },
    {
      "name": "Scream of the Deep (Recharge 6)",
      "desc": "The pale screamer unleashes an alien screech in a 30-foot cone. Each creature in that area must make a DC 14 Constitution saving throw. On a failure, a creature takes 10 (3d6) thunder damage and is deafened until the end of its next turn. On a success, a creature takes half the damage and isn't deafened."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The pale screamer can breathe air and water."
    }
  ],
  "spell_list": [],
  "page_no": 290,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_pale-screamer/"
}