{
  "slug": "rock-roach",
  "desc": "The insect clings to a large rock and drips saliva on it. A puff of steam rises from the rock, and the creature licks at the liquid remains, leaving a pockmark in the stone._  \n**Rock Eaters.** The rock roach is a giant cousin to the roach, and it feeds on rocks deep beneath the ground. It uses its proboscis to deposit acidic saliva onto the rock, breaking it down and lapping up the liquefied minerals. A rock roach’s metabolism is slow to match its tedious eating process. Even still, a group of rock roaches can make quick work of a rocky wall, opening up routes between caverns. The roaches aren’t concerned for structural integrity and their eating habits, if left unimpeded, often lead to cave-ins.  \n**Naturally Hostile.** Rock roaches are instinctually hostile to anything that wanders near them, including each other. The roaches mate annually, and the parents abandon the eggs shortly after laying them. Young rock roaches band together for the first few months of life, protecting each other as they devour the rock where they hatched, then dispersing once they are large enough to defend themselves.  \n**Valuable Carapace.** The carapace of a rock roach is sought after by some groups of underground humanoids. Naturally resilient and hard, craftsman harvest the carapace and slowly sculpt it into a suit of armor in a month-long process that requires regular boiling of the tough carapace.",
  "name": "Rock Roach",
  "size": "Medium",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 67,
  "hit_dice": "9d8+27",
  "speed": {
    "walk": 30,
    "burrow": 20
  },
  "strength": 15,
  "dexterity": 14,
  "constitution": 17,
  "intelligence": 1,
  "wisdom": 6,
  "charisma": 1,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 60 ft., passive Perception 8",
  "languages": "—",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The rock roach makes two bite attacks. Alternatively, it can use Acid Spit twice."
    },
    {
      "name": "Acid Spit",
      "desc": "Ranged Weapon Attack: +4 to hit, range 20/60 ft., one target. Hit: 5 (1d6 + 2) acid damage, and the target takes 3 (1d6) acid damage at the start of its next turn unless the target immediately uses its reaction to wipe off the spit.",
      "attack_bonus": 4,
      "damage_dice": "1d6+2"
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 9 (2d6 + 2) piercing damage.",
      "attack_bonus": 4,
      "damage_dice": "2d6+2"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Dual Brain",
      "desc": "The rock roach has two brains: one in its head and one in its abdomen. It can continue functioning normally, even if its head is removed or destroyed. While both its brains are intact, the rock roach uses its Constitution modifier instead of its Intelligence modifier when making Intelligence saving throws."
    }
  ],
  "spell_list": [],
  "page_no": 308,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_rock-roach/"
}