{
  "slug": "sapphire-jelly",
  "desc": "Wisps of frosty air rise from the amorphous, quivering blue puddle. Bits of ice cling to the edges, and the surface has an almost crystalline appearance._  \n**Mountainous Regions.** Sapphire jellies are at home in glacial and mountainous regions among rocks and ice. They are just as likely to be found aboveground as below, but they avoid regions that are warm or dry. They tend to avoid large settlements of warm-blooded creatures, as such creatures consider them an active threat and often seek to destroy them. They prefer the company of creatures not bothered by the cold.  \n**Unnaturally Cold.** Sapphire jellies are extremely cold, freezing water and objects they encounter on contact. Creatures that are caught within them or hit with their attacks are immediately chilled to the bone, and those who are killed by them are permanently transformed into undead. Sapphire jellies can often be found in areas with Open Game License",
  "name": "Sapphire Jelly",
  "size": "Medium",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 9,
  "armor_desc": null,
  "hit_points": 144,
  "hit_dice": "17d8+68",
  "speed": {
    "walk": 30
  },
  "strength": 16,
  "dexterity": 8,
  "constitution": 18,
  "intelligence": 3,
  "wisdom": 12,
  "charisma": 12,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": 4,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "cold, poison",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, poisoned, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 11",
  "languages": "—",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sapphire jelly makes two freezing slam attacks."
    },
    {
      "name": "Freezing Slam",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 10 (2d6 + 3) bludgeoning damage plus 10 (3d6) cold damage.",
      "attack_bonus": 6,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Engulf",
      "desc": "The jelly moves up to its speed. While doing so, it can enter a Medium or smaller creature's space. Whenever the jelly enters a creature's space, the creature must make a DC 15 Dexterity saving throw.\n\nOn a successful save, the creature can choose to be pushed 5 feet back or to the side of the jelly. A creature that chooses not to be pushed suffers the consequences of a failed saving throw.\n\nOn a failed save, the jelly enters the creature's space, and the creature takes 10 (3d6) cold damage and is engulfed. The engulfed creature can't breathe, is restrained, and takes 21 (6d6) cold damage at the start of each of the jelly's turns. When the jelly moves, the engulfed creature moves with it. A sapphire jelly can have only one creature engulfed at a time.\n\nAn engulfed creature can try to escape by taking an action to make a DC 15 Strength check. On a success, the creature escapes and enters a space of its choice within 5 feet of the jelly. Alternatively, a creature within 5 feet of the jelly can take an action to pull a creature out of the jelly. Doing so requires a successful DC 15 Strength check, and the creature making the attempt takes 10 (3d6) cold damage."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The sapphire jelly can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Icy Transformation",
      "desc": "A humanoid slain by the sapphire jelly rises 1 week later as a glacial corrupter, unless the humanoid is restored to life or its body is destroyed."
    }
  ],
  "spell_list": [],
  "page_no": 312,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_sapphire-jelly/"
}