{
  "slug": "shadow-of-death",
  "desc": "Draped in black funerary garb, ribbons of which move of their own accord, the creature has the appearance of a skeletal angel._  \n**Angels of Death.** Once beings of light and beauty who championed justice across the planes, the shadows of death formed after some agent of entropy discarded their bodies into the Void. Their celestial forms protected them from ultimate annihilation, but their minds were forever darkened by the plane’s dread influence.  \n**Deathly Avatars.** Shadows of death sometimes answer the call of death cults. Rather than aiding the cultists though, the shadows kill the cultists before spreading the grave’s shadow across the world.  \n**Immortal Nature.** The shadow of death doesn’t require food, drink, or sleep.",
  "name": "Shadow of Death",
  "size": "Large",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 18,
  "armor_desc": null,
  "hit_points": 250,
  "hit_dice": "20d10+140",
  "speed": {
    "walk": 50
  },
  "strength": 7,
  "dexterity": 26,
  "constitution": 24,
  "intelligence": 25,
  "wisdom": 25,
  "charisma": 30,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": 14,
  "wisdom_save": 14,
  "charisma_save": 17,
  "perception": 14,
  "skills": {
    "perception": 14
  },
  "damage_vulnerabilities": "radiant",
  "damage_resistances": "acid, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "cold, necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, poisoned",
  "senses": "truesight 120 ft., passive Perception 24",
  "languages": "all, telepathy 120 ft.",
  "challenge_rating": "21",
  "cr": 21,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The shadow of death can use Vision of Ending. It then makes three shortsword attacks."
    },
    {
      "name": "Shortsword",
      "desc": "Melee Weapon Attack: +15 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) piercing damage plus 10 (3d6) necrotic damage.",
      "attack_bonus": 15,
      "damage_dice": "2d6+8"
    },
    {
      "name": "Vision of Ending",
      "desc": "Each creature that is not undead within 60 feet of the shadow of death that can see it must succeed on a DC 22 Wisdom saving throw or become frightened for 1 minute. While frightened in this way, the creature is also paralyzed as it sees visions of its death. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to this shadow of death's Vision of Ending for the next 24 hours."
    },
    {
      "name": "Teleport",
      "desc": "The shadow of death magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Death Throes",
      "desc": "When the shadow of death dies, it explodes, and each creature within 30 feet of it must make a DC 22 Constitution saving throw, taking 35 (10d6) necrotic damage on a failed save, or half as much on a successful one."
    },
    {
      "name": "Deathly Shroud",
      "desc": "At the start of each of the shadow of death's turns, each creature within 15 feet of it must succeed on a DC 22 Constitution saving throw or take 10 (3d6) necrotic damage.\n\nIn addition, light within 30 feet of the shadow of death is less effective. Bright light in the area becomes dim light, and dim light in the area becomes darkness."
    },
    {
      "name": "Destroyer of Life",
      "desc": "If the shadow of death reduces a creature to 0 hp, the creature can be restored to life only by means of a wish spell."
    },
    {
      "name": "Magic Resistance",
      "desc": "The shadow of death has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Shadow Stealth",
      "desc": "While in dim light or darkness, the shadow of death can take the Hide action as a bonus action."
    },
    {
      "name": "Weapons of Death",
      "desc": "The shadow of death's weapon attacks are magical. When the shadow of death hits with any weapon, the weapon deals an extra 10 (3d6) necrotic damage (included in the attack).\n\nA creature that takes necrotic damage from the shadow death's weapon must succeed on a DC 22 Constitution saving throw or its hp maximum is reduced by an amount equal to the necrotic damage taken. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0."
    }
  ],
  "spell_list": [],
  "page_no": 323,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_shadow-of-death/"
}