{
  "slug": "shadow-boxer",
  "desc": "The shadow caught the man’s eye. It looked and moved like a house cat, but there was no animal present to cast it. He followed the shadow as it moved along the wall then transferred to the ground, not noticing the distortion of light behind him. The last thing he heard as the invisible feline tore out his throat was a contented purr._  \n**Finicky Spirits.** Shadow boxers are the physical manifestation of feline collective memory. They are found in urban areas and other places people congregate. Like other fey, they desire to be placated by mortals, and they allow their presence to be detected to induce people to leave them gifts. A shadow boxer develops relationships with one household at a time and protects it. Households that don’t leave sufficient tribute or that cease offering it gifts entirely swiftly find their members targeted by the slighted fey.  \n**Council of Cats.** When they sleep, shadow boxers share dreams with all mundane cats and other shadow boxers within a mile. Within the dream, the cats and the shadow boxer gambol and roughhouse while they share information. Many capers and activities are planned during these dream sessions, and seeing a large clowder of cats getting along is a sign that a shadow boxer in the area has a game afoot. Shadow boxers despise creatures, such as Open Game License",
  "name": "Shadow Boxer",
  "size": "Small",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 55,
  "hit_dice": "10d6+20",
  "speed": {
    "climb": 30,
    "walk": 40
  },
  "strength": 10,
  "dexterity": 17,
  "constitution": 15,
  "intelligence": 12,
  "wisdom": 17,
  "charisma": 17,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 5,
  "skills": {
    "perception": 5,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "charmed",
  "senses": "passive Perception 15",
  "languages": "Sylvan",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The shadow boxer makes two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "2d4+3"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Invisibility",
      "desc": "The shadow boxer magically turns invisible until it attacks or until its concentration ends (as if concentrating on a spell). Any equipment the shadow boxer wears or carries is invisible with it."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Cat Telepathy",
      "desc": "The shadow boxer can magically communicate with cats within 120 feet of it, using a limited telepathy."
    },
    {
      "name": "Pounce",
      "desc": "If the shadow boxer moves at least 20 feet straight toward a creature and then hits it with a claw attack on the same turn, that target must succeed on a DC 13 Strength saving throw or be knocked prone. If the target is prone, the shadow boxer can make one bite attack against it as a bonus action."
    },
    {
      "name": "Project Silhouette",
      "desc": "As a bonus action, the shadow boxer projects a shadow on a surface within 60 feet of it. The shadow boxer can shape it to resemble the shadow of any Medium or smaller beast, but the shadow can't be larger than a 10-foot cube. Each creature that starts its turn within 60 feet of the shadow and that can see the shadow must succeed on a DC 13 Wisdom saving throw or be incapacitated until the end of its next turn and use its movement on its next turn to follow the shadow. As a bonus action, the shadow boxer can move the shadow up to 30 feet along a solid surface. The shadow moves in a natural manner for the type of creature it represents."
    }
  ],
  "spell_list": [],
  "page_no": 322,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_shadow-boxer/"
}