{
  "slug": "spell-warped-chuul-a5e",
  "desc": "",
  "name": "Spell-warped Chuul",
  "size": "Large",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 16,
  "armor_desc": "",
  "hit_points": 127,
  "hit_dice": "15d10+45",
  "speed": {
    "walk": 30,
    "swim": 40
  },
  "strength": 18,
  "dexterity": 10,
  "constitution": 16,
  "intelligence": 5,
  "wisdom": 16,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "frightened, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "understands Deep Speech but can't speak",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "If the chuul is grappling a creature  it uses its tentacle on that creature. It then makes two pincer attacks."
    },
    {
      "name": "Pincer",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one Large or smaller target. Hit: 11 (2d6 + 4) bludgeoning damage. If the target is a creature  it is grappled (escape DC 15). When carrying a grappled creature  the chuul can move at full speed. A pincer that is being used to grapple a creature can be used only to attack that creature."
    },
    {
      "name": "Tentacle",
      "desc": "A grappled creature makes a DC 14 Constitution saving throw. On a failure  it is paralyzed for 1 minute. The creature repeats the saving throw at the end of each of its turns  ending the paralysis on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The chuul can breathe air and water."
    },
    {
      "name": "Detect Magic",
      "desc": "The chuul senses a magical aura around any visible creature or object within 120 feet that bears magic."
    },
    {
      "name": "Spell-warped",
      "desc": "The spell-warped Chuul possesses one of the following traits."
    },
    {
      "name": "Absorb Magic",
      "desc": "The chuul has advantage on saving throws against spells and other magical effects. Whenever the chuul successfully saves against a spell or magical effect, it magically gains 5 (1d10) temporary hit points. While these temporary hit points last, the chuuls pincer attacks deal an additional 3 (1d6) force damage."
    },
    {
      "name": "King-Sized Claw",
      "desc": "One of the chuuls pincers deals 18 (4d6 + 4) bludgeoning damage on a successful hit. A creature grappled by this pincer makes ability checks to escape the grapple with disadvantage."
    },
    {
      "name": "Rune Drinker",
      "desc": "Whenever the chuul takes damage from a magic weapon, until the start of the chuuls next turn attacks made with that weapon have disadvantage, and the chuul gains a +4 bonus to AC."
    },
    {
      "name": "Sparking Wand",
      "desc": "A wand of lightning bolts adorns the chuuls carapace. A creature that starts its turn within 10 feet must make a successful DC 14 Dexterity saving throw or take 7 (2d6) lightning damage. As an action, a creature within 5 feet of the chuul can grab the wand by making a successful DC 14 Athletics or Sleight of Hand check. A creature that fails this check must make a DC 14 Dexterity saving throw. On a failed save, the creature takes 7 (2d6) lightning damage and is knocked prone. On a successful save, a creature takes half damage and isnt knocked prone."
    }
  ],
  "spell_list": [],
  "page_no": 48,
  "environments": [],
  "img_main": null,
  "document__slug": "menagerie",
  "document__title": "Level Up Advanced 5e Monstrous Menagerie",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://www.levelup5e.com",
  "v2_converted_path": "/v2/creatures/mmenag_spell-warped-chuul/"
}