{
  "slug": "spire-walker",
  "desc": "_This miniscule creature kicks up a ghostly, sparkling fire when it jostles and jigs. Lightning sparks fly between it and its perch._  \n**Storm Dancers.** When storm clouds gather over cities, harbors, and twisted badlands, electrical energy fills the air. During these times, miniscule fey dance on church steeples, desolate peaks, and ships’ masts.  \nAlso called corposanti by scholars, spire walkers are nature spirits that delight in grandiose displays of thunderbolts. They can be found frolicking in a thunderstorm or keeping company with blue dragons or storm giants—though these larger creatures often chase them off for being a nuisance.  \n**Small and Metallic.** These spire walkers stand no more than a foot tall, with dusky blue-gray skin and shocks of silvery, slate, or pale blue hair. Spire walkers prefer clothing in metallic hues with many buttons, and they always carry a handful of tiny copper darts that they hurl at each other during their incomprehensible games. When excited, they emit a sparking glow from the tips of their noses, eyebrows, ears, and pointy shoes.  \nThey play rough-and-tumble games among themselves and enjoy pranking bystanders with frightening but mostly harmless electric shocks. If a spire walker perishes during the fun, the others pause just long enough to say “awww, we’ll miss you” and go through their comrade’s pockets before continuing with the game.  \n**Love Copper and Amber.** Spire walkers like gold but they love copper. They prefer it over all other metals, and they keep the copper pieces in their pockets brilliantly polished. They also value amber gems. Among a group of spire walkers, the leader is not the cleverest or most ruthless, but the one displaying the most ostentatious amber jewel.",
  "name": "Spire Walker",
  "size": "Tiny",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 38,
  "hit_dice": "11d4+22",
  "speed": {
    "walk": 20
  },
  "strength": 3,
  "dexterity": 18,
  "constitution": 14,
  "intelligence": 11,
  "wisdom": 10,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "piercing from nonmagical attacks",
  "damage_immunities": "lightning, thunder",
  "condition_immunities": "",
  "senses": "passive Perception 10",
  "languages": "Common, Sylvan",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Lightning Dart",
      "desc": "Ranged Weapon Attack: +6 to hit, range 20/60 ft., one target. Hit: 1 piercing damage plus 9 (2d8) lightning damage. If the attack misses, the target still takes 4 (1d8) lightning damage. Whether the attack hits or misses its intended target, every other creature within 10 feet of the target takes 9 (2d8) lightning damage, or half damage with a successful DC 14 Dexterity saving throw.",
      "attack_bonus": 6,
      "damage_dice": "2d8"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Energized Body",
      "desc": "A creature that hits the spire walker with a melee attack using a metal weapon takes 5 (1d10) lightning damage."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "the spire walker's innate spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). The spire walker can innately cast the following spells, requiring no material components:\n\nat will: produce spark (as the cantrip produce flame, but it does lightning damage)\n\n3/day each: dancing lights, feather fall, invisibility\n\n1/day each: faerie fire, thunderwave"
    },
    {
      "name": "Steeple Step",
      "desc": "The spire walker can use 10 feet of its movement to step magically from its position to the point of a steeple, mast, or other spire-like feature that is in view within 30 feet. The spire walker has advantage on Dexterity (Acrobatics) checks and Dexterity saving throws while it is standing on a steeple or any similar narrow, steep structure or feature."
    }
  ],
  "spell_list": [],
  "page_no": 367,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_spire-walker/"
}