{
  "slug": "star-spawn-of-cthulhu",
  "desc": "The star-dwelling, octopoid servants and children of Cthulhu are enormous and strange, with clawed hands, powerful but distended brains, and winglike spines on their backs, with which they propel themselves through the frozen emptiness between stars.  \nThese masters of psychic communication and dimensional manipulation can transport themselves and others across enormous distances.  \n_**Mastery of Life and Destruction.**_ They’ve harnessed mysterious energies of life and destruction as well, to grow new life with remarkable speed (and some degree of wastage and cancerous tumors) and to turn living flesh into miasmic vapor through nothing more than focused attention.  \n_**Rituals to Cthulhu.**_ Their goals are simple: oppose the mi-go and aid dread Cthulhu. The star-spawn destroy creatures that will not yield and serve as slaves and sacrifices, rather than allowing them to serve another master. Above all, they insist that all creatures venerate great Cthulhu and sacrifice life and treasure in his name. Their ultimate aim is to bend the heavens themselves and ensure that the stars are rightly positioned in their orbits to herald Cthulhu’s inevitable return.",
  "name": "Star Spawn Of Cthulhu",
  "size": "Large",
  "type": "Fiend",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 187,
  "hit_dice": "15d10+105",
  "speed": {
    "walk": 30,
    "swim": 30,
    "fly": 50
  },
  "strength": 25,
  "dexterity": 15,
  "constitution": 24,
  "intelligence": 30,
  "wisdom": 18,
  "charisma": 23,
  "strength_save": 12,
  "dexterity_save": null,
  "constitution_save": 12,
  "intelligence_save": 15,
  "wisdom_save": 9,
  "charisma_save": null,
  "perception": 14,
  "skills": {
    "arcana": 15,
    "perception": 14
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, slashing",
  "damage_immunities": "cold, fire, lightning, poison, psychic",
  "condition_immunities": "exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 300 ft., passive Perception 24",
  "languages": "Common, Infernal, Void Speech",
  "challenge_rating": "15",
  "cr": 15,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The star spawn can use disintegrating gaze if it's available, and also make one claws attack and one dimensional stomp attack."
    },
    {
      "name": "Crushing Claws",
      "desc": "Melee Weapon Attack. +12 to hit, reach 10 ft., one target. Hit: 20 (2d12 + 7) bludgeoning damage plus 13 (3d8) necrotic damage."
    },
    {
      "name": "Disintegrating Gaze (Recharge 5-6)",
      "desc": "Ranged Spell Attack: +15 to hit, range 60 ft., one target in line of sight. Hit: 32 (5d12) necrotic damage, and the target must make a successful DC 20 Constitution saving throw or dissipate into vapor as if affected by a gaseous form spell. An affected creature repeats the saving throw at the end of each of its turns; on a success, the effect ends on that creature, but on a failure, the creature takes another 32 (5d12) necrotic damage and remains gaseous. A creature reduced to 0 hit points by this necrotic damage is permanently disintegrated and can be restored only by a wish or comparable magic that doesn't require some portion of a corpse to work.",
      "attack_bonus": 15,
      "damage_dice": "5d12"
    },
    {
      "name": "Dimensional Stomp",
      "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 18 (2d20 + 7) bludgeoning damage, and the target must make a successful DC 15 Dexterity saving throw or be teleported to a new location as if affected by the dimension door spell. The destination is chosen by the star spawn, but it cannot be in the same space as another object or creature.",
      "attack_bonus": 12,
      "damage_dice": "2d20"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Interdimensional Movement",
      "desc": "A star spawn of Cthulhu can use misty step as a bonus action once per round."
    },
    {
      "name": "Psychic Tower",
      "desc": "When an attack that causes psychic damage is directed against the spawn, the attack rebounds against the attacker. Resolve the attack as if the attacker were the original target and using the star spawn's ability modifiers and proficiency bonus rather than the original attacker's."
    },
    {
      "name": "Void Traveler",
      "desc": "The star spawn of Cthulhu requires no air, warmth, ambient pressure, food, or water, enabling it to travel safely through interstellar space and similar voids."
    }
  ],
  "spell_list": [],
  "page_no": 368,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_star-spawn-of-cthulhu/"
}