{
  "slug": "tosculihivequeen-tob1-2023",
  "desc": "False",
  "name": "Tosculi Hive Queen",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Evil",
  "armor_class": 17,
  "armor_desc": "",
  "hit_points": 189,
  "hit_dice": "18d10 + 90",
  "speed": {
    "walk": 60,
    "fly": 40
  },
  "strength": 17,
  "dexterity": 24,
  "constitution": 20,
  "intelligence": 16,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 11,
  "constitution_save": 9,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": 8,
  "perception": 17,
  "skills": {
    "Perception": 7
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 17",
  "languages": "Common, Deep Speech, Gnoll, Infernal, Tosculi, telepathy 120 ft.",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The tosculi hive queen makes four Scimitar attacks."
    },
    {
      "name": "Scimitar",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage."
    },
    {
      "name": "Stinger",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one creature. Hit: 22 (6d4 + 7) piercing damage, and the target must succeed on a DC 17 Constitution saving throw or be poisoned for 1 minute. While poisoned in this way, the target is also paralyzed. A poisoned target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. The hive queen's potent poison can be removed only by the greater restoration spell or similar magic."
    },
    {
      "name": "Implant Egg",
      "desc": "The hive queen implants an egg into an incapacitated creature within 5 feet of her that isn't a Construct or Undead. Until the egg hatches or is removed, the creature is poisoned, paralyzed, and doesn't need to eat or drink. The egg hatches after 30 days, and the larval tosculi bursts out of the host, killing the host in the process. A creature can take its action to remove the egg by succeeding on a DC 20 Wisdom (Medicine) check. Alternatively, a spell or effect that cures disease disintegrates the unhatched tosculi."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": "The hive queen can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The hive queen regains spent legendary actions at the start of her turn.",
  "legendary_actions": [
    {
      "name": "Flight",
      "desc": "The hive queen flies up to half her flying speed without provoking opportunity attacks."
    },
    {
      "name": "Stinger (Costs 2 Actions)",
      "desc": "The hive queen makes one Stinger attack."
    },
    {
      "name": "Glitter Dust (Costs 2 Actions)",
      "desc": "The hive queen beats her wings and creates a cloud of glittering, golden particles. Each non-tosculi creature within 20 feet of her must succeed on a DC 17 Dexterity saving throw or be blinded until the end of its next turn."
    }
  ],
  "special_abilities": [
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the hive queen fails a saving throw, she can choose to succeed instead."
    },
    {
      "name": "Hive's Heart",
      "desc": "The hive queen knows the direction and distance to all members of her hive and the range of her telepathy extends to 20 miles when communicating with a member of her hive."
    }
  ],
  "spell_list": [],
  "page_no": 366,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_tosculi-hive-queen/"
}