{
  "slug": "valkruung",
  "desc": "Standing only a few feet tall, this odd simian creature has charcoal-colored skin and glowing eyes. Thin, blue-gray tendrils cover almost every inch of its body, and it smells faintly of burnt honey._  \n**Incorrigible Kleptomaniacs.** Few creatures cause as much annoyance to shopkeepers, merchants, and farmers as the valkruung, a tiny monkey-like creature covered in grasping tendrils that lurks atop roofs and clambers through trees, looking for food and objects to steal. Attracted to anything that glitters, jangles, or just plain smells nice, the valkruung steals anything regardless of its actual worth. Valkruungs snatch purses from unsuspecting passersby and fruit and bread from vendors to take back to their lairs. They steal objects they don’t need and refuse to return them, running off while snickering wildly.  \n**Shrines of Riches.** Anything a valkruung steals and doesn’t eat is placed in a central location in its nest, often around an existing statue, altar, or other large object. Eventually, this object becomes covered in a variety of clutter, some of which may be valuable. A valkruung treats all of its objects equally and attacks anyone who tries to take something from the pile.  \n**Den of Thieves.** Valkruungs are social creatures and live in groups of ten to twenty. The job of child-rearing is shared by all members of the group equally, and young valkruungs spend the first parts of their lives carried around on various adults’ backs, where the adults’ tendrils keep them safe. Valkruungs are more intelligent than they appear and have a rudimentary grasp of language, typically insults that have been hurled their way.",
  "name": "Valkruung",
  "size": "Tiny",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 22,
  "hit_dice": "4d6+8",
  "speed": {
    "climb": 20,
    "walk": 25
  },
  "strength": 8,
  "dexterity": 16,
  "constitution": 14,
  "intelligence": 5,
  "wisdom": 12,
  "charisma": 9,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "acrobatics": 5,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "Common, Goblin",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. While poisoned in this way, the target suffers an itchy rash, and, at the start of each of its turns, it must succeed on a DC 13 Wisdom saving or spend its action furiously scratching the rash. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Disarming Tendrils",
      "desc": "When a creature the valkruung can see targets it with a melee weapon attack, the attacker must succeed on a DC 13 Dexterity saving throw or its weapon is knocked out of its grasp into a random unoccupied space within 5 feet of the attacker. The valkruung can't use this reaction against attackers wielding a heavy or two-handed weapon."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Prehensile Tendrils",
      "desc": "The valkruung has 10 shiny blue-gray tendrils that constantly grab at things in the environment. Each tendril can pick up or hold a Tiny object, such as a coin or piece of jewelry, that isn't being worn or carried. If it uses all 10 of its tendrils, the valkruung can carry a single Small object, such as a backpack. The valkruung can use its tendrils to interact with objects, but it can't use them to wield a weapon. It has advantage on Dexterity (Sleight of Hand) checks when using its tendrils and can use its tendrils to disarm opponents (see the Disarming Tendrils reaction)."
    }
  ],
  "spell_list": [],
  "page_no": 355,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_valkruung/"
}