{
  "slug": "vallowex",
  "desc": "A creature with two legs and a flat tail emerges from the water. Its wide mouth opens, revealing a spiked tongue._  \n**Luring with Thirst.** The vallowex haunts woodland rivers, luring in prey with its thirst-inducing aura. When a creature stops to drink, the vallowex attacks and drags the creature into the water to feast. Reproduce through Hosts. Vallowexes release eggs into potable water. After a creature drinks the eggs, a tadpole hatches in its stomach. The tadpole slowly consumes the host from the inside out, emerging as a vallowex when the host dies.",
  "name": "Vallowex",
  "size": "Large",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 123,
  "hit_dice": "13d10+52",
  "speed": {
    "swim": 30,
    "walk": 30
  },
  "strength": 20,
  "dexterity": 10,
  "constitution": 18,
  "intelligence": 5,
  "wisdom": 12,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 14",
  "languages": "—",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vallowex makes two attacks: one with its spiked tongue and one with its tail."
    },
    {
      "name": "Spiked Tongue",
      "desc": "Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 14 (2d8 + 5) piercing damage, and the target is grappled (escape DC 15). Until this grapple ends, the target is restrained, and the vallowex can't use its spiked tongue against another target.",
      "attack_bonus": 8,
      "damage_dice": "2d8+5"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 16 (2d10 + 5) bludgeoning damage.",
      "attack_bonus": 8,
      "damage_dice": "2d10+5"
    },
    {
      "name": "Swallow",
      "desc": "The vallowex makes one spiked tongue attack against a Medium or smaller target it is grappling. If the attack hits, the target is also swallowed, and the grapple ends. The swallowed target is blinded and restrained, it has total cover against attacks and other effects outside the vallowex, and it takes 10 (3d6) acid damage at the start of each of the vallowex's turns. The vallowex can have only one creature swallowed at a time. If the vallowex takes 15 damage or more on a single turn from the swallowed creature, the vallowex must succeed on a DC 15 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 5 feet of the vallowex. If the vallowex dies, the swallowed creature is no longer restrained by it and can escape from the corpse using 10 feet of movement, exiting prone."
    },
    {
      "name": "Release Eggs (1/Week)",
      "desc": "A vallowex can release a 40-foot-radius cloud of microscopic eggs into a body of water it touches. The eggs live for 1 hour. Any humanoid or beast that drinks the eggs must succeed on a DC 15 Constitution saving throw or be infected with a disease—a vallowex tadpole. A host can carry only one vallowex tadpole to term at a time. While diseased, the host must make a DC 15 Constitution saving throw at the end of each long rest. On a failed save, the host's Strength score is reduced by 1d4. This reduction lasts until the host finishes a long rest after the disease is cured. If the host's Strength score is reduced to 0, the host dies, and a vallowex emerges from the corpse. If the host succeeds on three saving throws or the disease is magically cured, the unborn tadpole disintegrates."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The vallowex can breathe air and water."
    },
    {
      "name": "Aura of Thirst",
      "desc": "At the start of each of the vallowex's turns, each creature within 30 feet of it must succeed on a DC 15 Constitution saving throw or have disadvantage on its next attack roll or ability check as a gnawing thirst distracts it. For each minute a creature stays in the vallowex's aura, it gains one level of exhaustion from dehydration. A level of exhaustion is removed if the creature uses an action to drink 1 pint of water. A vallowex is immune to its own Aura of Thirst as well as the auras of other vallowexes."
    },
    {
      "name": "Underwater Camouflage",
      "desc": "The vallowex has advantage on Dexterity (Stealth) checks made while underwater."
    }
  ],
  "spell_list": [],
  "page_no": 356,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_vallowex/"
}