{
  "slug": "vangsluagh",
  "desc": "A writhing mass of hundreds of rubbery, blue-grey tentacles rises from a human sized pair of legs ending in elephantine feet. Each tentacle ends in an eerily human-looking mouth._  \n**Damned Pipers.** Vangsluagh create a din everywhere they go; the mouths on their tentacles perpetually scream, whistle, bleat, growl, and cry. Even in instances where a vangsluagh may want a quiet entrance or stealthy ambush, their own bodies betray them. Stories have emerged from their magic-blasted homeland of vangsluagh that are capable of silencing the noise surrounding them.  \n**Defilers of Beauty.** Vangsluagh despise pretty things, be they creature, object, or structure. Given the opportunity, a vangsluagh prefers spending its time smashing beautiful things to bits. The absence of beauty doesn’t always calm these creatures, however. They target living creatures as a priority in such occurrences.",
  "name": "Vangsluagh",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 85,
  "hit_dice": "10d8+40",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 17,
  "constitution": 18,
  "intelligence": 10,
  "wisdom": 10,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "thunder",
  "condition_immunities": "deafened",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Void Speech",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vangsluagh makes two tentacle lash attacks."
    },
    {
      "name": "Tentacle Lash",
      "desc": "Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 12 (2d8 + 3) bludgeoning damage.",
      "attack_bonus": 5,
      "damage_dice": "2d8+3"
    },
    {
      "name": "Sonic Bullet",
      "desc": "Ranged Spell Attack: +5 to hit, range 120 ft., one target. Hit: 10 (3d6) thunder damage, and the target must make a DC 13 Constitution saving throw or be deafened until the end of its next turn.",
      "attack_bonus": 5,
      "damage_dice": "3d6"
    },
    {
      "name": "Agonizing Trill (Recharge After a Short or Long Rest)",
      "desc": "The vangsluagh increases the pitch of its cacophony to deadly levels. Each creature within 30 feet of the vangsluagh must make a DC 13 Constitution saving throw. On a failure, a creature takes 10 (3d6) thunder damage and is stunned for 1 minute. On a success, a creature takes half the damage and isn't stunned. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Constant Racket",
      "desc": "The vangsluagh has disadvantage on Dexterity (Stealth) checks."
    },
    {
      "name": "Distracting Cacophony",
      "desc": "The vangsluagh constantly emits a din of bleats, trills, and trumpets. A creature that casts a spell while it is within 30 feet of the vangsluagh must make a DC 13 Intelligence, Wisdom, or Charisma saving throw. (The type of saving throw required is dependent on the spellcasting creature's spellcasting ability score.) On a failed save, the spell isn't cast, and the spell slot isn't expended. In addition, a creature that starts its turn within 30 feet of the vangsluagh and is maintaining concentration on a spell must succeed on a DC 13 Constitution saving throw or it loses concentration on the spell."
    }
  ],
  "spell_list": [],
  "page_no": 359,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_vangsluagh/"
}