{
  "slug": "vesiculosa-tob1-2023",
  "desc": "False",
  "name": "Vesiculosa",
  "size": "Gargantuan",
  "type": "Plant",
  "subtype": "",
  "group": "null",
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 232,
  "hit_dice": "16d20 + 64",
  "speed": {
    "walk": 20
  },
  "strength": 20,
  "dexterity": 15,
  "constitution": 19,
  "intelligence": 2,
  "wisdom": 14,
  "charisma": 2,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 16,
  "skills": {
    "Perception": 6
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "fire, bludgeoning, piercing",
  "damage_immunities": "False",
  "condition_immunities": "charmed, blinded, deafened, frightened, prone",
  "senses": "tremorsense 60 ft., passive Perception 16",
  "languages": "—",
  "challenge_rating": "11",
  "cr": 11,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vesiculosa makes four Root or Spit Sweet Water attacks."
    },
    {
      "name": "Root",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one creature. Hit: 18 (3d8 + 5) bludgeoning damage, and the target is grappled (escape DC 16). Until the grapple ends, the target is restrained. The vesiculosa has four roots, each of which can grapple only one target."
    },
    {
      "name": "Spit Sweet Water",
      "desc": "Ranged Weapon Attack: +6 to hit, range 20/60 ft., one creature. Hit: 18 (3d10 + 2) bludgeoning damage, and the target must succeed on a DC 16 Constitution saving throw or fall unconscious for 1 minute. The target wakes up if it takes damage or if another creature takes an action to shake it awake."
    }
  ],
  "bonus_actions": [
    {
      "name": "Bury",
      "desc": "One creature grappled by the vesiculosa is knocked prone, dragged into the ground, and buried just below the surface, ending the grapple. The buried creature is restrained and unable to breathe or stand up. A creature, including the buried creature, can take its action to free the buried creature by succeeding on a DC 16 Strength check. This bonus action doesn't wake a creature that is unconscious from the vesiculosa's Sweet Water trait or Spit Sweet Water action."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Oasis Appearance",
      "desc": "While the vesiculosa remains motionless and partially submerged on the surface of sand or soil, it is indistinguishable from a small oasis or pond. The vesiculosa's pitcher produces enough water for plants to grow around it, provided the vesiculosa remains in the area for an extended period of time. A creature that eats a fruit from a plant growing in the vesiculosa's water is affected by the Sweet Water trait as if it drank the water."
    },
    {
      "name": "Sweet Fragrance",
      "desc": "When a creature that can smell the vesiculosa's sweet fragrance starts its turn within 30 feet of the vesiculosa, the creature must succeed on a DC 16 Wisdom saving throw or be charmed for 1 minute. While charmed, the creature must move on its turn toward the vesiculosa by the safest available route to get within 5 feet of the plant and drink its water. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the vesiculosa's Sweet Fragrance for the next 24 hours."
    },
    {
      "name": "Sweet Water",
      "desc": "A creature that drinks water from the vesiculosa's pitcher regains 5 (2d4) hp, reduces its exhaustion level by 1, and must succeed on a DC 16 Constitution saving throw or fall unconscious for 10 minutes. An unconscious creature wakes up if it takes damage or if another creature takes an action to shake it awake. Drinking the water provides a creature enough nourishment to sustain it for one day."
    }
  ],
  "spell_list": [],
  "page_no": 385,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_vesiculosa/"
}