{
  "slug": "vine-drake",
  "desc": "Grasping vines form this draconic creature’s wings. Nettlelike teeth fill its maw, and its tail branches like a thriving plant._  \n**Living Vines.** Vines coil around and branch out from the body of the vine drake, and lengthy thorns protrude from its head and down its spine. The poison dripping from its fangs causes a severe rash on its victims. The drake uses the vines around its body to hide in its swampy home and to squeeze the life out of its prey. Despite the vine drake’s plant-like nature, it is still a carnivorous dragon. It prefers deer and other game animals, but it has no problem eating the odd humanoid when it is truly hungry. In the absence of food, it can subsist, though barely, on sunlight if it spends time sunbathing.  \n**Avaricious Bullies.** Vine drakes share the typical greed possessed by most dragons and often shake down humanoids for treasure in return for safe passage through the drakes’ territory. They prefer emeralds and other green precious items that blend with their coloration, and they often secret such items deep within the tangle of vines on their bodies. They usually initiate their demands by grabbing unsuspecting victims in their vines and then threatening to strangle their captured prey unless given green treasures. However, they balk at strong resistance and withdraw into undergrowth if grievously harmed or if they face opponents they can’t overcome.  \n**Flightless Dragons.** Unlike most dragons, vine drakes can’t fly. In their claustrophobic swampy lairs, flight is not necessary. Instead, they use their grasping vines to quickly climb and move from tree to tree to hunt or evade predators.",
  "name": "Vine Drake",
  "size": "Medium",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 105,
  "hit_dice": "14d8+42",
  "speed": {
    "climb": 50,
    "walk": 40
  },
  "strength": 18,
  "dexterity": 15,
  "constitution": 16,
  "intelligence": 11,
  "wisdom": 12,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 6,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "athletics": 7,
    "nature": 3,
    "perception": 4,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning and piercing from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 90 ft., passive Perception 14",
  "languages": "Common, Draconic",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vine drake can make three attacks: one with its bite, one with its claw, and one with its vine lash."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one creature. Hit: 8 (1d8 + 4) piercing damage plus 4 (1d8) poison damage. The target must succeed on a DC 14 Constitution saving throw or be poisoned for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 7,
      "damage_dice": "1d8+4"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) slashing damage.",
      "attack_bonus": 7,
      "damage_dice": "1d6+4"
    },
    {
      "name": "Vine Lash",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage. The target is grappled (escape DC 15) if it is a Medium or smaller creature. Until this grapple ends, the target is restrained, and the vine drake can't vine lash another target.",
      "attack_bonus": 7,
      "damage_dice": "1d8+4"
    },
    {
      "name": "Acid Breath (Recharge 5-6)",
      "desc": "The vine drake exhales acid in a 30-foot line that is 5 feet wide. Each creature in that line must make a DC 14 Dexterity saving throw, taking 22 (5d8) acid damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Speak with Plants",
      "desc": "The drake can communicate with plants as if they shared a language."
    },
    {
      "name": "Thorn Body",
      "desc": "A creature that touches the drake or hits it with a melee attack while within 5 feet of it takes 4 (1d8) piercing damage."
    },
    {
      "name": "Innate Spellcasting (2/Day)",
      "desc": "The vine drake can innately cast entangle, requiring no material components. Its innate spellcasting ability is Charisma."
    }
  ],
  "spell_list": [],
  "page_no": 181,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_vine-drake/"
}