{
  "slug": "wardu",
  "desc": "This creature is round and hovers without the aid of wings. Its skin is a deep red color, with a leathery toughness and texture. It has three forward-facing, segmented eyes and a protruding, bloodstained proboscis._  \n**Unknown Origins.** The origins of the wardu are unknown, though scholars speculate that they came from the Plateau of Leng. It is said they were introduced to the Material Plane as a result of an ill-fated expedition by a group of wizards to the edges of the multiverse. The wizards were attacked by a horde of wardu who followed them through the planar rift they created to return home. Although the rift was sealed immediately, dozens of the wardu were trapped on the Material Plane and have since reproduced for numerous generations.  \n**Blood Drinkers.** Wardu are blood drinkers, and it is the only way they absorb sustenance. They are able to attack and gain sustenance from any creature that has blood, no matter the type. Their hunger drives them to attack most creatures they encounter, though they are smart enough to discern the difference between a potential food source and a more powerful creature not worth provoking.  \n**Magic Hunters.** Wardus have a thirst for the blood of spellcasters and even put themselves at risk to obtain that tastiest of treats. Drinking arcane-infused blood has imbued the wardu with some magical power. It can channel this power through its central eye, but the segmented nature of its eye causes the magic to become unstable and scatter as it passes through the eye’s facets.",
  "name": "Wardu",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 105,
  "hit_dice": "14d8+42",
  "speed": {
    "fly": 40,
    "walk": 0,
    "hover": true
  },
  "strength": 10,
  "dexterity": 18,
  "constitution": 16,
  "intelligence": 10,
  "wisdom": 15,
  "charisma": 12,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": 3,
  "wisdom_save": null,
  "charisma_save": 4,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "exhaustion, prone",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "understands Deep Speech but can’t speak, telepathy 60 ft.",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The wardu uses its Segmented Gaze. It then makes two proboscis attacks."
    },
    {
      "name": "Proboscis",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one creature. Hit: 11 (2d6 + 4) piercing damage, and the wardu regains hp equal to half the damage dealt. If the target is a spellcaster, the target has disadvantage on Constitution saving throws to maintain its concentration until the end of its next turn.",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Segmented Gaze",
      "desc": "The wardu's segmented central eye flares with unstable magical energy. One creature the wardu can see within 30 feet of it must succeed on a DC 15 Constitution saving throw or suffer a random condition until the end of its next turn. Roll a d4 to determine the condition: blinded (1), frightened (2), deafened (3), or incapacitated (4)."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Flyby",
      "desc": "The wardu doesn't provoke opportunity attacks when it flies out of an enemy's reach."
    },
    {
      "name": "Magic Resistance",
      "desc": "The wardu has advantage on saving throws against spells and other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 365,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_wardu/"
}