{
  "slug": "weaving-spider",
  "desc": "This clockwork creature looks like a mechanical spider with long, spindly legs, including one equipped with a particularly sharp blade that’s disproportionately large for the creature’s body.  \n_**Cloth Makers.**_ These tiny but useful devices are a boon to weavers as they help produce clothing—and they also sometimes serve as spies and defenders, for nothing is so invisible as a simple machine making cloth, day in and day out. As their name implies, these devices resemble large spiders but with ten limbs instead of eight. Two of their legs are equipped with loops or crooks useful in guiding thread on a loom, six are for moving and climbing, one is for stitching and extremely fast needlework, and one has a razor-sharp blade used to trim thread or cloth (or for attacking foes).  \n_**Throw Poison.**_ Weaving spiders rarely initiate combat unless directed to by their owners, but they instinctively defend themselves, their masters, and other weavers. A weaving spider throws its poisoned shuttle at the nearest foe, then climbs along the strand to attack that foe. Weaving spiders fight until destroyed or ordered to stand down. When spying, they flee as soon as they are threatened, to preserve whatever information they have gathered.  \n_**Constructed Nature.**_ A clockwork weaving spider doesn’t require air, food, drink, or sleep.",
  "name": "Weaving Spider",
  "size": "Tiny",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 25,
  "hit_dice": "10d4",
  "speed": {
    "walk": 40,
    "climb": 40
  },
  "strength": 10,
  "dexterity": 16,
  "constitution": 10,
  "intelligence": 9,
  "wisdom": 8,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "understands Common",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The weaving spider makes two trimming blade attacks or two needle shuttle attacks."
    },
    {
      "name": "Trimming Blade",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage and possible unmaking.",
      "attack_bonus": 5,
      "damage_dice": "2d6"
    },
    {
      "name": "Poisoned Needle Shuttle",
      "desc": "Ranged Weapon Attack: +5 to hit, range 30 ft., one target. Hit: 7 (1d8 + 3) piercing damage, and the target must succeed on a DC 13 Constitution saving throw or become paralyzed. The target repeats the saving throw at the end of each of its turns, ending the effect on itself with a success.",
      "attack_bonus": 5,
      "damage_dice": "1d8"
    },
    {
      "name": "Unmaking",
      "desc": "The weaving spider's speed and its slim, sharp blade can slice cloth, leather, and paper into scraps very quickly. Whenever a weaving spider's trimming blade attack roll exceeds the target's armor class by 5 or more, the target must succeed on a DC 13 Dexterity saving throw or one of their possessions becomes unusable or damaged until repaired (DM's choice)"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The weaving spider is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The weaving spider has advantage on saving throws against spells and other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 66,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_weaving-spider/"
}