{
  "slug": "adult-imperial-dragon",
  "desc": "The long, serpentine dragon is wingless and possesses shimmering, opalescent scales. Its appearance is at once both serene and majestic._  \n**Dragons of the Spirit World.** Imperial dragons are tied to the world of celestials, fiends, and spirits. They freely parley with such creatures for knowledge about the outer planes or the fundamental mysteries of the universe. Some of the most powerful imperial dragons even become the servants of the gods in exchange for wisdom, acting as intermediaries between the divine and mortal realms.  \n**Colorful and Magical.** Imperial dragons are capable of changing their colors and forms. They are typically a rich, golden-yellow, but azure-, jade-, and vermillion-colored dragons are not unheard of, and even white and black imperial dragons have been reported. A magical organ in their skulls gives them the ability to fly without the aid of wings, and they are often hunted for this organ, which is rumored to grant eternal life if consumed.  \n**Masters of Wind and Rain.** Imperial dragons are creatures of wind and water, and the eldest of their kind exhibit mastery of these elements. They love the seas where they make their homes and sometimes act as guardians for sacred sites or temples near or beneath the waves. This often puts them in conflict with militant aquatic races like the Open Game License",
  "name": "Adult Imperial Dragon",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 297,
  "hit_dice": "22d12+154",
  "speed": {
    "fly": 80,
    "walk": 40,
    "swim": 40
  },
  "strength": 27,
  "dexterity": 12,
  "constitution": 25,
  "intelligence": 18,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": 13,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 10,
  "perception": 15,
  "skills": {
    "arcana": 10,
    "history": 10,
    "insight": 9,
    "perception": 15,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "lightning, thunder",
  "condition_immunities": "",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 25",
  "languages": "all",
  "challenge_rating": "20",
  "cr": 20,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon can use its Mesmerizing Presence. It then makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., Hit: 19 (2d10 + 8) piercing damage.",
      "attack_bonus": 14,
      "damage_dice": "2d10+8"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
      "attack_bonus": 14,
      "damage_dice": "2d6+8"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.",
      "attack_bonus": 14,
      "damage_dice": "2d8+8"
    },
    {
      "name": "Mesmerizing Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 20 Wisdom saving throw or become charmed by the dragon for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Mesmerizing Presence for the next 24 hours."
    },
    {
      "name": "Lightning Breath (Recharge 5-6)",
      "desc": "The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 21 Dexterity saving throw, taking 55 (10d10) lightning damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Change Shape",
      "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice). In a new form, the dragon retains its alignment, hp, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.\n\nThe dragon can choose to transform only part of its body with this action, allowing it to sprout rabbit-like ears or a humanoid head. These changes are purely cosmetic and don't alter statistics."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a tail attack."
    },
    {
      "name": "Cast a Spell (Costs 3 Actions)",
      "desc": "The dragon casts a spell from its list of innate spells, consuming a use of the spell as normal."
    }
  ],
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The dragon can breathe air and water."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Truespeak",
      "desc": "The dragon can communicate with any living creature as if they shared a language."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The imperial dragon's innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no material components.\nAt will: fog cloud\n3/day each: control water, gust of wind, stinking cloud\n1/day each: cloudkill, control weather"
    }
  ],
  "spell_list": [],
  "page_no": 117,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_adult-imperial-dragon/"
}