{
  "slug": "adultvoiddragon-tob1-2023",
  "desc": "False",
  "name": "Adult Void Dragon",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Neutral",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 229,
  "hit_dice": "17d12 + 119",
  "speed": {
    "walk": 80,
    "fly": 40
  },
  "strength": 24,
  "dexterity": 10,
  "constitution": 25,
  "intelligence": 16,
  "wisdom": 13,
  "charisma": 21,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": 12,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": 10,
  "perception": 21,
  "skills": {
    "Arcana": 13,
    "History": 13,
    "Perception": 11,
    "Stealth": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "cold",
  "condition_immunities": "charmed, frightened",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21",
  "languages": "Common, Draconic, Void Speech",
  "challenge_rating": "16",
  "cr": 16,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Aura of Madness. It then makes one Bite attack and two Claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 10 (3d6) cold damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage."
    },
    {
      "name": "Aura of Madness",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or suffer short-term madness for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Aura of Madness for the next 24 hours."
    },
    {
      "name": "Breath Weapons (Recharge 5-6)",
      "desc": "The dragon uses one of the following breath weapons."
    },
    {
      "name": "Gravitic Breath",
      "desc": "The dragon exhales localized gravity in a 60-foot cube, originating from the dragon. When a creature ends a fall in the cube, it takes 1d10 bludgeoning damage for every 10 feet it fell, to a maximum of 20d10. A creature that enters the cube for the first time on a turn or starts its turn there must make a DC 20 Dexterity saving throw. On a failure, the creature is restrained. On a success, the creature's speed is halved as long as it remains in the cube. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. The cube lasts until the dragon's breath weapon recharges."
    },
    {
      "name": "Stellar Breath",
      "desc": "The dragon exhales star fire in a 60-foot cone. Each creature in that area must make a DC 20 Dexterity saving throw, taking 31 (9d6) fire damage and 31 (9d6) radiant damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": [],
  "reactions": [
    {
      "name": "Void Twist",
      "desc": "The dragon adds 5 to its AC against one attack that would hit it, as it twists reality to open a small rift in space to protect itself. To do so, the dragon must be able to see the attacker. If the attack misses by 5 or more, the dragon can choose to open a second, connected rift next to another creature it can see within 30 feet of it to direct the attack at that creature instead, using the original attack roll result against the new target's AC."
    }
  ],
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a Tail attack."
    },
    {
      "name": "Void Slip (Costs 2 Actions)",
      "desc": "The dragon twists the fabric of space around it, disappearing and reappearing in an unoccupied space it can see within 120 feet of it. Each creature within 10 feet of the dragon must succeed on a DC 20 Constitution saving throw or take 14 (4d6) cold damage and be knocked prone."
    }
  ],
  "special_abilities": [
    {
      "name": "Chill of the Void",
      "desc": "Creatures with resistance to cold damage don't have resistance to the cold damage dealt by the Void dragon. A creature with immunity to cold damage is still immune to the dragon's cold damage."
    },
    {
      "name": "Expert Void Traveler",
      "desc": "The Void dragon doesn't require air, food, drink, sleep, or ambient pressure. While traveling in the Void, the dragon magically glides on solar winds, covering immense distances in short times."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    }
  ],
  "spell_list": [],
  "page_no": 129,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_adult-void-dragon/"
}