{
  "slug": "alchemical-skunk",
  "desc": "The large skunk waddles forward, sniffing at a spilled potion. As a sound nearby startles it, the skunk raises its tail, and the stripes on its back change color._  \n**Magical Prank.** The unfortunate result of a magic school prank, alchemical skunks were created when an ordinary skunk was forced to drink a combination of potions. Despite their larger size, alchemical skunks still look and act like ordinary skunks, except for the ever-changing color of the stripes on their backs. Experienced foresters know that the colors on the alchemical skunk’s back indicate which magical malady the creature is about to spray and do their best to avoid aggravating these dangerous creatures.  \n**Laboratory Pests.** Alchemical skunks forage the same as their nonmagical kin, but they are also regularly found scavenging the waste of alchemical laboratories. They enjoy feasting on potions and potion components, much to the dismay of alchemists and adventurers alike.",
  "name": "Alchemical Skunk",
  "size": "Small",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 66,
  "hit_dice": "12d6+24",
  "speed": {
    "burrow": 10,
    "walk": 30
  },
  "strength": 13,
  "dexterity": 17,
  "constitution": 14,
  "intelligence": 2,
  "wisdom": 12,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 10 ft., passive Perception 13",
  "languages": "—",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The alchemical skunk uses its Alchemical Spray. It then makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "2d4+3"
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Alchemical Spray",
      "desc": "The alchemical skunk raises its tail and sprays an alchemical mixture. The skunk is immune to its own spray effects and to the spray effects of other alchemical skunks. Roll a d6 to determine the skunk's spray.\n1. Pleasant Mist. The skunk produces a rosy mist. Each creature within 10 feet of the skunk must succeed on a DC 13 Charisma saving throw or be charmed until the end of its next turn.\n2. Shrinking Cloud. The skunk releases a yellow gas. Each creature in a 15-foot cone must succeed on a DC 13 Constitution saving throw or be reduced as if targeted by the enlarge/reduce spell for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n3. Laughing Gas. The skunk emits a sparkling orange cloud. Each creature in a 15-foot cone must succeed on a DC 13 Wisdom saving throw or become incapacitated as it laughs for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n4. Blinding Spray. The skunk shoots a stream of a green fluid. Each creature in a line that is 30 feet long and 5 feet wide must succeed on a DC 13 Dexterity saving throw or be blinded for 1 minute, or until the creature uses an action to wipe its eyes.\n5. Sleeping Fog. The skunk sprays a sweet-smelling blue fog. Each creature within 10 feet of the skunk must succeed on a DC 13 Constitution saving throw or fall unconscious for 1 minute. The creature wakes up if it takes damage or if another creature takes an action to shake it awake.\n6. Poison Fog. The skunk excretes a foul-smelling purple fog around itself until the start of its next turn. Each creature that starts its turn within 20 feet of the skunk must succeed on a DC 13 Constitution saving throw or be poisoned until the start of its next turn."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Keen Hearing and Smell",
      "desc": "The alchemical skunk has advantage on Wisdom (Perception) checks that rely on hearing or smell."
    },
    {
      "name": "Magic Resistance",
      "desc": "The alchemical skunk has advantage on saving throws against spells and other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 13,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_alchemical-skunk/"
}