{
  "slug": "algorith",
  "desc": "_Sometimes called folding angels, algoriths are lawful beings made from sheer force, pure math, and universal physical laws._  \n**Creatures of Pure Reason.**They are the border guards of the Conceptual Realms, warding subjective beings from the Realms of the Absolute. Eternal, remorseless, and unceasingly vigilant, they guard against the monstrosities that lurk in the multiverse’s most obscure dimensions, and seek out and eliminate chaos even from the abodes of the gods.  \n**Foes of Chaos.**They visit mortal realms when chaos threatens to unravel a location, or when the skeins of fate are tangled. On some occasions, an algorith will serve a god of Law or answer the summons of a skein witch.  \nAlgoriths fight with conjured blades of force, and they can also summon universal energy that deconstructs randomness, weakening enemies or reducing them to finely ordered crystalline dust.  \n**Social but Mysterious.** In groups, they move and fight in silent coordination. Only tiny variations in the formulas etched into their skins identify one algorith from another. Five is a number of extreme importance to all algoriths, but few are willing (or able) to explain why to anyone who isn’t an algorith. Algoriths may have castes, ranks, or commanders, but no mortal has decoded the mathematical blazons adorning their flesh.The algoriths themselves refuse to discuss these formulas with those who do not comprehend them.  \n**Constructed Nature.** An algorith doesn’t require air, food, drink, or sleep.",
  "name": "Algorith",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 136,
  "hit_dice": "16d8+64",
  "speed": {
    "walk": 40,
    "fly": 40
  },
  "strength": 21,
  "dexterity": 14,
  "constitution": 19,
  "intelligence": 13,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 6,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": 8,
  "perception": 7,
  "skills": {
    "athletics": 9,
    "insight": 7,
    "investigation": 5,
    "perception": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, lightning",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 17",
  "languages": "Common, Celestial, Draconic, Infernal",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The algorith makes two logic razor attacks."
    },
    {
      "name": "Logic Razor",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 31 (4d12 + 5) force damage.",
      "attack_bonus": 9,
      "damage_dice": "4d12"
    },
    {
      "name": "Cone of Negation (Recharge 5-6)",
      "desc": "An algorith can project a cone of null energy. Targets inside the 30 foot cone take 42 (12d6) force damage and suffer the effect of a dispel magic spell. A successful DC 16 Dexterity saving throw reduces the damage to half and negates the dispel magic effect on that target."
    },
    {
      "name": "Reality Bomb (5/Day)",
      "desc": "The algorith can summon forth a tiny rune of law and throw it as a weapon. Any creature within 30 feet of the square where the reality bomb lands takes 21 (6d6) force damage and is stunned until the start of the algorith's next turn. A target that makes a successful DC 16 Dexterity saving throw takes half damage and isn't stunned."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The algorith is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The algorith's innate spellcasting ability is Charisma (spell save DC 16). It can innately cast the following spells, requiring no material components:\n\nat will: aid, blur, detect magic, dimension door\n\n5/day each: dispel magic\n\n1/day: commune (5 questions), wall of force"
    }
  ],
  "spell_list": [],
  "page_no": 14,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_algorith/"
}