{
  "slug": "androsphinx_bf",
  "desc": "",
  "name": "Androsphinx",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": "Sphinxes",
  "alignment": "",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 284,
  "hit_dice": "",
  "speed": {
    "walk": 40,
    "fly": 60
  },
  "strength": 22,
  "dexterity": 20,
  "constitution": 32,
  "intelligence": 28,
  "wisdom": 30,
  "charisma": 22,
  "strength_save": 6,
  "dexterity_save": 5,
  "constitution_save": 11,
  "intelligence_save": 9,
  "wisdom_save": 10,
  "charisma_save": 6,
  "perception": 20,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Monstrosity Resilience",
  "damage_immunities": "psychic; bludgeoning,piercing,and slashing damage from nonmagical attacks,charmed,frightened",
  "condition_immunities": "",
  "senses": "truesight 120 ft.",
  "languages": "Common,Sphinx",
  "challenge_rating": "17",
  "cr": 17,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sphinx makes four Claw or Arcane Bolt attacks. It can replace one attack with a use of Spellcasting."
    },
    {
      "name": "Claw",
      "desc": "_Melee Weapon Attack:_ +12 to hit, reach 5 ft., one target. _Hit:_ 17 (2d10+6) slashing damage plus 9 (2d8) force damage."
    },
    {
      "name": "Arcane Bolt",
      "desc": "_Ranged Spell Attack:_ +12 to hit, range 120 ft., one target. _Hit:_ 24 (4d8+6) force damage."
    },
    {
      "name": "Spellcasting",
      "desc": "The sphinx casts one of the following spells, requiring no material components and using WIS as the spellcasting ability (spell save DC 18).<br>At will: _command_, _detect evil and good_, _thaumaturgy_<br>3/day each: _dispel magic_, _restoration_, _tongues_, _zone of truth_<br>2/day each: _freedom of movement_, _greater restoration_<br>1/day: _heal_"
    }
  ],
  "bonus_actions": [
    {
      "name": "Roar",
      "desc": "The sphinx emits one of the following magical roars. Each roar is audible up to 300 feet away. When it roars, the sphinx chooses up to three creatures it can see within 120 feet of it to be affected by the roar. A creature that fails a save and is affected by an ongoing effect can repeat the save at the end of each of its turns, ending the effect on itself on a success.\n- **Rumbling Roar.** This deep roar rumbles through each target's body, rattling it to its bones. Each target must succeed on a DC 18 CON save or deal only half damage with weapon attacks that use STR or DEX for 1 minute.\n- **Terrifying Roar.** This shrill roar tugs at the self-preservation instincts within creatures. Each target must succeed on a DC 18 WIS save or be frightened for 1 minute. While frightened, a creature's speed is 0. If a creature fails the save by 5 or more, it is also paralyzed while frightened.\n- **Thunderous Roar.** This booming roar slams against the chosen creatures. Each target must succeed on a DC 18 STR save or be pushed up to 15 feet away from the sphinx, knocked prone, and deafened for 1 minute."
    }
  ],
  "reactions": [],
  "legendary_desc": "The sphinx can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The sphinx regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Teleport",
      "desc": "The sphinx magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    },
    {
      "name": "Cast a Spell (Costs 2 Actions)",
      "desc": "The sphinx uses Spellcasting."
    },
    {
      "name": "Lacerating Swipe (Costs 2 Actions)",
      "desc": "The sphinx rears up on its hind legs, wings fluttering, and swipes in a wide arc with both its forepaws. Each creature in a 15-foot cone must succeed on a DC 18 DEX save or take 11 (2d10) slashing damage and suffer a bleeding wound. A creature with a bleeding wound loses 5 (1d10) HP at the start of each of its turns. Any creature can take an action to stanch the wound with a successful DC 18 WIS (Medicine) check. The wound also closes if the bleeding creature receives magical healing."
    }
  ],
  "special_abilities": [
    {
      "name": "Inscrutable",
      "desc": "The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. WIS (Insight) checks made to ascertain the sphinx's intentions or sincerity have disadvantage."
    },
    {
      "name": "Magical Claws",
      "desc": "The sphinx's Claw attacks are magical. When the sphinx hits with a Claw attack, the Claw deals an extra 2d8 force damage (included in the attack)."
    },
    {
      "name": "Monstrosity Resilience",
      "desc": "The sphinx is resistant to exhaustion and to the frightened condition."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_androsphinx/"
}