{
  "slug": "baliri-demon",
  "desc": "A muscular humanoid with gray-black skin and the oversized head of a donkey lumbers forward. The monster’s eyes and tongue loll from its head, and its arms end in crimson crab-like pincers that snap together with incredible strength._  \n**Tormented Killers.** A baliri demon is created when a humanoid suffers at the hands of family or peers and turns to one of the demon lords for succor and bloody retribution. The result is both catastrophic and deadly, and the victim of the abuse is often executed for their dark dealings. It is at this moment that the demon lord snatches up the victim’s soul and transforms it into a baliri demon, a savage and remorseless killer that seeks to spread misery in its wake.  \n**Braying Apostles.** A baliri demon is a devout servant of the demon lord that created it, stridently extolling the virtues of its demonic master even as it butchers and defiles anyone who stands in its way. The loud braying prayers and hymns of a baliri demon carry for miles across the blasted Abyssal landscape and fill the hearts of mortals and lesser demons alike with dread. Baliri demons are not picky when it comes to choosing their victims but have a preference for anyone who resembles an aggressor from their previous life.",
  "name": "Baliri Demon",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "demon",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 190,
  "hit_dice": "20d8+100",
  "speed": {
    "walk": 30
  },
  "strength": 22,
  "dexterity": 16,
  "constitution": 20,
  "intelligence": 13,
  "wisdom": 17,
  "charisma": 14,
  "strength_save": 11,
  "dexterity_save": 8,
  "constitution_save": 10,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "perception": 8,
    "persuasion": 7,
    "religion": 6,
    "stealth": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 90 ft., passive Perception 17",
  "languages": "Abyssal, Common, telepathy 120 ft.",
  "challenge_rating": "14",
  "cr": 14,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The baliri demon makes three attacks: one with its bite and two with its pincers."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 10 (3d6) necrotic damage.",
      "attack_bonus": 11,
      "damage_dice": "2d10+6"
    },
    {
      "name": "Pincers",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 15 (2d8 + 6) slashing damage. If the baliri demon scores a critical hit against a creature, roll a d6. On a 1-3, it severs the target's arm, and on a 4-6 it severs the target's leg. A creature missing an arm can't wield weapons that require two hands, and if a creature is missing a leg, its speed is halved. Creatures without limbs are unaffected.",
      "attack_bonus": 11,
      "damage_dice": "2d8+6"
    },
    {
      "name": "Blood Bray (Recharge 6)",
      "desc": "The baliri demon unleashes an otherworldly braying that causes the internal organs of nearby creatures to twist and rupture. Each creature within 20 feet of the baliri that can hear it must make a DC 18 Constitution saving throw. On a failure, the creature takes 36 (8d8) necrotic damage and is stunned until the end of its next turn as it doubles over in agony. On a success, the creature takes half the damage and isn't stunned. The bray doesn't affect creatures without internal organs, such as constructs, elementals, and oozes."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The baliri has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Praising Brays",
      "desc": "As a bonus action, the baliri brays praise to the demon lord that saved it from its previous life, channeling the demon lord's might. The baliri chooses up to three demons within 30 feet of it. Each target has advantage on the first ability check or attack roll it makes before the start of the baliri's next turn. In addition, the targets are unaffected by the baliri's Blood Bray."
    }
  ],
  "spell_list": [],
  "page_no": 140,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_baliri-demon/"
}