{
  "slug": "bone-crab",
  "desc": "_A bone crab’s cracked skull scurries forward on bone-white legs. These tainted crustaceans make discarded craniums their home._  \n**Skull Shells.** Much like an enormous hermit crab, bone crabs inhabit the remains of large fish, humanoids, and other creatures. A bone crab’s spiny, ivory-white legs blend in perfectly with bones and pale driftwood. When lacking bones, these crabs gnaw cavities into chunks of driftwood or coral to make a shelter, cementing bits of shell and debris to their portable homes. All crabs fight over choice skulls.  \n**Scavengers of Memory.** Bone crabs are voracious scavengers. They live in seaside crags and coves, where they use their specialized chelae to crack open skulls and feast on the brains. Centuries of such feeding have given bone crabs a collective intelligence. Some crabs retain fragments of memory from those they devour, and these crabs recognize friends or attack the foes of those whose skulls they wear.  \nBone crabs hunt in packs, preying on seabirds and creatures stranded in tidal pools. They drag aquatic prey above the high tide line and leave it to fester in the hot sun. They pick corpses clean in a few hours, so their hunting grounds are littered with cracked and sun-bleached bones—the perfect hiding place for these littoral predators.  \n**White Ghost Shivers.** Because they eat carrion, bone crabs carry a dangerous disease—white ghost shivers, which wrack victims with fever and delirium. Sailors and others who eat a bone crab’s unwholesome, diseased flesh rarely survive it. Although bone crabs cannot be domesticated, they can be convinced to nest in particular areas, attacking intruders while ignoring the area’s regulars.",
  "name": "Bone Crab",
  "size": "Small",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 33,
  "hit_dice": "6d6+12",
  "speed": {
    "walk": 20,
    "swim": 10
  },
  "strength": 10,
  "dexterity": 14,
  "constitution": 14,
  "intelligence": 1,
  "wisdom": 12,
  "charisma": 4,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "-",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The bone crab makes two claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage.",
      "attack_bonus": 4,
      "damage_dice": "2d6"
    },
    {
      "name": "White Ghost Shivers",
      "desc": "A living creature that is injured by or makes physical contact with a creature carrying the white ghost shivers must succeed on a DC 11 Constitution saving throw at the end of the encounter to avoid becoming infected. This disease manifests after 24 hours, beginning as a mild chill, but increasingly severe after a day, accompanied by a fever. Hallucinations are common, and the fright they induce lends the disease its name. At onset, the infected creature gains two levels of exhaustion that cannot be removed until the disease is cured by lesser restoration, comparable magic, or rest. The infected creature makes another DC 11 Constitution saving throw at the end of each long rest; a successful save removes one level of exhaustion. If the saving throw fails, the disease persists. If both levels of exhaustion are removed by successful saving throws, the victim has recovered naturally."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The bone crab can breathe air and water."
    },
    {
      "name": "Bone Camouflage",
      "desc": "A bone crab has advantage on Dexterity (Stealth) checks while it's among bones."
    },
    {
      "name": "Hive Mind",
      "desc": "A bone crab can communicate perfectly with all other bone crabs within 100 feet of it. If one is aware of danger, they all are."
    },
    {
      "name": "Leap",
      "desc": "Bone crabs have incredibly powerful legs and can leap up to 10 feet straight ahead or backward as part of its movement; this counts as withdraw action when moving away from a foe."
    }
  ],
  "spell_list": [],
  "page_no": 40,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_bone-crab/"
}