{
  "slug": "chill-haunt",
  "desc": "This ghostly humanoid’s hands end in frozen claws. Water drips from the claws, freezing before it hits the ground._  \n**Forlorn Spirits.** Chill haunts arise from the corpses of humanoids that froze to death. While most chill haunts derive from those who died alone in the cold, stories tell of entire families or villages returning as chill haunts. Because of the intensity of their demise, chill haunts dread cold and flee when targeted by cold magic.  \n**Hungry for Body Heat.** The chill haunt’s disdain for cold leads it to seek out warm buildings or open fires. While ambient heat or direct contact with fire diminishes its shivering and restores wounds it has received in combat, it craves heat from living creatures. Contact with the chill haunt sets off a deepening freeze in the victim, which is hard to reverse without the application of fire. The haunt comes into contact with living creatures to remember the feeling of warmth, and it does not care about the side effects of its touch. After it has drained the warmth from one creature, it immediately moves on to the next, ever-hungry.  \n**Restless Undead.** Destroying a chill haunt is only a temporary solution to the undead creature’s depredations. Similar to a ghost, a destroyed chill haunt returns to unlife 24 hours after its demise, attaining eternal rest only after being slain under a specific set of circumstances. For most chill haunts, the surest way to eternal rest is by coaxing the haunt to a warm building where it can sit by a hearth and nestle in blankets or furs. Though physical objects normally pass through the spectral creature, such conditions allow the coverings to conform to the shape of the haunt’s former body. Moments later, the haunt lets out a contented sigh and winks out of existence.  \n**Undead Nature.** A chill haunt doesn’t require air, food, drink, or sleep.",
  "name": "Chill Haunt",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 39,
  "hit_dice": "6d8+12",
  "speed": {
    "walk": 0,
    "fly": 30
  },
  "strength": 7,
  "dexterity": 16,
  "constitution": 14,
  "intelligence": 8,
  "wisdom": 16,
  "charisma": 13,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "acrobatics": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "cold, fire, necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "the languages it knew in life",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Shivering Touch",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 10 (2d6 + 3) cold damage plus 3 (1d6) necrotic damage. The target must succeed on a DC 12 Constitution saving throw or take 3 (1d6) cold damage at the start of each of its turns. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If the target takes fire damage, the effect ends.",
      "attack_bonus": 5,
      "damage_dice": "2d6+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Cryophobia",
      "desc": "Whenever the chill haunt is subjected to cold damage, it takes no damage, but it must succeed on a DC 13 Wisdom saving throw or become frightened of the source of the damage for 1 minute. This trait overrides the haunt's normal immunity to the frightened condition."
    },
    {
      "name": "Fire Absorption",
      "desc": "Whenever the chill haunt is subjected to fire damage, it takes no damage and instead regains a number of hp equal to the fire damage dealt."
    },
    {
      "name": "Incorporeal Movement",
      "desc": "The chill haunt can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    }
  ],
  "spell_list": [],
  "page_no": 62,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_chill-haunt/"
}