{
  "slug": "clockwork-huntsman",
  "desc": "_A clockwork huntsman is mechanical soldier clad in flat-black armor, and beneath its breastplate, gears tick and whir._  \n**Slave Hunters.** These metal huntsmen were once the province of corrupt aristocrats, running down escaped slaves and tracking prey in hunting expeditions. Their masters may vary, but the clockwork huntsmen still perform when called upon. In some places they operate only on the command of the secret police, hunting down persons of interest wanted for questioning.  \nHuntsmen may operate alone, but usually they seek their quarry as a small group of two or three. Because they are unsleeping and tireless, few can hide from them for long without magical assistance.  \n**Despised Machines.** Clockwork huntsmen are painted matte black with mithral trim, and occasionally outfitted with armor or a black steel blade for added intimidation. Common folk detest them; all but their keepers and commanders shun them.  \n**Obedient to Orders.** Bound with specific instructions, clockwork huntsmen patrol, stand sentry, or remain unmoving as ordered, always paying attention, always alert to their surroundings. Clockwork huntsmen are unrelenting and single-minded in their missions, focusing on particular targets—priests, spellcasters, or heavily armored intruders, as directed. Oblivious to injury, clockwork huntsmen attack until destroyed or ordered to stand down.  \nClockwork huntsmen stand nearly six feet tall and weigh 400 lb.  \n**Constructed Nature.** A clockwork huntsman doesn’t require air, food, drink, or sleep.",
  "name": "Clockwork Huntsman",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "",
  "hit_points": 110,
  "hit_dice": "20d8+20",
  "speed": {
    "walk": 40
  },
  "strength": 17,
  "dexterity": 14,
  "constitution": 12,
  "intelligence": 4,
  "wisdom": 10,
  "charisma": 1,
  "strength_save": 5,
  "dexterity_save": 4,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "survival": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "understands Common",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Longsword",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d8"
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6"
    },
    {
      "name": "Net Cannon",
      "desc": "Ranged Weapon Attack: +4 to hit, range 5/15 ft., one target, size Large or smaller. Hit: the target is restrained. A mechanism within the clockwork huntsman's chest can fire a net with a 20-foot trailing cable anchored within the huntsman's chest. A creature can free itself (or another creature) from the net by using its action to make a successful DC 10 Strength check or by dealing 5 slashing damage to the net. The huntsman can fire up to four nets before it must be reloaded.",
      "attack_bonus": 4,
      "damage_dice": "0"
    },
    {
      "name": "Explosive Core",
      "desc": "The mechanism that powers the huntsman explodes when the construct is destroyed, projecting superheated steam and shrapnel. Every creature within 5 ft. of the construct takes 10 (3d6) fire damage, or half damage with a successful DC 13 Dexterity saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The clockwork huntsman is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The clockwork huntsman has advantage on saving throws against spells and other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 63,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_clockwork-huntsman/"
}