{
  "slug": "deep-troll",
  "desc": "This large, lanky creature has limp, slate-colored hair, a long nose, and dark green, rubbery skin. Its legs are disproportionally larger than its upper body, and its limbs are oddly curved._  \nDeep trolls live far underground in the lightless regions seldom tread by people. An offshoot from their cousins on the surface, they have adapted to their environment in some unusual ways. Although they have eyes that can see light normally, their primary means of navigating the darkness is through vibration sense, which they register on their rubbery, sensitive skin.  \n**Malleable.** After these trolls moved underground, their bodies adapted to surviving in the smaller, often cramped caverns. Their bones became soft and malleable, allowing them to access areas deep beneath the surface world. Deep trolls can elongate their limbs and body or squeeze themselves ooze-like through tiny cracks and openings until they emerge into a place large enough to accommodate their natural size.  \n**Tribal.** Deep trolls live in small tribes of seven to fifteen members. They raid in groups, though they can be found alone when hunting or scavenging. They are intelligent enough to communicate, but they are voracious and can rarely be reasoned with when food is present. They prefer to attack anything potentially edible that isn’t part of the tribe and deal with the repercussions later. In rare cases, when confronted with opponents who are clearly more powerful, they can be persuaded to reason and discuss terms. Deep trolls are likely to agree to mutually beneficial terms, such as helping them deal with a common enemy or providing them with something they value.",
  "name": "Deep Troll",
  "size": "Large",
  "type": "Giant",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 63,
  "hit_dice": "6d10+30",
  "speed": {
    "walk": 30,
    "burrow": 20
  },
  "strength": 18,
  "dexterity": 13,
  "constitution": 20,
  "intelligence": 7,
  "wisdom": 9,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 30 ft., darkvision 60 ft., passive Perception 9",
  "languages": "Deep Speech",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The deep troll makes two attacks: one with its bite and one with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 7 (1d6 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d6+4"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 11 (2d6 + 4) slashing damage.",
      "attack_bonus": 6,
      "damage_dice": "2d6+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Malleable Internal Structure",
      "desc": "Provided there is suitable room to accommodate its volume, a deep troll can move at half its burrowing speed through any opening large enough for a Tiny creature."
    },
    {
      "name": "Oozing Body",
      "desc": "When the deep troll takes at least 15 slashing damage at one time, a chunk of its oozing flesh falls off into an unoccupied space within 5 feet of it. This flesh isn't under the deep troll's control, but it views the troll as an ally. The oozing flesh acts on the deep troll's initiative and has its own action and movement. It has an AC of 10, 10 hp, and a walking speed of 15 feet. It can make one attack with a +6 to hit, and it deals 7 (2d6) acid damage on a hit. If not destroyed, the oozing flesh lives for 1 week, voraciously consuming any non-deep troll creature it encounters. After that time, it dissolves into a puddle of water and gore."
    },
    {
      "name": "Regeneration",
      "desc": "The deep troll regains 10 hp at the start of its turn. If the troll takes fire damage, this trait doesn't function at the start of the troll's next turn. The deep troll dies only if it starts its turn with 0 hp and doesn't regenerate."
    }
  ],
  "spell_list": [],
  "page_no": 352,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_deep-troll/"
}