{
  "slug": "dissimortuum",
  "desc": "_This twisted humanoid has gray flesh and black claws that drip blood. A bone mask is bound to its head by strips of putrid flesh and a third arm hangs from the right side of the creature’s body, its hand clutching a large sack stained with blood._  \n**Plague Bringers.** Dissimortuum are undead monstrosities constructed by necromancers to spread the undead plague, slowly but surely. These creatures are rare but tenacious. A dissimortuum obeys orders from the necromancer whose magic created it.  \nWhen a dissimortuum kills, it collects body parts from its victims and keeps them in a sack that it carries with its third arm at all times. The monster sets down its sack of trophies only when pressed in combat, to make the most of its extra limb.  \n**Constructing Dissimortuum.** Even when not following instructions, a dissimortuum seeks to create more of its own kind. The creature wanders graveyards, battlefields, and slums, searching for the gruesome components it needs to construct a mask and body for its undead offspring. The process is slow, taking up to a month to make a single mask, but a dissimortuum has nothing but time. The new creation is independent and not under the control of its maker.  \n**Donning the Mask.** The mask of a dissimortuum is nigh indestructible. When the creature is destroyed, its mask usually survives and breaks free. On its own, the object detects as magical with mixed enchantment and necromantic auras. It is a tempting souvenir, but anyone foolish enough to don the mask is immediately wracked by pain and takes 7 (2d6) necrotic damage. The character must make a successful DC 15 Wisdom saving throw or become dominated by the mask. The domination arrives slowly. The character acts normally for a day or two, but then the character notices periods of time that cannot be accounted for. During these times, the character gathers the grisly components needed to build a new body for the dissimortuum. This process takes a week, after which the character is freed from domination as the undead creature is reborn.",
  "name": "Dissimortuum",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 112,
  "hit_dice": "15d8+45",
  "speed": {
    "walk": 30,
    "climb": 30
  },
  "strength": 14,
  "dexterity": 10,
  "constitution": 16,
  "intelligence": 8,
  "wisdom": 11,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 6,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "charmed, exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Common",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dissimortuum makes three claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 15 (3d8 + 2) slashing damage.",
      "attack_bonus": 5,
      "damage_dice": "3d8"
    },
    {
      "name": "Terrifying Mask",
      "desc": "Each non-undead creature within 60 feet of the dissimortuum that can see it must make a successful DC 15 Wisdom saving throw or be frightened for 1d8 rounds. If a target's saving throw is successful or the effect ends for it, the target becomes immune to all dissimortuum's terrifying masks for the next 24 hours."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Spider Climb",
      "desc": "The dissimortuum can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    }
  ],
  "spell_list": [],
  "page_no": 119,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_dissimortuum/"
}