{
  "slug": "dreameater-tob1-2023",
  "desc": "False",
  "name": "Dream Eater",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 75,
  "hit_dice": "10d8 + 30",
  "speed": {
    "walk": 20,
    "fly": 30
  },
  "strength": 15,
  "dexterity": 18,
  "constitution": 17,
  "intelligence": 16,
  "wisdom": 13,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 11,
  "skills": {
    "Deception": 8,
    "Insight": 4,
    "Persuasion": 8
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "Abyssal, Celestial, Common, Infernal, telepathy 120 ft.",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dream eater uses its Lotus Scent. It then makes one Bite attack and one Claw attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage, and the target is grappled (escape DC 14) if it is a Large or smaller creature. Until this grapple ends, the creature is restrained. The dream eater has two claws, each of which can grapple only one target."
    },
    {
      "name": "Lotus Scent",
      "desc": "The dream eater secretes an oily chemical that most creatures find intoxicating. Each creature that isn't a Construct or Undead within 15 feet of the dream eater must succeed on a DC 14 Constitution saving throw or be poisoned for 1 minute. While poisoned, the creature is charmed by the fiend. A poisoned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dream eater's Lotus Scent for the next 24 hours."
    },
    {
      "name": "Waking Dreams (Recharge 5-6)",
      "desc": "Each creature within 20 feet of the dream eater must make a DC 14 Charisma saving throw. On a failure, a creature takes 21 (6d6) psychic damage and is incapacitated for 1 minute. When it moves, an incapacitated creature moves in a random direction. On a success, a creature takes half the damage and isn't incapacitated. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": [
    {
      "name": "Change Shape",
      "desc": "The dream eater magically transforms into a Small or Medium humanoid it has seen, or back into its true form, which is a Fiend. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying transforms with it. It reverts to its true form if it dies."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Dream Eater's Caress",
      "desc": "A creature that starts its turn grappled by the dream eater must succeed on a DC 14 Charisma saving throw or take 5 (2d4) psychic damage. The dream eater gains temporary hp equal to the psychic damage dealt."
    }
  ],
  "spell_list": [],
  "page_no": 148,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_dream-eater/"
}