{
  "slug": "far-dorocha",
  "desc": "The fey lady’s attendant stands by, waiting on her from the shadows. The lady voices her desire, and the attendant leaps into action, calling a phantasmal charger made of midnight and shadow._  \n**Fey Stewards.** The far dorocha manage the servants of the fey courts and, when tasked, carry out the more sinister biddings of their masters. Fey lords and ladies prize the far dorocha for their attention to detail and composed mien.  \n**Abductor of Mortals.** Sometimes called the “dark man” or “fear dorcha,” these malicious fey are described in grim folk tales. Parents scare their children into obedience by telling bedtime stories of villains who ride black horses in the night and steal the ill-behaved away to lands of perpetual darkness. Woe betide the children who wake up to find they are the ones alone.",
  "name": "Far Dorocha",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 14,
  "armor_desc": "natural armor), 18 while in dim light or darkness",
  "hit_points": 82,
  "hit_dice": "15d8+15",
  "speed": {
    "walk": 30
  },
  "strength": 10,
  "dexterity": 18,
  "constitution": 13,
  "intelligence": 14,
  "wisdom": 10,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "deception": 7,
    "perception": 3,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "charmed, frightened",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "Common, Elvish, Sylvan, Umbral",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The far dorocha makes two dirk attacks."
    },
    {
      "name": "Dirk",
      "desc": "Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 7 (1d6 + 4) piercing damage plus 14 (4d6) poison damage, and the target must succeed on a DC 15 Constitution saving throw or be poisoned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 7,
      "damage_dice": "1d6+4"
    },
    {
      "name": "Dark Invitation",
      "desc": "One humanoid within 30 feet of the far dorocha and that can hear it must succeed on a DC 15 Charisma saving throw or be magically charmed for 1 day. The charmed target believes it has been invited to meet with the far dorocha's master and accompanies the far dorocha. Although the target isn't under the far dorocha's control, it takes the far dorocha's requests or actions in the most favorable way it can. Each time the far dorocha or its companions do anything harmful to the target, the target can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect ends if the far dorocha is destroyed, is on a different plane of existence than the target, or uses its bonus action to end the effect. If the target successfully saves against the effect, or if the effect ends for it, the target is immune to the far dorocha's Dark Invitation for the next 24 hours.\n\nThe far dorocha can have only one target charmed at a time. If it charms another, the effect on the previous target ends."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Shadow Traveler (3/Day)",
      "desc": "As a bonus action while in shadows, dim light, or darkness, the far dorocha disappears into the darkness and reappears in an unoccupied space it can see within 30 feet. A tendril of inky smoke appears at the origin and destination when it uses this trait."
    },
    {
      "name": "Traveler in Darkness",
      "desc": "The far dorocha has advantage on Intelligence (Arcana) checks made to know about shadow roads and shadow magic spells or items."
    },
    {
      "name": "Under the Cloak of Night",
      "desc": "While in dim light or darkness, the far dorocha's AC includes its Charisma modifier, and it has advantage on saving throws."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The far dorocha's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spells, requiring no material components.\nAt will: disguise self, thaumaturgy\n3/day each: command, phantom steed\n1/day each: compulsion, darkness"
    }
  ],
  "spell_list": [],
  "page_no": 142,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_far-dorocha/"
}