{
  "slug": "fragrant-one",
  "desc": "A pale yellow and green slug-like creature with a benign expression on its round human face sits atop a large mushroom. Long antennae wave atop its bald head as its languid blue eyes observe its surroundings._  \n**Fairytale Fey.** A fragrant one is a whimsical and playful creature whose innocent and friendly demeanor hides a cunning intelligence. Fragrant ones feed on companionship and use their magical pheromones to inveigle themselves into the lives of other creatures, particularly woodland humanoids and giants. Strangely, a fragrant one knows nothing of real commitment or friendship, and all of its relationships are built on lies and deceptions.  \n**Safety in Numbers.** Fragrant ones are relatively weak when alone, barely having enough strength to fend off predators. When in the presence of multiple charmed companions, however, a fragrant one becomes much more of a threat, its body growing thick chitinous plates and its antennae lengthening.",
  "name": "Fragrant One",
  "size": "Small",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 11,
  "armor_desc": null,
  "hit_points": 45,
  "hit_dice": "13d6",
  "speed": {
    "walk": 20,
    "climb": 20
  },
  "strength": 7,
  "dexterity": 12,
  "constitution": 10,
  "intelligence": 18,
  "wisdom": 15,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": 6,
  "wisdom_save": 4,
  "charisma_save": 6,
  "perception": 4,
  "skills": {
    "deception": 8,
    "insight": 4,
    "perception": 4,
    "persuasion": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "charmed, frightened",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Common, Elvish, Sylvan, telepathy 60 ft.",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Phrenic Antennae",
      "desc": "Melee Spell Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d4 + 4) psychic damage, and the target must succeed on a DC 14 Wisdom saving throw or be incapacitated until the end of its next turn.",
      "attack_bonus": 6,
      "damage_dice": "1d4+4"
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Interpose Ally",
      "desc": "When a creature the fragrant one can see targets it with an attack, the fragrant one can force a charmed ally within 5 feet of it to move between it and the attack. The charmed ally becomes the target of the attack instead. If the charmed ally takes damage from this attack, it can immediately repeat the Fragrant Aura's saving throw, ending the charmed condition on itself on a success."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fragrant Aura",
      "desc": "The fragrant one emits a cloud of sweet-smelling pheromones within 20 feet of it. A giant, humanoid, or beast that starts its turn inside the aura must succeed on a DC 14 Wisdom saving throw or be charmed for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nIf a creature fails the saving throw three times in 1 hour, it is charmed for 1 day and obeys the fragrant one's verbal or telepathic commands. If the creature suffers harm from the fragrant one or its allies or receives a suicidal command, it can repeat the saving throw, ending the effect on a success.\n\nThe fragrant one can have no more than six creatures charmed at a time. The fragrant one can end its charm on a creature at any time (no action required). If the fragrant one has six creatures charmed and a seventh creature fails its saving throw, the fragrant one can choose to release its charm on another creature to replace it with the new creature or to have the new creature unaffected by the aura."
    },
    {
      "name": "Strength in Numbers",
      "desc": "The fragrant one grows more powerful when it has charmed allies. For each charmed ally within 20 feet of it, the fragrant one gains 5 temporary hit points, its Armor Class increases by 1, and it deals an extra 2 (1d4) psychic damage when it hits with any attack. Temporary hp gained from this trait replenish every 1 minute."
    }
  ],
  "spell_list": [],
  "page_no": 156,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_fragrant-one/"
}