{
  "slug": "gulper-behemoth",
  "desc": "The titanic eel-like creature has delicately dancing frills and flickers of phosphorescence just under its translucent skin. Its mouth opens impossibly wide as it surges forward._  \n**Deep Sea Lure.** The gulper behemoth lives in the waters of the remotest oceans. It lures sea dwellers to their deaths with dancing motes of light within its massive, ballooning gullet. Rumors abound that even a sharp pinprick will deflate the sea monster.  \n\n## Gulper Behemoth’s Lair\n\n  \nThe gulper’s lair is filled with brightly-colored and labyrinthine giant corals. Smaller, mutualistic predators swim throughout the lair, keeping it well protected.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the gulper behemoth takes a lair action to cause one of the following effects; the gulper behemoth can’t use the same effect two rounds in a row:\n* The gulper behemoth commands deep sea eels and plants to constrict a target it can see within 60 feet of it. The target must succeed on a DC 15 Strength saving throw or be restrained until initiative count 20 on the next round.\n* The gulper behemoth commands plants and coral to shoot boiling water at up to three creatures it can see within 60 feet of it. Each target must make a DC 15 Constitution saving throw, taking 10 (3d6) fire damage on a failed save, or half as much damage on a successful one. Being underwater doesn’t grant resistance against this damage.",
  "name": "Gulper Behemoth",
  "size": "Gargantuan",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 188,
  "hit_dice": "13d20+52",
  "speed": {
    "walk": 0,
    "swim": 40
  },
  "strength": 20,
  "dexterity": 10,
  "constitution": 19,
  "intelligence": 4,
  "wisdom": 10,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "piercing",
  "damage_resistances": "acid, thunder",
  "damage_immunities": "",
  "condition_immunities": "blinded",
  "senses": "blindsight 120 ft., passive Perception 10",
  "languages": "—",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 40 (6d10 + 7) piercing damage. If the target is a creature, it is grappled (escape DC 16). Until this grapple ends, the target is restrained, and the gulper behemoth can't bite another target.",
      "attack_bonus": 9,
      "damage_dice": "6d10+7"
    },
    {
      "name": "Swallow",
      "desc": "The gulper behemoth makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the creature is also swallowed, and the grapple ends. While swallowed, the creature is blinded and restrained, it has total cover against attacks and other effects outside the behemoth, and it takes 14 (4d6) acid damage at the start of each of the behemoth's turns.\n\nIf the gulper behemoth takes 20 damage or more on a single turn from a creature inside it, the behemoth must succeed on a DC 15 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the behemoth. If the behemoth dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 15 feet of movement, exiting prone."
    },
    {
      "name": "Sonic Pulse (Recharge 5-6)",
      "desc": "The gulper behemoth expels a sonic pulse in a 60-foot cone. Each creature in that area must make a DC 16 Constitution saving throw. On a failure, the creature takes 21 (6d6) thunder damage and is stunned until the end of its next turn. On a success, the creature takes half the damage and isn't stunned."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Death Burst",
      "desc": "The gulper behemoth explodes when it drops to 0 hp. Each creature within 40 feet of it must succeed on a DC 16 Constitution saving throw, taking 21 (6d6) acid damage on a failed save."
    },
    {
      "name": "Echolocation",
      "desc": "The gulper behemoth can't use its blindsight while deafened."
    },
    {
      "name": "Keen Hearing",
      "desc": "The gulper behemoth has advantage on Wisdom (Perception) checks that rely on hearing."
    },
    {
      "name": "Water Breathing",
      "desc": "The gulper behemoth can breathe only underwater."
    }
  ],
  "spell_list": [],
  "page_no": 190,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_gulper-behemoth/"
}