{
  "slug": "gypsosphinx",
  "desc": "_With black wings and a body pale as alabaster, the vulture-beaked gypsosphinx is easy to identify. As powerful servants of the gods of death and the desert, their riddles and obsessions all hinge on death and carrion. Their eyes can spot prey miles away, and the distance they climb into the sky hides their enormous size._  \nThe pale gypsosphinx shines in the desert sun and stands out in underground tombs and caverns, yet it can conceal itself when it flies in moonlit clouds. Gypsosphinxes are found anywhere bodies are buried or left to rot, and they harvest corpses from battlefields of warring desert tribes.  \n_**Gossips and Riddlers.**_ Gypsosphinxes converse with intelligent undead, priests of death gods, and with other sphinxes, but they rarely gather among their own kind. They guard their territory jealously, typically claiming a necropolis as the heart of their region.  \nLike all sphinxes, gypsosphinxes enjoy riddles. They rely on magic to solve challenging riddles they can’t solve on their own.  \n_**Night Flyers.**_ Unlike most of their cousins, gypsosphinxes are gifted fliers capable of diving steeply from the night sky to snatch carrion or a sleeping camel. The stroke of midnight has a special but unknown significance for the beasts.  \n_**Foretell Doom.**_ Occasionally, a paranoid noble seeks out a gypsosphinx and entreats the creature to reveal the time and place of his or her death, hoping to cheat fate. A gypsosphinx demands a high price for such a service, including payment in corpses of humans, unusual creatures, or near-extinct species. Even if paid, the gypsosphinx rarely honors its side of the bargain; instead, it turns its death magic against the supplicant, bringing about his or her death then and there.",
  "name": "Gypsosphinx",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 171,
  "hit_dice": "18d10+72",
  "speed": {
    "walk": 40,
    "fly": 70
  },
  "strength": 20,
  "dexterity": 14,
  "constitution": 18,
  "intelligence": 18,
  "wisdom": 18,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 9,
  "skills": {
    "arcana": 9,
    "history": 9,
    "perception": 9,
    "religion": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "psychic, poison",
  "condition_immunities": "poisoned",
  "senses": "truesight 90 ft., passive Perception 19",
  "languages": "Abyssal, Common, Darakhul, Sphinx",
  "challenge_rating": "14",
  "cr": 14,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sphinx makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 21 (3d10 + 5) piercing damage.",
      "attack_bonus": 10,
      "damage_dice": "3d10"
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 32 (6d8 + 5) slashing damage.",
      "attack_bonus": 10,
      "damage_dice": "6d8"
    },
    {
      "name": "Rake",
      "desc": "If the sphinx succeeds with both claw attacks, it automatically follows up with a rake attack. If the target fails a DC 17 Dexterity check, it is knocked prone and takes 14 (2d8 + 5) slashing damage."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "The sphinx can take 3 legendary actions, choosing from the options below. Only one option can be used at a time and only at the end of another creature's turn. It regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Bite Attack",
      "desc": "The sphinx makes one bite attack."
    },
    {
      "name": "Teleport (Costs 2 Actions)",
      "desc": "The sphinx magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
    },
    {
      "name": "Cast a Spell (Costs 3 Actions)",
      "desc": "The sphinx casts a spell from its list of prepared spells, using a spell slot as normal."
    }
  ],
  "special_abilities": [
    {
      "name": "Inscrutable",
      "desc": "The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. Wisdom (Insight) checks made to ascertain the sphinx's intentions or sincerity have disadvantage."
    },
    {
      "name": "Magic Weapons",
      "desc": "The sphinx's weapon attacks are magical."
    },
    {
      "name": "Mystic Sight",
      "desc": "A gypsosphinx sees death coming and can foretell the manner of a person's death. This ability does not come with any urge to share that information. Gypsosphinxes are notorious for hinting, teasing, and even lying about a creature's death (\"If we fight, I will kill you and eat your heart. I have seen it,\"is a favorite bluff)."
    },
    {
      "name": "Spellcasting",
      "desc": "the sphinx is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). It requires no material components to cast its spells. The sphinx has the following wizard spells prepared:\n\ncantrips: (at will): mage hand, mending, minor illusion, poison spray\n\n1st level (4 slots): comprehend languages, detect magic, identify\n\n2nd level (3 slots): blur, darkness, locate object\n\n3rd level (3 slots): dispel magic, glyph of warding, major image\n\n4th level (3 slots): blight, greater invisibility\n\n5th level (1 slot): cloudkill"
    }
  ],
  "spell_list": [],
  "page_no": 359,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_gypsosphinx/"
}