{
  "slug": "hodag",
  "desc": "A creature covered in green and brown fur with a horned, frog-shaped head and spikes running along its back and tail stalks forward, its fanged face twisted in a leering grin._  \nHodags are carnivorous nocturnal predators that stalk temperate forests, hills, and plains.  \n**Taste for Domestic Life.** While fierce, hodags prefer to kill easy prey. Many stalk the lands outside farms, villages, and even small cities, attacking livestock, pets, and travelers. Hodags have been known to break down the doors of houses, barns, and other buildings to get at prey inside.  \n**Solo Hunters until Mating.** Hodags are generally solitary creatures with large territories. Babies are abandoned by their mothers after birth. There is an exception for one week each year in spring just after the end of winter. Hodags within several hundred miles instinctually gather in a prey-filled area, which never seems to be the same place twice. The hodags gorge on as much food as possible and engage in mating rituals. When the week is over, the hodags disperse, returning to their territories.  \n**Impossible to Train.** Hodags are born with strong predator instincts, which helps the young survive after being left by their mothers. Many believe this same instinct makes hodags impossible to train, but such claims only make them more valuable targets for those who collect exotic pets.",
  "name": "Hodag",
  "size": "Large",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 52,
  "hit_dice": "7d10+14",
  "speed": {
    "walk": 40
  },
  "strength": 19,
  "dexterity": 12,
  "constitution": 14,
  "intelligence": 3,
  "wisdom": 12,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "charmed",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "—",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hodag makes three melee attacks, but can use its bite and horn attacks only once each."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d8+4"
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) slashing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d6+4"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +6 to hit, reach 10 ft., one target. Hit: 6 (1d4 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d4+4"
    },
    {
      "name": "Horns",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 9 (2d4 + 4) piercing damage.",
      "attack_bonus": 6,
      "damage_dice": "2d4+4"
    },
    {
      "name": "Territorial Display (Recharge 6)",
      "desc": "The hodag rears and stomps on the ground then roars a territorial challenge. Each creature within 10 feet of the hodag must make a DC 14 Dexterity saving throw, taking 14 (4d6) thunder damage on a failed save, or half as much damage on a successful one. A creature that fails the saving throw by 5 or more is also knocked prone."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Charge",
      "desc": "If the hodag moves at least 10 feet straight toward a target and then hits it with a horn attack on the same turn, the target takes an extra 5 (2d4) piercing damage. If the target is a creature, it must succeed on a DC 14 Strength saving throw or be knocked prone."
    },
    {
      "name": "Improved Critical",
      "desc": "The hodag's teeth, claws, horns, and tail spikes are extra sharp. These weapon attacks score a critical hit on a roll of 19 or 20."
    },
    {
      "name": "Keen Hearing and Smell",
      "desc": "The hodag has advantage on Wisdom (Perception) checks that rely on hearing or smell."
    }
  ],
  "spell_list": [],
  "page_no": 200,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_hodag/"
}