{
  "slug": "hongaek",
  "desc": "A faint disturbance signifies the presence of something terrible and evil—an unnatural miasma. Suddenly, the hazy air coalesces into a mass of greenish fog with multiple red eyes and a dozen vaporous tentacles._  \n**Harbingers of Pestilence.** The hongaek is an elemental creature from the most stagnant and fouled regions of the Elemental Plane of Air. Its mere presence serves to strengthen and empower diseases and poisons in its proximity. Hongaeks typically arrive on the Material Plane through planar portals in areas where pestilence and famine are rampant, but they are occasionally summoned by death cults or by those who venerate gods of plague or poison.  \n**Elemental Hatred.** Hongaeks are thoroughly evil and hate land-dwelling lifeforms like humans and elves. They detest other elemental creatures just as much, and battles between them are not uncommon where their territories on the planes meet.  \n**Elemental Nature.** The hongaek doesn’t require air, food, drink, or sleep.",
  "name": "Hongaek",
  "size": "Large",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": null,
  "hit_points": 105,
  "hit_dice": "14d10+28",
  "speed": {
    "fly": 40,
    "walk": 0,
    "hover": true
  },
  "strength": 5,
  "dexterity": 20,
  "constitution": 14,
  "intelligence": 12,
  "wisdom": 15,
  "charisma": 13,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 5,
  "skills": {
    "medicine": 5,
    "perception": 5,
    "stealth": 8
  },
  "damage_vulnerabilities": "fire",
  "damage_resistances": "lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "blindsight 90 ft. (blind beyond this radius), passive Perception 15",
  "languages": "Auran, Common, Deep Speech",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hongaek makes two attacks with its vaporous tentacles."
    },
    {
      "name": "Vaporous Tentacle",
      "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 18 (4d8) poison damage, and the target must succeed on a DC 14 Constitution saving throw or be poisoned for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 8,
      "damage_dice": "4d8"
    },
    {
      "name": "Invisibility",
      "desc": "The hongaek magically turns invisible until it attacks or casts a spell, or until its concentration ends (as if concentrating on a spell). Any equipment the hongaek wears or carries is invisible with it."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Exacerbate Affliction",
      "desc": "The hongaek has advantage on attack rolls against a creature that is suffering from a disease or that has the poisoned condition."
    },
    {
      "name": "Gas Form",
      "desc": "The hongaek can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing, but it can't move through water or other liquids."
    },
    {
      "name": "Prolong Affliction",
      "desc": "Each creature within 30 feet of the hongaek that is suffering a disease or that has the poisoned condition has disadvantage on saving throws against the disease or poison afflicting it. In addition, the hongaek can pinpoint the location of such creatures within 30 feet of it."
    },
    {
      "name": "Innate Spellcasting (1/Day)",
      "desc": "The hongaek can innately cast contagion, requiring no material components. Its innate spellcasting ability is Charisma."
    }
  ],
  "spell_list": [],
  "page_no": 201,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_hongaek/"
}