{
  "slug": "illhveli-nauthveli",
  "desc": "Vast and terrible to behold, a nauthveli is an enormous whale with a dappled black-and-white hide and a head resembling an enormous fanged cow, its eyes blazing with malevolence._  \n**Evil of the Seas.** One of the largest of the illhveli, the nauthveli is a creature of pure hatred and malice. Known for their bellowing bull-like cries, the nauthveli haunt deep, cold waters, contesting the depths with other monsters such as Open Game License",
  "name": "Illhveli, Nauthveli",
  "size": "Gargantuan",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 280,
  "hit_dice": "16d20+112",
  "speed": {
    "swim": 60,
    "walk": 10
  },
  "strength": 30,
  "dexterity": 10,
  "constitution": 25,
  "intelligence": 6,
  "wisdom": 15,
  "charisma": 12,
  "strength_save": 15,
  "dexterity_save": null,
  "constitution_save": 12,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": null,
  "perception": 7,
  "skills": {
    "athletics": 15,
    "perception": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "",
  "condition_immunities": "frightened, prone",
  "senses": "darkvision 60 ft., passive Perception 17",
  "languages": "understands Common but can’t speak",
  "challenge_rating": "16",
  "cr": 16,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The nauthveli makes one bite attack and one tail attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +15 to hit, reach 10 ft., one target. Hit: 31 (6d6 + 10) piercing damage. If the target is a creature, it is grappled (escape DC 18). Until this grapple ends, the target is restrained, and the nauthveli can't bite another target.",
      "attack_bonus": 15,
      "damage_dice": "6d6+10"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +15 to hit, reach 20 ft., one target. Hit: 28 (4d8 + 10) bludgeoning damage.",
      "attack_bonus": 15,
      "damage_dice": "4d8+10"
    },
    {
      "name": "Swallow",
      "desc": "The nauthveli makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target is also swallowed, and the grapple ends. While swallowed, the creature is blinded and restrained, it has total cover against attacks and other effects outside the nauthveli, and it takes 28 (8d6) acid damage at the start of each of the nauthveli's turns.\n\nIf the nauthveli takes 40 damage or more on a single turn from a creature inside it, the nauthveli must succeed on a DC 22 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the nauthveli. If the nauthveli dies, a swallowed creature is no longer restrained by it and can escape from the corpse using 15 feet of movement, exiting prone."
    },
    {
      "name": "Thunderous Bellow (Recharge 5-6)",
      "desc": "The nauthveli bellows in a 60-foot cone. Each creature in the area must make a DC 20 Dexterity saving throw. On a failure, a creature takes 54 (12d8) thunder damage and is pushed up to 15 feet away from the nauthveli and knocked prone. On a success, a creature takes half the damage and isn't pushed or knocked prone."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Hold Breath",
      "desc": "The nauthveli can hold its breath for 1 hour."
    },
    {
      "name": "Siege Monster",
      "desc": "The nauthveli deals double damage to objects and structures."
    },
    {
      "name": "Terror of the High Seas",
      "desc": "The nauthveli is surrounded by a supernatural aura of dread. Each creature that starts its turn within 60 feet of the nauthveli must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature immersed in water has disadvantage on this saving throw. A frightened creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the nauthveli's Terror of the High Seas for the next 24 hours."
    }
  ],
  "spell_list": [],
  "page_no": 212,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_illhveli-nauthveli/"
}