{
  "slug": "kobold-war-machine",
  "desc": "A fire burns in the maw of the massive, draconic machine. The frenetic cackling of kobolds yelling orders to one another echoes from the interior, rising above the sounds of the machine’s engines._  \nInspired by the sight of a fearsome Open Game License",
  "name": "Kobold War Machine",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 114,
  "hit_dice": "12d10+48",
  "speed": {
    "walk": 25
  },
  "strength": 21,
  "dexterity": 14,
  "constitution": 19,
  "intelligence": 2,
  "wisdom": 7,
  "charisma": 1,
  "strength_save": null,
  "dexterity_save": 6,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone, unconscious",
  "senses": "darkvision 60 ft., passive Perception 8",
  "languages": "—",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The kobold war machine makes two spiked wheel attacks. Alternatively, it can make three spit fire attacks."
    },
    {
      "name": "Spiked Wheel",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) piercing damage.",
      "attack_bonus": 9,
      "damage_dice": "2d10+6"
    },
    {
      "name": "Spit Fire",
      "desc": "Ranged Weapon Attack: +6 to hit, range 120 ft., one target. Hit: 14 (4d6) fire damage.",
      "attack_bonus": 6,
      "damage_dice": "4d6"
    },
    {
      "name": "Fire Breath (Recharge 5-6)",
      "desc": "The kobold war machine exhales fire in a 30-foot cone. Each creature in that area must make a DC 16 Dexterity saving throw, taking 35 (10d6) fire damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The kobold war machine is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Operators",
      "desc": "The kobold war machine can either take an action or move up to its speed each turn, not both. The war machine can hold up to three Small operators. If it has at least one operator, it can move and act normally as long as the operator spends its entire turn operating the war machine. When it has more than one operator, it has additional traits as long as the additional operators spend their entire turns operating the war machine.\n\nIf a creature scores a critical hit against the kobold war machine, the creature can target one of the operators with the attack instead. Otherwise, the operators can't be targeted and are immune to damage while operating the kobold war machine."
    },
    {
      "name": "Ram Them! (Two or More Operators)",
      "desc": "If the kobold war machine moves at least 15 feet straight toward a target and then hits it with a spiked wheel attack on the same turn, the target takes an extra 11 (2d10) piercing damage. If the target is a creature, it must succeed on a DC 16 Strength saving throw or be knocked prone."
    },
    {
      "name": "Siege Monster",
      "desc": "The kobold war machine deals double damage to objects and structures."
    },
    {
      "name": "That Way! (Three or More Operators)",
      "desc": "The kobold war machine can take the Dash or Disengage action as a bonus action on each of its turns."
    }
  ],
  "spell_list": [],
  "page_no": 233,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_kobold-war-machine/"
}