{
  "slug": "noth-norren",
  "desc": "A massive upside-down tornado races along the ground, its mouth swallowing everything around it and its tail spiraling off into the air. The interior of the whirlwind is lined with thousands of jagged teeth, ready to devour all in its path._  \n**Epitomes of Destruction.** The noth-norren is one of the most destructive and malicious of all elemental creatures and joyfully indulges in the rampant destruction of anything it can fit into its churning vortex. Noth-norrens are typically found in the wildest regions of the Elemental Plane of Air, where their presence often goes overlooked until they strike. They are rare on the Material Plane, though they can be summoned by Open Game License",
  "name": "Noth-norren",
  "size": "Gargantuan",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 14,
  "armor_desc": null,
  "hit_points": 203,
  "hit_dice": "14d20+56",
  "speed": {
    "hover": true,
    "walk": 0,
    "fly": 90
  },
  "strength": 21,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 8,
  "wisdom": 14,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": 8,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison, thunder",
  "condition_immunities": "deafened, exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "Auran",
  "challenge_rating": "13",
  "cr": 13,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The noth-norren makes two slam attacks. Alternatively, it uses Throw Debris twice."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 27 (4d10 + 5) bludgeoning damage. A creature struck by the slam attack must succeed on a DC 16 Strength saving throw or be knocked prone.",
      "attack_bonus": 9,
      "damage_dice": "4d10+5"
    },
    {
      "name": "Throw Debris",
      "desc": "Ranged Weapon Attack: +8 to hit, range 60/180 ft., one target. Hit: 22 (4d8 + 4) bludgeoning damage.",
      "attack_bonus": 8,
      "damage_dice": "4d8+4"
    },
    {
      "name": "Fling Victim",
      "desc": "One Large or smaller creature caught in the nothnorren's vortex is thrown up to 60 feet in a random direction and knocked prone. If a thrown target strikes a solid surface, the target takes 3 (1d6) bludgeoning damage for every 10 feet it was thrown. If the target is thrown at another creature, that creature must succeed on a DC 16 Dexterity saving throw or take the same damage and be knocked prone."
    },
    {
      "name": "Vortex (Recharge 5-6)",
      "desc": "The noth-norren pulls nearby creatures into its central vortex to be torn apart by its jagged teeth. Each creature within 5 feet of the noth-norren must succeed on a DC 16 Strength saving throw or be pulled into the vortex. A creature in the vortex is blinded and restrained, it has total cover against attacks and other effects outside the vortex, and it takes 21 (6d6) slashing damage at the start of each of the noth-norren's turns.\n\nIf the noth-norren takes 30 damage or more on a single turn from a creature inside the vortex, the noth-norren must succeed on a DC 18 Constitution saving throw at the end of that turn or release all creatures caught in its vortex, which fall prone in a space within 10 feet of the noth-norren. If the noth-norren dies, it becomes a pile of teeth, its windy form dissipating, and releases all trapped creatures."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Air Turbulence",
      "desc": "A flying creature that enters or starts its turn within 60 feet of the noth-norren must land at the end of its turn or fall. In addition, ranged attack rolls against the noth-norren have disadvantage."
    },
    {
      "name": "Magic Weapons",
      "desc": "The noth-norren's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": 270,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_noth-norren/"
}