{
  "slug": "oasis-keeper",
  "desc": "The large, sand-colored serpent lies in wait beneath the sands at the edge of the oasis, its large nostrils flaring above the sand. The barbed stinger on the end of its tail rests just below the water’s surface._  \nOasis keepers lurk within the waters of oases and secrete a toxin into them.  \n**Peaceful Poison.** Traveling caravans and animals that drink from oases inhabited by oasis keepers are lulled into lingering around them and provide an ample food supply for the oasis keepers. Settlements often form around such oases, and occasional disappearances are accepted as the norm.  \n**Sand and Water Dwellers.** Oasis keepers lurk by the edge of the water and wait for an opportune time to use their stingers. After they strike, they pull their meal to the water’s depths to feast. Oasis keepers occasionally travel into underground rivers to mate, but they are otherwise fairly sedentary and solitary.",
  "name": "Oasis Keeper",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 123,
  "hit_dice": "13d12+39",
  "speed": {
    "swim": 30,
    "walk": 30
  },
  "strength": 20,
  "dexterity": 14,
  "constitution": 16,
  "intelligence": 3,
  "wisdom": 12,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": 6,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 5,
  "charisma_save": null,
  "perception": 5,
  "skills": {
    "perception": 5,
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "blindsight 20 ft., darkvision 60 ft., passive Perception 15",
  "languages": "—",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The oasis keeper makes two attacks: one with its stinger and one with its bite"
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft, one target. Hit: 21 (3d10 + 5) piercing damage.",
      "attack_bonus": 9,
      "damage_dice": "3d10+5"
    },
    {
      "name": "Stinger",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft, one target. Hit: 14 (2d8 + 5) piercing damage, and the target must make a DC 15 Constitution saving throw. On a failure, the target takes 14 (4d6) poison damage and is incapacitated for 1 minute. On a success, the target takes half the damage and isn't incapacitated. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 9,
      "damage_dice": "2d8+5"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Hold Breath",
      "desc": "The oasis keeper can hold its breath for 30 minutes."
    },
    {
      "name": "Oasis Camouflage",
      "desc": "The oasis keeper has advantage on Dexterity (Stealth) checks made while in a desert or in sandy terrain beneath water."
    },
    {
      "name": "Pacifying Secretions",
      "desc": "If the oasis keeper's stinger sits in water for at least 1 hour, the water becomes poisoned with its toxin. A creature that drinks the poisoned water must succeed on a DC 15 Constitution saving throw or be calmed for 24 hours. A calmed creature feels compelled to stay at the oasis and has disadvantage on Wisdom (Perception) checks to notice or recognize danger. A calmed creature that drinks the water again before 24 hours have passed has disadvantage on the saving throw. The greater restoration spell or similar magic ends the calming effect early."
    }
  ],
  "spell_list": [],
  "page_no": 273,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_oasis-keeper/"
}