{
  "slug": "otterfolk",
  "desc": "Brown fur covers the entire surface of this humanoid, which also has the black nose and small ears of an otter. Its piecemeal leather armor and weapon at the ready give the impression it is prepared for a fight._  \n**Foe to Reptilians.** While generally peaceful creatures, otterfolk bear an enmity for reptilians, owing to their near extinction in the jaws of giant alligators and other large swamp predators. They are wary of intelligent reptilian creatures, such as lizardfolk and naga, who regularly prey on their people. Otterfolk pass this animosity on to future generations through tales of heroic otterfolk overcoming ferocious snakes and mighty alligators. From the time an otterfolk kit can walk, it learns how to wield the atlatl and to be mindful of the presence of their hated foes. Otterfolk are wary of reptilian visitors or those accompanied by reptiles, but they are cordial to all others.  \n**Swamp Guides.** Otterfolk are excellent sources of information about the territory surrounding their homes, and they often escort friendly visitors through the swamp. The price for this service depends on the combat capabilities of those they escort. Their overwhelming martial outlook causes them to value visitors who can prove themselves in combat. If a group seems capable of protecting itself, the otterfolk reason they don’t have to defend the group in addition to guiding it. They often ask such groups for a pittance in rations or monetary value (preferring pearls to other valuable items). Otterfolk greatly increase their fees for groups apparently incapable of fighting off potential swamp hazards. However, they pride themselves on never abandoning their charges.  \n**Otter Trainers.** Otterfolk often raise river otters as guard animals and pets, which serve the same function in their society as dogs in human societies. Otterfolk regard the animals warmly and become sad when favored pets die. They rarely allow their otters to engage in combat. They regularly hold contests where otter owners show off their training prowess by directing their otters in feats of strength, cunning, and dexterity. These contests never involve pitting the otters against each other in combat. The rare few otterfolk who choose to become wizards take otters as familiars. Otterfolk rangers often raise larger river otter specimens (use the statistics of a Open Game License",
  "name": "Otterfolk",
  "size": "Small",
  "type": "Humanoid",
  "subtype": "otterfolk",
  "group": null,
  "alignment": "Chaotic Good",
  "armor_class": 14,
  "armor_desc": "leather armor",
  "hit_points": 18,
  "hit_dice": "4d6+4",
  "speed": {
    "swim": 30,
    "walk": 25,
    "climb": 15
  },
  "strength": 12,
  "dexterity": 17,
  "constitution": 12,
  "intelligence": 10,
  "wisdom": 14,
  "charisma": 11,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 5,
    "survival": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 30 ft., passive Perception 12",
  "languages": "Common",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Dagger",
      "desc": "Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d4+3"
    },
    {
      "name": "Atlatl Dart",
      "desc": "Ranged Weapon Attack: +5 to hit, range 20/60 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Secrete Oil (Recharge 4-6)",
      "desc": "The otterfolk secretes an oil that makes it slippery until the end of its next turn. It has advantage on ability checks and saving throws made to escape a grapple. If it is grappled when it takes this action, it can take a bonus action to escape the grapple."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Hold Breath",
      "desc": "The otterfolk can hold its breath for 15 minutes."
    },
    {
      "name": "Pack Tactics",
      "desc": "The otterfolk has advantage on attack rolls against a creature if at least one of the otterfolk's allies is within 5 feet of the creature and the ally isn't incapacitated."
    },
    {
      "name": "Reptile Foe",
      "desc": "The otterfolk has advantage on Wisdom (Survival) checks to track reptilian creatures and on Intelligence checks to recall information about them."
    }
  ],
  "spell_list": [],
  "page_no": 288,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_otterfolk/"
}