{
  "slug": "pombero",
  "desc": "_This squat little man has long limbs and skin the color of coal, and the backs of its hands and tops of its feet are covered in thick hair. Its face seems a bit too wide for its head, and its eyes gleam a little too brightly in the pale light._  \nPomberos are strange tricksters, born of shadows in the wild. At rest, they tend to adopt a squatting posture, which accentuates their too-long limbs. They shun bright light, though it doesn’t harm them, and seek out shadows and half-light. For this reason, they are known as the Night People.  \n**Joy of Trespassing.** Pomberos take delight from creeping into places where they don’t belong and stealing interesting objects. A pombero’s lair is littered with trinkets, both commonplace and valuable. The blame for all manner of misfortune is laid at the pombero’s hairy feet.  \n**Hatred of Hunters.** In contrast to their larcenous ways, pomberos take great umbrage over the killing of animals and the destruction of trees in their forests. Birds are particularly beloved pets, and they enjoy mimicking bird songs and calls most of all. Villagers in areas near pombero territory must be careful to treat the animals and trees with respect, and killing birds usually is a strong taboo in such areas.",
  "name": "Pombero",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 90,
  "hit_dice": "12d8+36",
  "speed": {
    "walk": 30
  },
  "strength": 17,
  "dexterity": 16,
  "constitution": 16,
  "intelligence": 8,
  "wisdom": 10,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 5,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Sylvan",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The pombero uses Charming Touch if able, and makes two fist attacks."
    },
    {
      "name": "Fist",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage and the target is grappled (escape DC 13).",
      "attack_bonus": 5,
      "damage_dice": "2d6"
    },
    {
      "name": "Charming Touch (recharge 5-6)",
      "desc": "The pombero chooses a creature it can see within 5 feet. The creature must make a successful DC 12 Wisdom saving throw or be charmed for 10 minutes. The effect ends if the charmed creature takes damage. The pombero can have only one creature at a time charmed with this ability. If it charms a new creature, the previous charm effect ends immediately."
    },
    {
      "name": "Invisibility",
      "desc": "The pombero becomes invisible until it chooses to end the effect as a bonus action, or when it attacks."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Beast's Voice",
      "desc": "The pombero can magically speak with any beast and can perfectly mimic beast sounds."
    },
    {
      "name": "Twisted Limbs",
      "desc": "The pombero can twist and squeeze itself through a space small enough for a Tiny bird to pass through as if it were difficult terrain."
    },
    {
      "name": "Sneak Attack (1/turn)",
      "desc": "The pombero does an extra 7 (2d6) damage with a weapon attack when it has advantage on the attack roll, or when the target is within 5 feet of an ally of the pombero that isn't incapacitated and the pombero doesn't have disadvantage on the roll."
    },
    {
      "name": "Soft Step",
      "desc": "The pombero has advantage on Dexterity (Stealth) checks in forest terrain."
    }
  ],
  "spell_list": [],
  "page_no": 313,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_pombero/"
}