{
  "slug": "righteous-sentinel",
  "desc": "Fierce determination emanates from the defensive stance the creature takes as torchlight dances off of its silvered body. It holds up its reflective shield, a disc-like extension of its metallic forearm._  \nTreasure hunters that pursue fiendish weapons of myth or enter temples to vicious entities may find themselves face-to-face with a righteous sentinel, eager to repel them.  \n**Keepers of Horror.** Good-aligned gods of peace have many methods for ensuring that defeated evils do not resurface in the future, and the righteous sentinel is one of their most effective. The constructs are placed as guards where great evil is housed to prevent anyone from accessing and awakening that which lies within.  \n**Abhors Violence.** Righteous sentinels seek to avoid violence as much as possible, but they react with unbridled rage when their ward is disturbed. When intruders disturb the objects of great evil the sentinels are protecting, the sentinel turns its reflective shield toward an intruder. The shield reflects a vision of that creature’s soul back toward it, which is often enough to horrify even the most evil of monsters.  \n**Construct Nature.** The righteous sentinel does not require air, food, drink, or sleep.",
  "name": "Righteous Sentinel",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Good",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 104,
  "hit_dice": "11d10+44",
  "speed": {
    "walk": 30
  },
  "strength": 21,
  "dexterity": 10,
  "constitution": 18,
  "intelligence": 8,
  "wisdom": 11,
  "charisma": 3,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 6,
  "skills": {
    "perception": 6
  },
  "damage_vulnerabilities": "thunder",
  "damage_resistances": "",
  "damage_immunities": "poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned, unconscious",
  "senses": "darkvision 120 ft., passive Perception 16",
  "languages": "Celestial, Common",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The righteous sentinel makes two slam attacks."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft, one target. Hit: 16 (2d10 + 5) bludgeoning damage.",
      "attack_bonus": 9,
      "damage_dice": "2d10+5"
    },
    {
      "name": "Warp Reflection (Recharge 6)",
      "desc": "The righteous sentinel points its shield at a creature within 30 feet of it. If the target can see the sentinel's shield, the target must make a DC 15 Wisdom saving throw. On a failure, the target takes 22 (4d10) psychic damage and is frightened for 1 minute. On a success, the target takes half the damage and isn't frightened. An evil-aligned target has disadvantage on this saving throw. At the start of each of the frightened creature's turns, it takes 11 (2d10) psychic damage. It can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Reflective Retribution",
      "desc": "The sentinel adds 3 to its AC against one melee attack that would hit it. To do so, the sentinel must see the attacker. If the attack misses, the attacker takes 11 (2d10) psychic damage."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The sentinel is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The sentinel has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The sentinel's weapon attacks are magical."
    },
    {
      "name": "Reflective Aggression",
      "desc": "The sentinel has disadvantage on attack rolls against creatures that haven't hit it within the last minute. In addition, it has advantage on attack rolls against a creature if the creature dealt damage to it in the previous round."
    },
    {
      "name": "Spell-Deflecting Mirror",
      "desc": "Any time the sentinel is targeted by a ranged spell attack roll, roll a d6. On a 5, the sentinel is unaffected. On a 6, the sentinel is unaffected and the spell is reflected back at the caster as though it originated from the sentinel, turning the caster into the target."
    }
  ],
  "spell_list": [],
  "page_no": 307,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_righteous-sentinel/"
}