{
  "slug": "shroud",
  "desc": "_Shrouds appear much like they did in life, only translucent and immaterial. Their voices are weak._  \n**Bitter Spirits.** Shrouds are transitional creatures: remnants of wicked people who died but refuse to rest in peace, yet have not grown strong enough to become shadows. They are aggressive enemies of all living creatures and the light that nurtures life. Shrouds blend naturally into darkness, but they stand out starkly in bright light.  \n**Thin Outlines.** Shrouds look like flickering shadowy outlines of the people they were before they died, retaining the same height and body type.  \n**Repetitive Speech.** Shrouds cannot converse, but they occasionally can be heard cruelly whispering a name, term, or phrase over and over again: something that must have had meaning to them in life.  \n**Undead Nature.** A shroud doesn’t require air, food, drink, or sleep.",
  "name": "Shroud",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 9,
  "hit_dice": "2d8",
  "speed": {
    "hover": true,
    "walk": 0,
    "fly": 30
  },
  "strength": 4,
  "dexterity": 13,
  "constitution": 10,
  "intelligence": 2,
  "wisdom": 10,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 3
  },
  "damage_vulnerabilities": "radiant",
  "damage_resistances": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Common",
  "challenge_rating": "1/8",
  "cr": 0.125,
  "actions": [
    {
      "name": "Strength Drain",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one creature. Hit: 3 (1d4 + 1) necrotic damage, and the target's Strength score is reduced by one-half that amount. The target dies if this reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. If a non-evil humanoid dies from this attack, a new shadow rises from the corpse 1d4 hours later.",
      "attack_bonus": 3,
      "damage_dice": "1d4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The shroud can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Shadow Evolution",
      "desc": "Shrouds instantly become shadows once they cause a total of 12 damage. Any damage they've suffered is subtracted from the shadow's total hit points or abilities."
    },
    {
      "name": "Shroud Stealth",
      "desc": "When in dim light or darkness, the shroud can take the Hide action as a bonus action."
    },
    {
      "name": "Sunlight Weakness",
      "desc": "While in sunlight, the shroud has disadvantage on attack rolls, ability checks, and saving throws."
    }
  ],
  "spell_list": [],
  "page_no": 348,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_shroud/"
}