{
  "slug": "spectral-guardian",
  "desc": "_A luminous green mist swirls into the form of an ancient warrior. Dented armor and a ragged cloak enshroud the warrior’s skeletal body, and its grinning skull leers out from an open helm._  \n**Worn Finery.** Composed of faintly glowing green vapor, the spectral guardian is a skeletal being encased in ancient armor or noble’s finery. The cloth is worn and tattered, spiraling away into mist at the edges, and the creature glides with the faintest whisper of sound like a mournful moan from far away.  \n**Eternal Disgrace.** The spectral guardian is the spirit of an ancient warrior or noble, bound to serve in death as it failed to do in life. A broken oath, an act of cowardice, or a curse laid down by the gods for a terrible betrayal leaves an indelible mark on a soul.  \nAfter the cursed creature’s death, its spirit rises, unquiet, in a place closely related to its disgrace. Compelled by the crushing weight of its deeds, the spectral guardian knows no rest or peace, and viciously snuffs out all life that intrudes upon its haunt.  \n**Undead Nature.** A spectral guardian doesn’t require air, food, drink, or sleep.",
  "name": "Spectral Guardian",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "",
  "hit_points": 110,
  "hit_dice": "13d8+52",
  "speed": {
    "hover": true,
    "walk": 0,
    "fly": 60
  },
  "strength": 6,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 11,
  "wisdom": 16,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "cold, necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained",
  "senses": "blindsight 10 ft., darkvision 60 ft., passive Perception 13",
  "languages": "understands the languages it knew in life but can't speak",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The spectral guardian makes two spectral rend attacks."
    },
    {
      "name": "Spectral Rend",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) necrotic damage. If the target is a creature, it must succeed on a DC 14 Wisdom saving throw or be frightened and have its speed reduced to 0; both effects last until the end of its next turn.",
      "attack_bonus": 7,
      "damage_dice": "2d8"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Incorporeal Movement",
      "desc": "The spectral guardian can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    },
    {
      "name": "Tomb Bound",
      "desc": "The spectral guardian is bound to the area it defends. It can't move more than 100 feet from the place it is bound to protect."
    },
    {
      "name": "Withering Miasma",
      "desc": "A creature that starts its turn in the spectral guardian's space must make a successful DC 15 Constitution saving throw or take 18 (4d8) necrotic damage and its hit point maximum is reduced by an amount equal to the necrotic damage taken. This reduction lasts until the creature finishes a long rest."
    },
    {
      "name": "Variant: Arcane Guardian",
      "desc": "some spectral guardians were not warriors in life, but powerful magic users. An arcane guardian has a challenge rating of 8 (3,900 XP) and the following added trait: Spellcasting. The arcane guardian is a 9th level spellcaster. Its spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). The guardian knows the following sorcerer spells, which do not require material components:\n\ncantrips (at will): acid splash, chill touch, dancing lights,minor illusion, ray of frost\n\n1st level (4 slots): mage armor, ray of sickness\n\n2nd level (3 slots): darkness, scorching ray\n\n3rd level (3 slots): fear, slow, stinking cloud\n\n4th level (3 slots): blight, ice storm\n\n5th level (1 slot): cone of cold"
    }
  ],
  "spell_list": [],
  "page_no": 358,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_spectral-guardian/"
}