{
  "slug": "stuhac",
  "desc": "_This pale-skinned, white-bearded hermit wears a winter cloak and travels the mountain paths, cliff sides, and trade routes alone._  \n**Feigns Weakness.** Living in isolated mountain passes and foraging along little-traveled slopes, the stuhac is a master of stealth and deception. Wrapping heavy furs around itself, it poses as a feeble hermit or traveler needing assistance. Only after its victims have been lured away from warmth and safety does the stuhac drop its disguise and show its true nature: the withered traveler's gnarled hands uncurl to reveal jagged yellow claws, its cataract-ridden eyes are exposed as waxen orbs wobbling loosely in their sockets; throwing open its cloak, it proudly shows off woven layers of yellowed tendon and ligament.  \n**Hideous Garments.** The stuhac’s most prized possessions are its “clutters,” garments woven of layered and tangled ligaments and tendons. These grisly trophies are taken from scores of victims, and stuhacs treasure each bit of their disgusting attire. When two stuhac meet, they compare their garb, swapping anecdotes of their most horrifying kills and deceptions.  \nStuhacs weave new ligaments into their clutters while their still-living victims watch. Lying in crippled agony, they cannot flee as the stuhac tears fresh material from their bodies for its garments. To keep screams from disturbing their work, these monsters sever their victim’s vocal chords.  \n**Devour Victims.** Once its clutters are done, the stuhac feeds on its live victim, devouring everything but the bones. Finding a clean-picked humanoid skeleton along a mountain path is a reliable sign of a stuhac’s presence.  \nBecause female stuhacs have never been reported, some believe that these fiends mate with demons, hags, or lamias. Others believe stuhacs are part of a hideous malediction, a recipe for immortality that requires the subject to devour its own kind.",
  "name": "Stuhac",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 190,
  "hit_dice": "20d8+100",
  "speed": {
    "walk": 40,
    "climb": 40
  },
  "strength": 22,
  "dexterity": 18,
  "constitution": 20,
  "intelligence": 12,
  "wisdom": 16,
  "charisma": 15,
  "strength_save": 11,
  "dexterity_save": 9,
  "constitution_save": 10,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 7,
  "perception": null,
  "skills": {
    "deception": 12
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, fire; bludgeoning and piercing from nonmagical attacks",
  "damage_immunities": "cold, poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "Common, Infernal; telepathy 100 ft.",
  "challenge_rating": "13",
  "cr": 13,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The stuhac makes two claw attacks and one bite attack, or two claw attacks and one hobble."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 20 (4d6 + 6) piercing damage.",
      "attack_bonus": 11,
      "damage_dice": "4d6"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 29 (5d8 + 6) slashing damage.",
      "attack_bonus": 11,
      "damage_dice": "5d8"
    },
    {
      "name": "Hobble",
      "desc": "A stuhac can cripple a creature by telekinetically tearing its tendons and ligaments. A stuhac can target one creature within 100 feet. The target must make a successful DC 16 Constitution saving throw or take 13 (3d8) force damage and its speed is reduced by 20 feet. Magical movement (flight, teleportation, etc.) is unaffected. This damage can only be cured through magical healing, not by spending hit dice or resting."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Mountain Stride",
      "desc": "Mountain slopes and stone outcroppings pose no obstacle to a stuhac's movement. In mountainous areas, it scrambles through difficult terrain without hindrance."
    },
    {
      "name": "Powerful Leap",
      "desc": "The stuhac can jump three times the normal distance: 66 feet horizontally or 27 feet vertically with a running start, or half those distances from a stationary start."
    },
    {
      "name": "Shapechanger",
      "desc": "The stuhac can use its action to polymorph into one of two forms: that of an elderly humanoid male, and its natural form. It cannot alter either form's appearance or capabilities using this ability, and damage sustained in one form transfers to the other form."
    }
  ],
  "spell_list": [],
  "page_no": 370,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_stuhac/"
}