{
  "slug": "uridimmu",
  "desc": "This tall, muscular humanoid has bronze skin and the wings of a hawk. Its head is that of a majestic hunting hound with the teeth and reddish-gold mane of a lion, and it holds a flaming mace in its hands._  \n**Bastard Sons of Chaos.** The first uridimmus were the illegitimate offspring of a demon lord and an unknown entity of chaos and were soundly defeated by a powerful deity of law. After their defeat, the uridimmus chose to serve the god as guardians of the heavenly realm. The tainted origin of uridimmus manifests in the chaotic mass of fire, lightning, and radiance that clings to the heads of their maces.  \n**Tainted Servants of Law.** Uridimmus are tireless guardians, and most are tasked with guarding the portals into the lawful planes. Some also serve the deities directly as bodyguards or lead groups of lesser celestials in battle. While uridimmus are unwavering and steadfast guardians, they are also completely merciless in combat and not above making examples out of trespassers. This tendency sometimes causes friction between the urdimmu and other angels, like Open Game License",
  "name": "Uridimmu",
  "size": "Large",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Good",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 150,
  "hit_dice": "12d10+84",
  "speed": {
    "walk": 30,
    "fly": 90
  },
  "strength": 22,
  "dexterity": 17,
  "constitution": 24,
  "intelligence": 14,
  "wisdom": 18,
  "charisma": 21,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 12,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 10,
  "perception": 9,
  "skills": {
    "insight": 14,
    "perception": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "fire, lightning, radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "charmed, exhaustion, frightened",
  "senses": "truesight 90 ft., passive Perception 19",
  "languages": "all, telepathy 60 ft.",
  "challenge_rating": "14",
  "cr": 14,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The uridimmu makes three attacks: one with its bite and two with its mace."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) piercing damage.",
      "attack_bonus": 11,
      "damage_dice": "3d8+6"
    },
    {
      "name": "Mace",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) bludgeoning damage plus 18 (4d8) fire, lightning, or radiant damage.",
      "attack_bonus": 11,
      "damage_dice": "2d6+6"
    },
    {
      "name": "Heavenly Roar (Recharge 5-6)",
      "desc": "The uridimmu can unleash a powerful roar imbued with divine power in a 30-foot cone. A target caught within this cone must make a DC 18 Constitution saving throw, taking 45 (10d8) thunder damage on a failed save, or half as much damage on a successful one. If the saving throw fails by 5 or more, the target is also frightened for 1 minute. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Fiends have disadvantage on this saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Chaos Mace",
      "desc": "The uridimmu's attacks with its mace are magical. When the uridimmu hits with its mace, the mace deals an extra 4d8 fire, lightning, or radiant damage (included in the attack). The uridimmu chooses the type of damage when making the attack."
    },
    {
      "name": "Heroic Aura",
      "desc": "Each friendly creature within 20 feet of the uridimmu can't be charmed or frightened. In addition, when a friendly creature within 20 feet of the uridimmu makes an attack roll or a saving throw, it can roll a d4 and add the result to the attack roll or saving throw. The uridimmu's aura doesn't work in the area of an antimagic field spell or while in a temple, shrine, or other structure dedicated to a chaotic deity."
    },
    {
      "name": "Magic Resistance",
      "desc": "The uridimmu has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The uridimmu's spellcasting ability is Charisma (spell save DC 18). The uridimmu can innately cast the following spells, requiring no material components:\nAt will: detect evil and good, light, protection from evil and good\n3/day each: dispel magic, glyph of warding, lightning bolt\n1/day each: flame strike, heal, wall of fire"
    }
  ],
  "spell_list": [],
  "page_no": 19,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_uridimmu/"
}