{
  "slug": "ushabtiroyalguard-tob1-2023",
  "desc": "False",
  "name": "Ushabti Royal Guard",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": "null",
  "alignment": "Unaligned",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 168,
  "hit_dice": "16d10 + 80",
  "speed": {
    "walk": 30
  },
  "strength": 22,
  "dexterity": 16,
  "constitution": 20,
  "intelligence": 11,
  "wisdom": 19,
  "charisma": 9,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 4,
  "perception": 19,
  "skills": {
    "Arcana": 5,
    "History": 5,
    "Perception": 9
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 19",
  "languages": "understands the languages of its creator but can’t speak",
  "challenge_rating": "14",
  "cr": 14,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The ushabti can use its Breath-Stealing Presence. It then makes two Khopesh attacks and one Medjai's Scepter attack."
    },
    {
      "name": "Khopesh",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage plus 9 (2d8) necrotic damage."
    },
    {
      "name": "Medjai's Scepter",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage plus 9 (2d8) necrotic damage."
    },
    {
      "name": "Breath-Stealing Presence",
      "desc": "Each creature of the ushabti's choice within 30 feet of the ushabti and aware of it must succeed on a DC 18 Constitution saving throw or take 9 (2d8) necrotic damage and be unable to speak or breathe for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the ushabti's Breath-Stealing Presence for the next 24 hours."
    },
    {
      "name": "Enervating Surge (Recharge 5-6)",
      "desc": "The ushabti emits waves of necrotic energy. Each creature within 30 feet of the ushabti must make a DC 18 Constitution saving throw, taking 49 (11d8) necrotic damage on a failed save, or half as much damage on a successful one. A creature that can't breathe because of the ushabti's Breath-Stealing Presence has disadvantage on the saving throw. If the saving throw fails by 5 or more, the creature also suffers one level of exhaustion. A Humanoid slain by this effect rises 1d4 hours later as a mummy under the ushabti's control, unless the Humanoid is restored to life or its body is destroyed. The ushabti can have no more than five mummies under its control at one time."
    }
  ],
  "bonus_actions": [],
  "reactions": [
    {
      "name": "Sudden Strike",
      "desc": "When a creature more than 5 feet away from the ushabti moves to a space within 5 feet of the ushabti, the ushabti can make one Khopesh attack against it."
    }
  ],
  "legendary_desc": "The ushabti can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The ushabti regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Move",
      "desc": "The ushabti moves up to its speed without provoking opportunity attacks."
    },
    {
      "name": "Medjai's Scepter (Costs 2 Actions)",
      "desc": "The ushabti makes one Medjai's Scepter attack."
    },
    {
      "name": "Telekinesis (Costs 2 Actions)",
      "desc": "Up to two creatures the ushabti can see within 60 feet of it must succeed on a DC 18 Strength saving throw or the ushabti moves the creature up to 30 feet in any direction (including upward). A moved target is then restrained until the start of the ushabti's next turn."
    }
  ],
  "special_abilities": [
    {
      "name": "Construct Nature",
      "desc": "The ushabti doesn't require air, food, drink, or sleep."
    },
    {
      "name": "False Appearance",
      "desc": "While the ushabti is motionless, it is indistinguishable from a normal funerary statue."
    },
    {
      "name": "Healing Leech",
      "desc": "If a creature within 30 feet of the ushabti regains hp from a spell or magical effect, the creature regains only half the amount and the ushabti regains the other half."
    },
    {
      "name": "Immutable Form",
      "desc": "The ushabti is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the ushabti fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magic Resistance",
      "desc": "The ushabti has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Necrotic Weapons",
      "desc": "The ushabti's weapon attacks are magical. When the ushabti hits with any weapon, the weapon deals an extra 2d8 necrotic damage (included in the attack)."
    }
  ],
  "spell_list": [],
  "page_no": 377,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_ushabti-royal-guard/"
}