{
  "slug": "witchlight",
  "desc": "_This tiny ball of bright light seems to emanate from a crystalline center._  \n**Wizard Servants.** Also called a “spooklight,” a witchlight is a wizard’s servant created from a tiny piece of quartz. It appears as a floating ball of flickering light similar to a will-o’-wisp. The hue of quartz used during the creature’s creation determines the color of each witchlight’s illumination. After the quartz is prepared, it is animated through an extended magical ritual cast under a full moon and a clear, starry sky. Consequently, they are extremely rare by any measure.  \n**Flashing Light Code.** A witchlight always shares the same alignment as its creator. Although it cannot speak, a witchlight understands Common or another language taught it by its creator. Many spellcasters have taught their witchlights a coded cipher, so it can spell out words by flaring and dimming its light. When necessary, a witchlight can spell words in the air by flying so quickly that its trail of light forms letters. This stunt requires a successful DC 14 Dexterity (Acrobatics) check per word.  \n**Free Roaming.** If the witchlight’s master dies within one mile of the witchlight, it explodes in a brilliant but harmless flash of light. If it loses its master under any other circumstance, it becomes masterless; it’s free to do as it pleases, and it can never serve anyone else as a familiar. The statistics below represent these independent witchlights.  \nEvil witchlights can be surprisingly cruel, not unlike will-o’wisps. They seek to lure lost travelers into swamps or traps by using their glow to imitate the light of a safe haven. Conversely, good-aligned witchlights guide travelers to places of safety or along safe paths, and they are prized by pilots and guides. Neutral witchlights exhibit a playful nature—sometimes mingling inside the cavities of weapons, gems, or other curiosities, which means those items may be mistaken for magic items. More than one “wizard’s staff ” is just an impressivelooking stick with a witchlight perched on top.  \n**Constructed Nature.** A witchlight doesn’t require air, food, drink, or sleep.",
  "name": "Witchlight",
  "size": "Tiny",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": "",
  "hit_points": 10,
  "hit_dice": "4d4",
  "speed": {
    "fly": 50
  },
  "strength": 1,
  "dexterity": 18,
  "constitution": 10,
  "intelligence": 10,
  "wisdom": 13,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison, radiant",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "understands the language of its creator but can't speak",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Light Ray",
      "desc": "Ranged Weapon Attack: +6 to hit, range 30 ft., one target. Hit: 6 (1d4 + 4) radiant damage.",
      "attack_bonus": 6,
      "damage_dice": "1d4"
    },
    {
      "name": "Flash (Recharge 5-6)",
      "desc": "The witchlight emits a bright burst of light that blinds all sighted creatures within 30 feet for 1d4 rounds unless they succeed on a DC 10 Constitution saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Dispel Magic Weakness",
      "desc": "Casting dispel magic on a witchlight paralyzes it for 1d10 rounds."
    },
    {
      "name": "Luminance",
      "desc": "A witchlight normally glows as brightly as a torch. The creature can dim itself to the luminosity of a candle, but it cannot extinguish its light. Because of its glow, the witchlight has disadvantage on Dexterity (Stealth) checks."
    },
    {
      "name": "Thin As Light",
      "desc": "While a witchlight is not incorporeal, it can pass through any opening that light can."
    }
  ],
  "spell_list": [],
  "page_no": 409,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_witchlight/"
}