{
  "slug": "young-void-dragon",
  "desc": "_A dragon seemingly formed of the night sky has bright white stars for eyes. Lesser stars twinkle in the firmament of the dragon’s body._  \n**Children of the Stars.** Void dragons drift through the empty spaces beyond the boundaries of the mortal world, wanderers between the stars. They are aloof, mingling only with the otherworldly beings that live above and beyond the earth, including the incarnate forms of the stars themselves. When lesser creatures visit void dragons, the dragons themselves barely notice.  \n**Witnesses to the Void.** Void dragons are intensely knowledgeable creatures, but they have seen too much, lingering at the edge of the void itself. Gazing into the yawning nothing outside has taken a toll. The void dragons carry a piece of that nothing with them, and it slowly devours their being. They are all unhinged, and their madness is contagious. It flows out of them to break the minds of lesser beings when the dragons fly into a rage and lash out.  \n**Voracious Scholars.** Despite their removed existence and strange quirks, void dragons still hoard treasure. Gems that glitter like the stars of their home are particularly prized. Their crowning piece, however, is knowledge. Void dragons jealously hoard scraps of forbidden and forgotten lore of any kind and spend most of their time at home poring over these treasures. Woe to any who disturbs this collection, for nothing ignites their latent madness like a violation of their hoard.  \n\n## A Void Dragon’s Lair\n\n  \nThe true lair of a void dragon exists deep in the freezing, airless void between stars. Hidden away in caves on silently drifting asteroids or shimmering atop the ruins of a Star Citadel, the void dragon’s lair rests in the great void of space.  \nWhen a void dragon claims a home elsewhere, it forges a connection to its true lair. It prefers towering mountain peaks, valleys, or ruins at high elevation with a clear view of the sky. It can reach through space from this lair to reach its treasure hoard hidden in the void. That connection has repercussions, of course, and the most powerful void dragons leave their mark on the world around them when they roost. Intrusions from beyond and a thirst for proscribed knowledge are common near their lairs.  \nIf fought in its lair, its Challenge increases by 1, to 15 for an adult (13,000 XP) and 25 for an ancient void dragon (75,000 XP).  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action to generate one of the following effects; the dragon can’t use the same effect two rounds in a row:\n* The dragon negates natural gravity within its lair (an area affected by its gravitic breath is unaffected). Creatures drift 10 feet away from the ground over the course of a round and are restrained. Flying creatures can move at half speed, unless they have the (hover) tag or use magical flight, in which case they move normally. This effect persists until initiative count 20 on the following round.\n* The Void briefly overlaps the dragon’s lair in a 20-foot-radius sphere of blackness punctuated by deep blue streaks and pinpoints of light. The sphere is centered on a point the dragon can see within 120 feet of the dragon. The area spreads around corners, is heavily obscured, and contains no air (creatures must hold their breath). Each creature in the sphere when it appears must make a DC 15 Constitution saving throw, taking 10 (3d6) cold damage on a failed save or half as much on a successful one. Any creature that ends its turn in the sphere takes 10 (3d6) cold damage. The sphere lasts until the dragon uses this lair action again or until the dragon dies.\n* The dragon rips the fabric of space, forcing two creatures it can see within 120 feet of it to suddenly exist in the same place. Space itself repels the creatures to their original positions. Each creature takes 16 (3d10) force damage and is knocked prone, or takes half as much damage and is not knocked prone with a successful DC 15 Strength saving throw.\n  \n### Regional Effects\n\n  \nThe region containing a legendary void dragon’s lair is warped by the dragon’s magic, which creates one or more of the following effects:\n* Secrets have a way of coming to light within 6 miles of the lair. Clues are inadvertently discovered, slips of the tongue hint at a hidden truth, and creatures become morbidly curious for forbidden knowledge.\n* Light is muted within 6 miles of the lair. Nonmagical illumination, including sunlight, can’t create bright light in this area.\n* Visitations from otherworldly beings occur and disembodied voices whisper in the night within 6 miles of the dragon’s lair. Celestials, fey, and fiends of CR 2 or lower can slip into the world in this area.\n  \nIf the dragon dies, these effects fade over the course of 1d10 days.",
  "name": "Young Void Dragon",
  "size": "Large",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 157,
  "hit_dice": "15d10+75",
  "speed": {
    "hover": true,
    "walk": 40,
    "fly": 80
  },
  "strength": 20,
  "dexterity": 10,
  "constitution": 21,
  "intelligence": 14,
  "wisdom": 11,
  "charisma": 19,
  "strength_save": null,
  "dexterity_save": 4,
  "constitution_save": 9,
  "intelligence_save": null,
  "wisdom_save": 4,
  "charisma_save": 8,
  "perception": 8,
  "skills": {
    "arcana": 10,
    "history": 10,
    "perception": 8,
    "persuasion": 8,
    "stealth": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "cold",
  "condition_immunities": "charmed, frightened",
  "senses": "blindsight 30ft, darkvision 120ft, passive Perception 18",
  "languages": "Common, Draconic, Void Speech",
  "challenge_rating": "9",
  "cr": 9,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 16 (2d10 + 5) piercing damage plus 3 (1d6) cold damage.",
      "attack_bonus": 9,
      "damage_dice": "2d10"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage.",
      "attack_bonus": 9,
      "damage_dice": "2d6"
    },
    {
      "name": "Breath Weapons (Recharge 5-6)",
      "desc": "The dragon uses one of the following breath weapons:"
    },
    {
      "name": "Gravitic Breath",
      "desc": "The dragon exhales a 30-foot cube of powerful localized gravity, originating from the dragon."
    },
    {
      "name": "Falling damage in the area increases to 1d10 per 10 feet fallen",
      "desc": "When a creature starts its turn within the area or enters it for the first time in a turn, including when the dragon creates the field, it must make a DC 17 Dexterity saving throw. On a failure the creature is restrained. On a success the creature's speed is halved as long as it remains in the field. A restrained creature repeats the saving throw at the end of its turn. The field persists until the dragon's breath recharges, and it can't use gravitic breath twice consecutively."
    },
    {
      "name": "Stellar Flare Breath",
      "desc": "The dragon exhales star fire in a 30- foot cone. Each creature in that area must make a DC 17 Dexterity saving throw, taking 28 (8d6) fire damage and 28 (8d6) radiant damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Void Twist",
      "desc": "When the dragon is hit by a ranged attack it can create a small rift in space to increase its AC by 4 against that attack. If the attack misses because of this increase the dragon can choose a creature within 30 feet to become the new target for that attack. Use the original attack roll to determine if the attack hits the new target."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Chill of the Void",
      "desc": "Cold damage dealt by the void dragon ignores resistance to cold damage, but not cold immunity."
    },
    {
      "name": "Void Dweller",
      "desc": "As ancient void dragon."
    }
  ],
  "spell_list": [],
  "page_no": 140,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_young-void-dragon/"
}