{
  "slug": "abbanith-giant",
  "desc": "This giant has a bulky, muscular body and small eyes in its broad, flat face. The giant’s thumbs end in large, black claws._  \n**Ancient Giants of the Deep.** Abbanith giants are among the oldest races of giants known to exist and are said to have been around since the world was first formed. Many scholars turn to the giants’ deep connection with the earth as evidence of this fact, and the giants themselves make no efforts to deny it. Indeed, the oral tradition of the abbanith giants dates back millennia, to a time when gods walked the land, elves were first learning the secrets of magic, and humans were still living in caves. Most abbanith giants wear simple tunics or shorts woven of a strange subterranean fungus, though leaders occasionally wear armor.  \n**Consummate Diggers.** Abbanith giants dwell almost exclusively underground and are adept at using their incredibly hard thumb claws to dig massive tunnels through the earth. Druids and wizards studying the giants’ unique biology have deduced that mineral-based materials actually soften when struck by their claws. This feature has also made them the target of derro and duergar slavers wishing to use their skills to mine precious gems or build their fortifications, something the giants violently oppose despite their normally peaceable nature.  \n**Allies of the Earth.** For as long as either race can remember, abbanith giants have been allies of the Open Game License",
  "name": "Abbanith Giant",
  "size": "Large",
  "type": "Giant",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 76,
  "hit_dice": "9d10+27",
  "speed": {
    "burrow": 30,
    "walk": 40
  },
  "strength": 20,
  "dexterity": 9,
  "constitution": 17,
  "intelligence": 10,
  "wisdom": 13,
  "charisma": 11,
  "strength_save": 7,
  "dexterity_save": null,
  "constitution_save": 5,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "tremorsense 120 ft., passive Perception 11",
  "languages": "Giant, Terran",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The abbanith giant makes two thumb claw attacks."
    },
    {
      "name": "Thumb Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+5"
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Earth Counter (Recharge 6)",
      "desc": "When a creature the abbanith can see within 30 feet of it casts a spell, the abbanith counters it. This reaction works like the counterspell spell, except the abbanith can only counter spells that directly affect or create earth or stone, such as stone shape, wall of stone, or move earth, and it doesn't need to make a spellcasting ability check, regardless of the spell's level."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "One with the Earth",
      "desc": "The abbanith giant can detect the flows and rhythms of the earth—including things that interfere with these rhythms, such as earthquakes and magical anomalies. As a result, the abbanith giant can't be surprised by an opponent that is touching the ground. In addition, the giant has advantage on attack rolls against constructs and elementals made of earth or stone."
    },
    {
      "name": "Siege Monster",
      "desc": "The giant deals double damage to objects and structures and triple damage to objects and structures made of earth or stone."
    }
  ],
  "spell_list": [],
  "page_no": 170,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_abbanith-giant/"
}