{
  "slug": "ancientmithraldragon-tob1-2023",
  "desc": "False",
  "name": "Ancient Mithral Dragon",
  "size": "Gargantuan",
  "type": "Dragon",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral",
  "armor_class": 20,
  "armor_desc": "natural armor",
  "hit_points": 490,
  "hit_dice": "28d20 + 196",
  "speed": {
    "walk": 80,
    "fly": 40
  },
  "strength": 12,
  "dexterity": 26,
  "constitution": 25,
  "intelligence": 20,
  "wisdom": 21,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 15,
  "constitution_save": 14,
  "intelligence_save": null,
  "wisdom_save": 12,
  "charisma_save": 12,
  "perception": 29,
  "skills": {
    "History": 12,
    "Insight": 12,
    "Perception": 19,
    "Persuasion": 12,
    "Stealth": 15
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "slashing",
  "condition_immunities": "charmed",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 29",
  "languages": "all, telepathy 120 ft.",
  "challenge_rating": "22",
  "cr": 22,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage. Instead of dealing damage, the dragon can end one magical effect of its choice of 7th level or lower on the target."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +15 to hit, reach 10 ft., one target. Hit: 15 (2d6 +8) slashing damage, and if the target isn't a Construct or Undead, it must succeed on a DC 23 Constitution saving throw or lose 10 (3d6) hp at the start of each of its turns as a piece of metallic claw breaks off in the wound. Any creature can take an action to remove the claw with a successful DC 16 Wisdom (Medicine) check. The claw pops out of the wound if the target receives magical healing."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +15 to hit, reach 20 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 20 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Shard Breath (Recharge 5-6)",
      "desc": "The mithral dragon spits metallic shards in a 90-foot cone. Each creature in that area must succeed on a DC 22 Dexterity saving throw, taking 73 (21d6) slashing damage on a failed save, or half as much damage on a successful one. The area becomes difficult terrain for 1 minute, then the shards dissolve into wisps of silvery smoke. When a creature moves into or within the area, it takes 7 (2d6) slashing damage for every 5 feet it travels."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a Tail attack."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 23 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
    }
  ],
  "special_abilities": [
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magic Resistance",
      "desc": "The dragon has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Mithral Scales",
      "desc": "If the dragon succeeds on a saving throw by 5 or more against a spell that targets only it, the dragon is unaffected, and the spell is reflected back at the caster as though it originated from the dragon, turning the caster into the target."
    }
  ],
  "spell_list": [],
  "page_no": 120,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_ancient-mithral-dragon/"
}