{
  "slug": "ancient-boreal-dragon",
  "desc": "Covered in a mix of hard, blue-white scales and patches of silvery-blue fur, this dragon radiates a savage belligerence. Its amber eyes gleam with primal fury as it stretches its wings, sending a shower of burning sparks sizzling onto the ground._  \n**Paradoxical Predators.** Boreal dragons inhabit the arctic and alpine places of the world, from snow-capped conifer forests and frigid mountain peaks to flat, icy plains and polar seas. Unlike white or silver dragons, however, boreal dragons are not creatures of cold but rather of heat and flames. Their breath is filled with burning embers, and their preferred lairs contain some sort of natural heat source. While this contradiction has puzzled many scholars of draconic lore, boreal dragons are unconcerned about such trivial matters and are likely to devour any sage or wizard impertinent enough to question their choice of habitat.  \n**Dragons of Rage.** Boreal dragons are among the most straightforward of all true dragons, driven by simple necessities like hunting and mating. They hate most other dragons with a passion and war constantly with those that share their arctic homeland, driving off or killing any dragons they encounter. Boreal dragons are truculent creatures and love nothing better than getting into a fight; however, they do not target defenseless creatures or those far weaker than themselves unless they are hunting for food. Because they respect strength above all else, a creature can gain a boreal dragon’s admiration through acts of intense bravery or slaughter. In particular, the dragons are fond of large arctic predators, such as Open Game License",
  "name": "Ancient Boreal Dragon",
  "size": "Gargantuan",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 22,
  "armor_desc": "natural armor",
  "hit_points": 407,
  "hit_dice": "22d20+176",
  "speed": {
    "walk": 40,
    "fly": 80,
    "swim": 30
  },
  "strength": 29,
  "dexterity": 10,
  "constitution": 27,
  "intelligence": 17,
  "wisdom": 19,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": 15,
  "intelligence_save": null,
  "wisdom_save": 11,
  "charisma_save": 11,
  "perception": 18,
  "skills": {
    "athletics": 16,
    "perception": 18,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "fire",
  "condition_immunities": "",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 28",
  "languages": "Draconic, Giant",
  "challenge_rating": "24",
  "cr": 24,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +16 to hit, reach 15 ft., one target. Hit: 20 (2d10 + 9) piercing damage.",
      "attack_bonus": 16,
      "damage_dice": "2d10+9"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +16 to hit, reach 10 ft., one target. Hit: 16 (2d6 + 9) slashing damage.",
      "attack_bonus": 16,
      "damage_dice": "2d6+9"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +16 to hit, reach 20 ft., one target. Hit: 18 (2d8 + 9) bludgeoning damage.",
      "attack_bonus": 16,
      "damage_dice": "2d8+9"
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Cinder Breath (Recharge 5-6)",
      "desc": "The dragon exhales a 90-foot cone of superheated air filled with blue-white embers. Each creature in that area must make a DC 23 Dexterity saving throw, taking 88 (16d10) fire damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a tail attack."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 23 Dexterity saving throw or take 16 (2d6 + 9) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
    }
  ],
  "special_abilities": [
    {
      "name": "Ember Wreath (1/Day)",
      "desc": "As a bonus action, the boreal dragon wreathes its body in searing blue and white embers. The embers last for 1 minute or until the dragon uses its breath weapon. A creature that enters or starts its turn in a space within 30 feet of the dragon must make a DC 23 Constitution saving throw, taking 10 (3d6) fire damage on a failed save, or half as much damage on a successful one. If a creature fails the saving throw by 5 or more, it suffers one level of exhaustion as the water is sapped from its body by the unrelenting heat."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a saving throw, it can choose to succeed instead."
    }
  ],
  "spell_list": [],
  "page_no": 143,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_ancient-boreal-dragon/"
}