{
  "slug": "babayagashorsemen-tob1-2023",
  "desc": "False",
  "name": "Baba Yaga’s Horsemen",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": "null",
  "alignment": "Lawful Neutral",
  "armor_class": 20,
  "armor_desc": "plate, shield",
  "hit_points": 171,
  "hit_dice": "18d8 + 90",
  "speed": {
    "walk": 30
  },
  "strength": 22,
  "dexterity": 11,
  "constitution": 21,
  "intelligence": 16,
  "wisdom": 18,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": 4,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": null,
  "perception": 18,
  "skills": {
    "Arcana": 7,
    "Athletics": 10,
    "History": 7,
    "Perception": 8
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "lightning, poison",
  "condition_immunities": "exhaustion, paralyzed, poisoned",
  "senses": "passive Perception 18",
  "languages": "Celestial, Common, Infernal, telepathy 120 ft.",
  "challenge_rating": "11",
  "cr": 11,
  "actions": [
    {
      "name": "Lance",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 12 (1d12 + 6) piercing damage plus 9 (2d8) damage of the type defined in Enchanted Weapons. The horseman has disadvantage on this attack roll if the target is within 5 feet of him."
    },
    {
      "name": "Longsword",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) slashing damage, or 11 (1d10 + 6) slashing damage if used with two hands, plus 9 (2d8) damage of the type defined in Enchanted Weapons."
    },
    {
      "name": "Horseman's Bolt",
      "desc": "Ranged Spell Attack: +8 to hit, range 120 ft., one target. Hit: 22 (4d6 + 4) damage of the type defined in Enchanted Weapons."
    },
    {
      "name": "Spellcasting",
      "desc": "The horseman casts one of the following spells, requiring no material components and using Charisma as the spellcasting ability (spell save DC 16):\n3/day: phantom steed (as an action)\n2/day each: darkness (black night horseman only), daylight (bright day and red sun horsemen only), dimension door, fire shield\n1/day: plane shift (self and mount only)"
    }
  ],
  "bonus_actions": [
    {
      "name": "Temporal Strike (Recharge 5-6)",
      "desc": "One creature the horseman can see and that the horseman hit with a Horseman's Bolt or Longsword attack within the last minute must succeed on a DC 17 Constitution saving throw or age 16 (3d10) years. A creature that ages this way has disadvantage on attack rolls, ability checks, and saving throws that use Strength, Dexterity, and Constitution until the aging is reversed. A creature that ages beyond its lifespan dies immediately. The aging lasts until the creature finishes a long rest, or until it is reversed by a greater restoration spell or similar magic. On a successful saving throw, the creature is immune to the horseman's Temporal Strike for 24 hours."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Enchanted Weapons",
      "desc": "The horseman's weapon attacks are magical. When the horseman hits with any weapon, the weapon deals an extra 2d8 damage of a type depending on the horseman: cold (black night), fire (red sun), radiant (bright day)."
    },
    {
      "name": "Magic Resistance",
      "desc": "The horseman has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Peerless Rider",
      "desc": "Any attacks directed at the horseman's mount target the horseman instead, and the horseman confers his damage resistances and immunities and his condition immunities to his mount. In addition, if the horseman and mount are subjected to an effect that allows each to make a saving throw to take only half damage, the mount takes no damage if the horseman succeeds on the saving throw."
    },
    {
      "name": "Timeless Nature",
      "desc": "The horseman doesn't age and doesn't require food, drink, or sleep."
    }
  ],
  "spell_list": [],
  "page_no": 30,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_baba-yagas-horsemen/"
}