{
  "slug": "brimstone-locusthound",
  "desc": "This creature is a disturbing combination of wolf and locust, and the smoke it exhales hovers thickly around it. Fur surrounds its locust head, and long, insectoid legs extend from its canine body._  \n**Unnatural Origin.** Brimstone locusthounds are the result of magical experimentation. Scholars are uncertain if the experiment went terribly wrong or if the creatures turned out as originally intended. The wizards who created them have been dead for thousands of years, allowing theories—and the wizards’ creations—to run wild ever since.  \n**Migrating Packs.** Brimstone locusthounds build their nests below ground, in caves, or in buried ruins. They are migratory omnivores, and they prefer areas where fungi and small prey are plentiful. Though less caring for each other than most canines, brimstone locusthounds often form packs to rear young and when food is plentiful. However, when food becomes scarce, a pack of locusthounds tears itself apart, cannibalizing its weakest members, and the survivors scatter to the wind.",
  "name": "Brimstone Locusthound",
  "size": "Medium",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 60,
  "hit_dice": "8d8+24",
  "speed": {
    "walk": 30,
    "fly": 60
  },
  "strength": 19,
  "dexterity": 14,
  "constitution": 17,
  "intelligence": 3,
  "wisdom": 9,
  "charisma": 6,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 10 ft., darkvision 60 ft., passive Perception 9",
  "languages": "—",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The brimstone locusthound makes two claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 4) slashing damage.",
      "attack_bonus": 6,
      "damage_dice": "1d8+4"
    },
    {
      "name": "Sticky Spittle",
      "desc": "Ranged Weapon Attack: +4 to hit, range 20/60 ft., one target. Hit: 9 (2d6 + 2) acid damage, and the target must succeed on a DC 13 Dexterity saving throw or be restrained until the end of its next turn.",
      "attack_bonus": 4,
      "damage_dice": "2d6+2"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Smoky Aura",
      "desc": "The brimstone locusthound emits a dense, choking smoke within 10 feet of itself. Each non-brimstone locusthound creature that enters the smoke or starts its turn in the smoke must succeed on a DC 13 Constitution saving throw or be blinded until the end of its turn. On a successful saving throw, the creature is immune to the locusthound's Smoky Aura for 24 hours. At the start of each of its turns, the locusthound chooses whether this aura is active. The smoke is nonmagical and can be dispersed by a wind of moderate or greater speed (at least 10 miles per hour)."
    },
    {
      "name": "Smoky Haze",
      "desc": "When the brimstone locusthound is targeted by a ranged weapon attack or a spell that requires a ranged attack roll, roll a d6. On a 4 or 5, the attacker has disadvantage on the attack roll. On a 6, the attack misses the locusthound, disappearing into the smoke surrounding it."
    }
  ],
  "spell_list": [],
  "page_no": 51,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_brimstone-locusthound/"
}