{
  "slug": "cackling-skeleton",
  "desc": "The skeleton of a humanoid stands bent over with one arm holding the vacuous space where its stomach would be. Its jaw hangs agape, cackling, as it points at the target of its humor._  \n**Ironic Origins.** When a creature who utterly fears death perishes in an area filled with necrotic energy, it arises as a cackling skeleton. The creature’s dead bones animate to mock the futility of their once-cherished desire of life. The cackling skeleton often wears garish items that parody what it loved in life.  \n**Nihilistic Hecklers.** Cackling skeletons find living creatures’ survival instincts humorous. They find living incredibly futile and believe those that prolong their existence to be hilariously foolish. Unlike other skeletons, cackling skeletons are capable of speech, and they use it to point out the silliness of healing, wearing armor, or other means of self preservation, often pointing out the creature will inevitably die anyway.  \n**Undead Nature.** The cackling skeleton doesn’t require air, food, drink, or sleep.",
  "name": "Cackling Skeleton",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 9,
  "armor_desc": null,
  "hit_points": 26,
  "hit_dice": "4d8+8",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 9,
  "constitution": 15,
  "intelligence": 8,
  "wisdom": 10,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 4,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "the languages it knew in life",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 4 (1d6 + 1) bludgeoning damage. The cackling skeleton has advantage on this attack roll if the target is demoralized.",
      "attack_bonus": 3,
      "damage_dice": "1d6+1"
    },
    {
      "name": "Mock (Recharge 5-6)",
      "desc": "The cackling skeleton mocks the futile efforts of up to three creatures it can see within 30 feet of it that aren't undead or constructs. Each target must make a DC 12 Charisma saving throw, taking 5 (2d4) psychic damage on a failed save, or half as much damage on a successful one. A demoralized target has disadvantage on this saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Cackle",
      "desc": "The skeleton emits a constant, demoralizing cackle. When a creature that isn't an undead or a construct starts its turn within 30 feet of the cackling skeleton and can hear the skeleton, it must make a DC 10 Wisdom saving throw or feel demoralized by the skeleton's cackling. A demoralized creature has disadvantage on attack rolls until the start of its next turn."
    },
    {
      "name": "Turn Vulnerability",
      "desc": "The cackling skeleton has disadvantage on saving throws against any effect that turns undead."
    }
  ],
  "spell_list": [],
  "page_no": 79,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_cackling-skeleton/"
}