{
  "slug": "caltrop-golem",
  "desc": "A scattering of metal caltrops coalesces into a constantly shifting humanoid shape._  \nMade up of thousands of caltrops, a caltrop golem can assume nearly any shape it chooses, though it always remains an amalgamation of metal caltrops.  \n**Iterative Design** Caltrops golems were developed as a more advanced form of Open Game License",
  "name": "Caltrop Golem",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 75,
  "hit_dice": "10d8+30",
  "speed": {
    "walk": 30
  },
  "strength": 9,
  "dexterity": 18,
  "constitution": 16,
  "intelligence": 8,
  "wisdom": 12,
  "charisma": 3,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone",
  "senses": "darkvision 60 ft., tremorsense 30 ft., passive Perception 13",
  "languages": "understands the languages of its creator but can’t speak",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The golem makes two slam attacks. Alternatively, it uses its Steel Shot twice."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Steel Shot",
      "desc": "Ranged Weapon Attack: +7 to hit, range 30/120 ft., one target. Hit: 11 (2d6 + 4) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Scattershot (Recharge 5-6)",
      "desc": "The golem's body explodes. Each creature within 15 feet of the golem must make a DC 15 Dexterity saving throw. On a failure, a creature takes 36 (8d8) piercing damage and is knocked prone. On a success, a creature takes half the damage and isn't knocked prone. The golem immediately scatters."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Ambusher",
      "desc": "In the first round of combat, the golem has advantage on attack rolls against any creature it has surprised."
    },
    {
      "name": "False Appearance",
      "desc": "While the caltrop golem is scattered, it is indistinguishable from a normal pile of caltrops."
    },
    {
      "name": "Immutable Form",
      "desc": "The golem is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The golem has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The golem's weapon attacks are magical."
    },
    {
      "name": "Reform",
      "desc": "If the golem is scattered and has at least 1 hit point, it can reform as a bonus action in any space containing at least one of its caltrops without provoking an opportunity attack. If it reforms within 5 feet of a prone creature, it can make one slam attack against that creature as part of this bonus action."
    },
    {
      "name": "Scatter",
      "desc": "As a bonus action, the bearing golem can disperse, scattering its caltrops in a 15-foot cube, centered on the space it previously occupied. A creature moving through a space containing any of the golem's caltrops must succeed on a DC 15 Dexterity saving throw or stop moving this turn and take 1 piercing damage. Taking this damage reduces the creature's walking speed by 10 feet until the creature regains at least 1 hit point. A creature moving through the area at half speed doesn't need to make the save. While scattered, the bearing golem can't attack or move, except to reform, and it can't be targeted by attacks or spells. It can still take damage from spells that deal damage in an area."
    }
  ],
  "spell_list": [],
  "page_no": 390,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_caltrop-golem/"
}