{
  "slug": "cambion-a5e",
  "desc": "",
  "name": "Cambion",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 16,
  "armor_desc": "",
  "hit_points": 93,
  "hit_dice": "11d8+44",
  "speed": {
    "walk": 30,
    "fly": 60
  },
  "strength": 18,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 16,
  "wisdom": 14,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 7,
  "intelligence_save": 6,
  "wisdom_save": 5,
  "charisma_save": 7,
  "perception": null,
  "skills": {
    "deception": 7,
    "intimidation": 7,
    "perception": 5,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, fire, poison; damage from nonmagical weapons",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 15",
  "languages": "Abyssal, Common, Infernal",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The cambion makes two melee attacks or two ranged attacks."
    },
    {
      "name": "Black Iron Blade",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 9 (1d10 + 4) slashing damage  and the target takes a wound that deals 5 (1d10) ongoing slashing damage. A creature can end the ongoing damage by staunching the wound as an action or by giving the target magical healing."
    },
    {
      "name": "Fire Blast",
      "desc": "Ranged Spell Attack: +7 to hit, range 60 ft., one target. Hit: 13 (3d8) fire damage."
    },
    {
      "name": "Fiery Escape (1/Day)",
      "desc": "The cambion magically creates a fiery portal to the realm of its fiendish parent. The portal appears in an empty space within 5 feet. The portal lasts until the end of the cambions next turn or until it passes through the portal. No one but the cambion can pass through the portal; anyone else that enters its space takes 14 (4d6) fire damage."
    }
  ],
  "bonus_actions": [
    {
      "name": "Fell Charm",
      "desc": "The cambion targets one creature within 30 feet. The target makes a DC 15 Wisdom saving throw. On a failure, it is magically charmed by the cambion for 1 day. The effect ends if the cambion or a cambions ally harms the target, or if the cambion commands it to take a suicidal action. While charmed, the target regards the cambion as a trusted friend and is an ally of the cambion. If the target makes a successful saving throw or the effect ends, the target is immune to this cambions Fell Charm for 24 hours."
    },
    {
      "name": "Command",
      "desc": "The cambion gives an order to an ally within 60 feet that can hear it. If the ally has a reaction available, it can use it to follow the cambions order, either taking an action or moving up to its Speed."
    },
    {
      "name": "Shapeshift",
      "desc": "The cambion magically changes its form to that of any humanoid creature it has seen before, or back into its true form. While shapeshifted, its statistics are unchanged except that it has no armor or equipment, can't use its black iron blade, and can fly only if it is in a form with wings. It reverts to its true form if it dies."
    }
  ],
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": null,
  "spell_list": [],
  "page_no": 42,
  "environments": [],
  "img_main": null,
  "document__slug": "menagerie",
  "document__title": "Level Up Advanced 5e Monstrous Menagerie",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://www.levelup5e.com",
  "v2_converted_path": "/v2/creatures/mmenag_cambion/"
}