{
  "slug": "couatl_bf",
  "desc": "",
  "name": "Couatl",
  "size": "Medium",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 77,
  "hit_dice": "",
  "speed": {
    "walk": 30,
    "fly": 90
  },
  "strength": 16,
  "dexterity": 20,
  "constitution": 16,
  "intelligence": 18,
  "wisdom": 24,
  "charisma": 22,
  "strength_save": 3,
  "dexterity_save": 5,
  "constitution_save": 3,
  "intelligence_save": 4,
  "wisdom_save": 7,
  "charisma_save": 6,
  "perception": 17,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Celestial Resilience",
  "damage_immunities": "psychic",
  "condition_immunities": "",
  "senses": "truesight 120 ft.",
  "languages": "all,telepathy 120 ft.",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The couatl makes one Bite attack and one Constrict attack."
    },
    {
      "name": "Bite",
      "desc": "_Melee Weapon Attack:_ +7 to hit, reach 5 ft., one creature. _Hit:_ 8 (1d6+5) piercing damage plus 14 (4d6) poison damage. If the poison damage reduces the target to 0 HP, the couatl can choose for the target to be stable but poisoned for 1 hour, even after regaining HP, and is unconscious while poisoned in this way."
    },
    {
      "name": "Constrict",
      "desc": "_Melee Weapon Attack:_ +7 to hit, reach 10 ft., one target. _Hit:_ 12 (2d6+5) bludgeoning damage, and the target is grappled (escape DC 15) if it is a Medium or smaller creature. Until this grapple ends, the target is restrained, and the couatl can't Constrict another target."
    },
    {
      "name": "Healing Hiss (3/Day)",
      "desc": "The couatl croons a soothing hiss at a creature it can sense within 5 feet of it. The target magically regains 10 (3d6) HP and is freed from any disease or poison."
    }
  ],
  "bonus_actions": [
    {
      "name": "Change Shape",
      "desc": "The couatl magically transforms into a Large or smaller Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Celestial. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the couatl's choice). It reverts to its true form if it dies. In a new form, the couatl retains its Celestial Resilience and Inscrutable traits and its HP, HD, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action and the Rainbow Shield reaction. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
    }
  ],
  "reactions": [
    {
      "name": "Rainbow Shield",
      "desc": "When a creature the couatl can see within 30 feet of it, including itself, is targeted with an attack, the couatl can interpose a shield of rainbow-hued light between the attacker and the creature. The attacker has disadvantage on the attack roll. If the protected creature hasn't attacked or harmed another creature within the last minute, the attacker's attack misses instead."
    }
  ],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Celestial Resilience",
      "desc": "The couatl is resistant to radiant damage and to bludgeoning, piercing, and slashing damage from nonmagical attacks."
    },
    {
      "name": "Inscrutable",
      "desc": "The couatl is immune to any effect that would sense its emotions or read its thoughts, as well as divination spells or effects, such as scrying or detecting its location, that it refuses. WIS (Insight) checks made to ascertain the couatl's intentions or sincerity have disadvantage."
    },
    {
      "name": "Magic Resistance",
      "desc": "The couatl has advantage on saves against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The couatl's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_couatl/"
}