{
  "slug": "deathcap-myconid",
  "desc": "_Deathcap flesh ranges from white to pale gray to a warm yelloworange. Their heads resemble fungal caps, often either red with white spots, red at the center with a brown edge, or a bluish-purple tone. Although deathcaps have vicious-looking fanged mouths, they use them only to ingest earth or mineral nutrients._  \n**Mushroom Farmers.** These sentient mushroom folk tend the white forests of fungi in the underworld and are allies of the darakhul. Despite their ominous name, deathcap myconids are chiefly farmers. They cultivate dozens of species of mushrooms anywhere they have water, dung, and a bit of earth or slime in the underworld deeps. For this reason, other races rarely attack them. The ghouls do not eat them, and they cannot be made into darakhul.  \n**Toxic Spores.** Although deathcaps are mostly peaceful, their spores are toxic and sleep-inducing. They make excellent allies in combat because their abilities tend to punish attackers, but they aren’t especially lethal on their own. They use their poison and slumber spores to full effect against living creatures; they typically flee from constructs and undead. They count on their allies (carrion beetles, darakhul, purple worms, dark creepers, or even various devils) to fend off the most powerful foes.  \n**Clones.** Deathcap myconids live in communal groups of related clones. They reproduce asexually, and an elder and its offspring can be nearly identical in all but age. These clone groups are called deathcap rings.  \nMyconids build no huts or towns, but their groups are defined by their crops and general appearance. Indeed, many sages claim that the deathcaps are merely the fruiting, mobile bodies of the forests they tend, and that this is why they fight so ferociously to defend their forests of giant fungi.",
  "name": "Deathcap Myconid",
  "size": "Medium",
  "type": "Plant",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 90,
  "hit_dice": "12d8+36",
  "speed": {
    "walk": 20
  },
  "strength": 12,
  "dexterity": 10,
  "constitution": 16,
  "intelligence": 10,
  "wisdom": 11,
  "charisma": 9,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "-",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The myconid uses either its Deathcap Spores or its Slumber Spores, then makes a fist attack."
    },
    {
      "name": "Fist",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 11 (4d4 + 1) bludgeoning damage plus 10 (4d4) poison damage.",
      "attack_bonus": 3,
      "damage_dice": "4d4"
    },
    {
      "name": "Deathcap Spores (3/day)",
      "desc": "The myconid ejects spores at one creature it can see within 5 feet of it. The target must succeed on a DC 13 Constitution saving throw or be poisoned for 3 rounds. While poisoned this way, the target also takes 10 (4d4) poison damage at the start of each of its turns. The target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    {
      "name": "Slumber Spores (3/day)",
      "desc": "The myconid ejects spores at one creature it can see within 5 feet of it. The target must succeed on a DC 13 Constitution saving throw or be poisoned and unconscious for 1 minute. A creature wakes up if it takes damage, or if another creature uses its action to shake it awake."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Distress Spores",
      "desc": "When a deathcap myconid takes damage, all other myconids within 240 feet of it sense its pain."
    },
    {
      "name": "Sun Sickness",
      "desc": "While in sunlight, the myconid has disadvantage on ability checks, attack rolls, and saving throws. The myconid dies if it spends more than 1 hour in direct sunlight."
    }
  ],
  "spell_list": [],
  "page_no": 0,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_deathcap-myconid/"
}