{
  "slug": "deva_bf",
  "desc": "",
  "name": "Deva",
  "size": "Medium",
  "type": "Celestial",
  "subtype": "Angel",
  "group": "Angels",
  "alignment": "",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 165,
  "hit_dice": "",
  "speed": {
    "walk": 30,
    "fly": 90
  },
  "strength": 18,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 16,
  "wisdom": 28,
  "charisma": 28,
  "strength_save": 4,
  "dexterity_save": 4,
  "constitution_save": 4,
  "intelligence_save": 3,
  "wisdom_save": 9,
  "charisma_save": 9,
  "perception": 19,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Angelic Resilience",
  "damage_immunities": "Angelic Resilience",
  "condition_immunities": "",
  "senses": "darkvision 120 ft.",
  "languages": "all,telepathy 120 ft.",
  "challenge_rating": "10",
  "cr": 10,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The deva makes three Mace attacks."
    },
    {
      "name": "Mace",
      "desc": "_Melee Weapon Attack:_ +8 to hit, reach 5 ft., one target. _Hit:_ 7 (1d6+4) bludgeoning damage plus 18 (4d8) radiant damage."
    },
    {
      "name": "Healing Touch (3/Day)",
      "desc": "The deva touches another creature. The target magically regains 20 (4d8+2) HP and is freed from any curse, disease, poison, blindness, or deafness."
    }
  ],
  "bonus_actions": [
    {
      "name": "Change Shape",
      "desc": "The deva magically transforms into a Large or smaller Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Celestial. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the deva's choice). It reverts to its true form if it dies. In a new form, the deva retains its Angelic Resilience, Angelic Senses, and Immortal Nature traits and its HP, HD, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Angelic Resilience",
      "desc": "The deva is resistant to radiant damage and to bludgeoning, piercing, and slashing damage from nonmagical attacks. In addition, it is immune to exhaustion and the charmed and frightened conditions."
    },
    {
      "name": "Angelic Senses",
      "desc": "The deva can pinpoint the location of Aberrations, Celestials, Fiends, and Undead within 30 feet of it and knows if a place or object it can sense is consecrated or desecrated."
    },
    {
      "name": "Angelic Weapons",
      "desc": "The deva's weapon attacks are magical. When the deva hits with any weapon, the weapon deals an extra 4d8 radiant damage (included in the attack)."
    },
    {
      "name": "Immortal Nature",
      "desc": "The deva doesn't require food, drink, or sleep."
    },
    {
      "name": "Magic Resistance",
      "desc": "The deva has advantage on saves against spells and other magical effects."
    },
    {
      "name": "Reviving Prayer",
      "desc": "The deva spends 10 minutes praying to its deity for the safe return of the soul of a slain creature. At the end of the prayer, the deva touches a creature that has been dead no more than 24 hours and returns the creature to life with a number of HP equal to half its HP maximum. Reviving Prayer can't return to life a creature that has died of old age, nor can it restore any missing body parts. A creature restored to life in this way can't be returned to life by this deva again for 30 days."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_deva/"
}