{
  "slug": "doppelrat-tob1-2023",
  "desc": "False",
  "name": "Doppelrat",
  "size": "Tiny",
  "type": "Monstrosity",
  "subtype": "",
  "group": "null",
  "alignment": "Unaligned",
  "armor_class": 13,
  "armor_desc": "",
  "hit_points": 45,
  "hit_dice": "10d4 + 20",
  "speed": {
    "walk": 15
  },
  "strength": 2,
  "dexterity": 17,
  "constitution": 14,
  "intelligence": 2,
  "wisdom": 13,
  "charisma": 2,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 11,
  "skills": {
    "Stealth": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "False",
  "condition_immunities": "False",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "—",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) piercing damage, and the target must succeed on a DC 13 Constitution saving throw or contract the horrific doppeling disease (see the Horrific Doppeling trait)."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Arcane Doubling",
      "desc": "While in combat, at the start of each of its turns, the doppelrat rapidly creates duplicates of itself as an automatic defense mechanism. These duplicates immediately form into a swarm of rats in the doppelrat's space, acting as allies of the doppelrat and obeying its body language commands. The swarm acts on the doppelrat's turn, and the doppelrat can use its reaction to move up to its speed with the swarm, provided it is in the swarm's space when the swarm moves. The swarm remains for 1 minute, until the doppelrat dies, or until the doppelrat dismisses it as a bonus action. The doppelrat can have no more than two swarms of rats under its control at a time."
    },
    {
      "name": "Hidden Original",
      "desc": "While the doppelrat is in the space of a swarm it created with Arcane Doubling, it is indiscernible from the other rats and has total cover. A creature must take an action to visually inspect the swarm and succeed on a DC 15 Intelligence (Investigation) check to find the doppelrat among its duplicates. Once a creature succeeds on this check, the doppelrat loses total cover against attacks and spells from that creature and that creature's allies until the doppelrat starts its turn in the same space as one of its swarms."
    },
    {
      "name": "Horrific Doppeling",
      "desc": "Characterized by the growing and sloughing off of tumors shaped like the infected creature, horrific doppeling is a disease that infects creatures attacked by doppelrats. Until the disease is cured, the creature is poisoned. At the end of each long rest, the infected creature must succeed on a DC 13 Constitution saving throw or shed a tumor that looks like a Tiny version of itself. Though disturbing, the tumor is merely a mass of shed skin and fat that decays as normal. The disease is cured after the creature succeeds on two saving throws."
    },
    {
      "name": "Keen Smell",
      "desc": "The doppelrat has advantage on Wisdom (Perception) checks that rely on smell."
    }
  ],
  "spell_list": [],
  "page_no": 109,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_doppelrat/"
}