{
  "slug": "emperors-hyena",
  "desc": "A choking cackle escapes the throat of the hyena. As it steps forward, patches of fur fall off of it, revealing bone and rotting muscle._  \nAs their name implies, emperor’s hyenas are undead hyenas that have been magically enhanced and tied to the emperor. With rotting, matted fur, missing teeth, and baleful yellow eyes, they are easily mistaken for simple undead beasts. Their appearance belies a relentless cunning.  \n**Gifts from the God of Death.** The method of creation of emperor’s hyenas was a gift given directly to the emperor by the god of death and has been entrusted to only a few necromancers. Emperor’s hyenas can be created only from hyenas that were anointed protectors of the god’s holy places when they were alive. Their scarcity means they are primarily used as messengers and guardians for the emperor. The emperor rarely sends them to attack enemies unless the enemy has truly angered him. The emperor is seldom seen without a pair of emperor’s hyenas by his side. When he moves publicly, every available emperor’s hyena is deployed to ensure his safety.  \n**Voice of the Emperor.** Emperor’s hyenas often deliver messages when the emperor needs a messenger hardier than a Open Game License",
  "name": "Emperor’s Hyena",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 91,
  "hit_dice": "14d8+28",
  "speed": {
    "walk": 50
  },
  "strength": 16,
  "dexterity": 14,
  "constitution": 15,
  "intelligence": 6,
  "wisdom": 10,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": 4,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 2,
  "skills": {
    "perception": 2
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, necrotic; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "understands Common and Darakhul but can’t speak",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The emperor's hyena makes two bite attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage plus 10 (3d6) necrotic damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Black Breath (Recharge 5-6)",
      "desc": "The emperor's hyena breathes a 15-foot cone of noxious black vapor. Each creature in the area that isn't an undead or a construct must make a DC 12 Constitution saving throw, taking 14 (4d6) necrotic damage on a failed save, or half as much damage on a successful one. If the saving throw fails by 5 or more, the creature gains one level of exhaustion. This exhaustion lasts until the creature finishes a short or long rest."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Pack Tactics",
      "desc": "The emperor's hyena has advantage on attack rolls against a creature if at least one of the hyena's allies is within 5 feet of the creature and the ally isn't incapacitated."
    },
    {
      "name": "Stench",
      "desc": "Any creature that starts its turn within 5 feet of the emperor's hyena must succeed on a DC 12 Constitution saving throw or be poisoned until the start of its next turn. On a successful saving throw, the creature is immune to the emperor's hyena's Stench for 24 hours."
    },
    {
      "name": "Turning Resistance",
      "desc": "The emperor's hyena has advantage on saving throws against any effect that turns undead."
    }
  ],
  "spell_list": [],
  "page_no": 135,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_emperors-hyena/"
}