{
  "slug": "hebi-doku",
  "desc": "A serpent rises in tight coils, until its head is level with that of a tall man. Its body is thick and covered in glossy black scales broken by wide bands of bright orange. The two smaller serpents growing from its torso wind together and hiss menacingly. Twin rattles shake rapidly behind the creature._  \n**Ophidian Masters.** Shrines to hebi-doku are found most often in places where venomous snakes are common. They are also located in regions where snakes are considered sacred and in the homes and guilds of assassins who favor the use of toxins. Hebi-doku are never found without an accompaniment of other serpents.  \n**Feared and Placated.** Adventurers and archaeologists who travel through snake-filled jungles and ruins offer hebi-doku tribute, hoping that doing so will purchase some protection from the snakes they encounter. Scorned lovers sometimes venerate a local hebi-doku in the hopes that it will poison future relationships for their former paramour. A hebi-doku claims to care little for the veneration of non-serpents, but it knows it will cease to exist without their gifts.  \n**Toxic Shrines.** To summon a hebi-doku, a heart stilled by snake venom must be laid at the foot of a low altar built of mongoose bones.  \n**Immortal Spirit Nature.** The kami doesn’t require food, drink, or sleep.",
  "name": "Hebi-Doku",
  "size": "Medium",
  "type": "Fey",
  "subtype": "kami",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 15,
  "armor_desc": null,
  "hit_points": 123,
  "hit_dice": "13d8+65",
  "speed": {
    "climb": 40,
    "walk": 40
  },
  "strength": 17,
  "dexterity": 21,
  "constitution": 21,
  "intelligence": 15,
  "wisdom": 13,
  "charisma": 17,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "passive Perception 14",
  "languages": "Common, Sylvan",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The hebi-doku can use its Transfixing Rattle. It then makes two attacks: one with its bite and one with its disabling sting, or two with its toxic spittle."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 14 (2d8 + 5) piercing plus 14 (4d6) poison damage.",
      "attack_bonus": 8,
      "damage_dice": "2d8+5"
    },
    {
      "name": "Disabling Sting",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 12 (3d4 + 5) piercing damage, and the target must succeed on a DC 16 Constitution saving throw or be unable to use bonus actions and reactions until the end of its next turn.",
      "attack_bonus": 8,
      "damage_dice": "3d4+5"
    },
    {
      "name": "Toxic Spittle",
      "desc": "Ranged Weapon Attack: +8 to hit, range 30/90 ft., one target. Hit: 10 (3d6) poison damage, and the target must make a DC 16 Constitution saving throw. On a failure, the target is paralyzed for 1 minute. On a success, the target is poisoned for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
      "attack_bonus": 8,
      "damage_dice": "3d6"
    },
    {
      "name": "Transfixing Rattle",
      "desc": "The hebi-doku rattles its tail at one creature it can see within 30 feet of it. The target must make a DC 14 Wisdom saving throw or be incapacitated and have its speed reduced to 0 until the end of its next turn."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Keen Smell",
      "desc": "The hebi-doku has advantage on Wisdom (Perception) checks that rely on smell."
    },
    {
      "name": "Serpentine Mind",
      "desc": "The hebi-doku can magically command any snake within 120 feet of it, using a limited form of telepathy."
    }
  ],
  "spell_list": [],
  "page_no": 222,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_hebi-doku/"
}