{
  "slug": "infernal-swarm",
  "desc": "A towering winged devil looms above, a wicked scimitar in its grasp. Its form shifts subtly, hinting at a deeper secret._  \n**Infernal Insects.** Infernal swarms are found throughout the Hells. Considered a delicacy, these insects can form a hive mind, which they use to shape their swarm into a massive winged devil whenever they are threatened. The individual insects are bat-winged and have bulging eyes, long spindly legs, and a carapace covered in poisonous barbs.  \n**Hellish Poison.** Infernal swarms feed on carrion, injecting the carcasses with a poison that liquifies tissue. This same poison coats their barbs, which painfully dissuades predators.  \n**Sensitive to Sound.** Loud noises disorient the insects and interrupt their coordination, temporarily scattering the individuals. However, it is rare to encounter these silent killers hunting on their own, and if one is spotted, there are certain to be many more to follow.",
  "name": "Infernal Swarm",
  "size": "Huge",
  "type": "Fiend",
  "subtype": "Swarm of Devils",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 150,
  "hit_dice": "20d12+20",
  "speed": {
    "hover": true,
    "walk": 25,
    "fly": 40
  },
  "strength": 18,
  "dexterity": 16,
  "constitution": 13,
  "intelligence": 8,
  "wisdom": 12,
  "charisma": 19,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "thunder",
  "damage_resistances": "bludgeoning, cold, piercing, psychic, slashing",
  "damage_immunities": "fire, poison",
  "condition_immunities": "charmed, frightened, paralyzed, petrified, poisoned, prone, restrained, stunned",
  "senses": "darkvision 120 ft., passive Perception 11",
  "languages": "understands Infernal but can’t speak, telepathy 60 ft.",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "In fiend form, the infernal swarm makes three attacks: two with its scimitar and one with its slam, or three with its scimitar. In shapeless form, it makes three attacks with its bites."
    },
    {
      "name": "Bites (Shapeless Form Only)",
      "desc": "Melee Weapon Attack: +9 to hit, reach 0 ft., one target in the swarm's space. Hit: 28 (8d6) piercing damage, or 14 (4d6) piercing damage if the swarm has half its hp or fewer.",
      "attack_bonus": 9,
      "damage_dice": "8d6"
    },
    {
      "name": "Poisonous Barb",
      "desc": "Ranged Weapon Attack: +8 to hit, range 30/120 ft., one target. Hit: 10 (2d6 + 3) piercing damage, and the target must make a DC 17 Constitution saving throw, taking 18 (4d8) poison damage on a failed save, or half as much damage on a successful one.",
      "attack_bonus": 8,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Scimitar (Fiend Form Only)",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 14 (3d6 + 4) slashing damage.",
      "attack_bonus": 9,
      "damage_dice": "3d6+4"
    },
    {
      "name": "Slam (Fiend Form Only)",
      "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 18 (4d6 + 4) bludgeoning damage, and the target is grappled (escape DC 17). Until this grapple ends, the target is restrained, and the infernal swarm can't slam another target. In addition, at the start of each of the target's turns, the target takes 14 (4d6) piercing damage.",
      "attack_bonus": 9,
      "damage_dice": "4d6+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Devil's Sight",
      "desc": "Magical darkness doesn't impede the infernal swarm's darkvision"
    },
    {
      "name": "Magic Resistance",
      "desc": "The infernal swarm has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Shaped Swarm",
      "desc": "As a bonus action, the swarm can shape itself into a Huge fiend or back into a shapeless mass. Its statistics are the same in each form, and it can't regain hp or gain temporary hp. If a creature is more than 10 feet away from the infernal swarm, it must take an action to visually inspect the fiend form and succeed on a DC 25 Intelligence (Investigation) check to discern the Huge fiend is actually a swarm of Small insects. A creature within 10 feet of the swarm immediately discerns the truth.\n\nWhile in fiend form, it can wield weapons and hold, grasp, push, pull, or interact with objects that might otherwise require a more humanoid form to accomplish. If the infernal swarm takes thunder damage while in its fiend form, it immediately changes to its shapeless form.\n\nWhile in shapeless form, it can occupy another creature's space and vice versa and can move through any opening large enough for a Small fiend, but it can't grapple or be grappled."
    }
  ],
  "spell_list": [],
  "page_no": 215,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_infernal-swarm/"
}