{
  "slug": "leech-swarm",
  "desc": "In swampy areas where food is plentiful, leeches gather together in swarms numbering in the hundreds to hunt prey. When their food supply is diminished, the leeches often turn on each other, effectively destroying the swarm. The scent of blood attracts leech swarms, and they easily locate warm-blooded prey. Victims who move out of a leech swarm are not safe, as several leeches remain attached and continue to drain blood until they are removed. These hangers-on are adept at locating hard-to-reach places on their prey as they wriggle into gaps in armor or crawl into boots. Their victims must spend extra time to locate and remove them.",
  "name": "Leech Swarm",
  "size": "Medium",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 32,
  "hit_dice": "5d8+10",
  "speed": {
    "walk": 10,
    "swim": 40
  },
  "strength": 5,
  "dexterity": 16,
  "constitution": 15,
  "intelligence": 2,
  "wisdom": 13,
  "charisma": 4,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 3,
  "skills": {
    "perception": 3,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing",
  "damage_immunities": "",
  "condition_immunities": "charmed, frightened, grappled, paralyzed, petrified, prone, restrained, stunned",
  "senses": "darkvision 30 ft., passive Perception 13",
  "languages": "—",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Bites",
      "desc": "Melee Weapon Attack: +5 to hit, reach 0 ft., one creature in the swarm's space. Hit: 14 (4d6) piercing damage, or 7 (2d6) piercing damage if the swarm has half its hp or fewer. If the target is a creature other than a construct or an undead, it must succeed on a DC 13 Dexterity saving throw or lose 2 (1d4) hp at the start of each of its turns as leeches attach to it and drain its blood. Any creature can take an action to find and remove the leeches with a successful DC 13 Wisdom (Perception) check. The leeches also detach if the target takes fire damage.",
      "attack_bonus": 5,
      "damage_dice": "4d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Blood Frenzy",
      "desc": "The leech swarm has advantage on melee attack rolls against any creature that doesn't have all its hp."
    },
    {
      "name": "Blood Sense",
      "desc": "The leech swarm can pinpoint, by scent, the location of creatures that aren't undead or constructs within 30 feet of it."
    },
    {
      "name": "Swarm",
      "desc": "The leech swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny leech. The swarm can't regain hp or gain temporary hp."
    }
  ],
  "spell_list": [],
  "page_no": 396,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_leech-swarm/"
}