{
  "slug": "liosalfar",
  "desc": "_The curtain of rippling colors assumes a humanoid form. Its kaleidoscope body shifts and glitters with mesmeric patterns._  \nSometimes known as “light elves” because they assume a vaguely elfish shape, these enigmatic shapeshifters make their home at the edge of the world, where reality bends and physical laws unravel. Their mutable bodies are composed entirely of shifting colors. Among themselves they communicate through flashing patterns and hues, but they talk to other races in an echoing, choral tone that seems to emanate from everywhere and nowhere around them.  \n**Servants of Fate.** Their aims often seem inconsequential or simply baffling, but they’ve also sundered mountains and toppled kingdoms. Many believe they’re agents of Fate, others that their motivation is an alien aesthetic or their own amusement.  \n**Pattern Vision.** Those who’ve spoken with liosalfar say they talk as if all existence was a sea of patterns and colors to be set in pleasing shapes. They barely understand mortal concerns.  \n**Enemies of the Ramag.** The liosalfar have a longstanding rivalry with the portal-making ramag, whom they despise as “corruptors of the patterns.”  \n**Elemental Nature.** A liosalfar doesn’t require air, food, drink, or sleep.",
  "name": "Liosalfar",
  "size": "Large",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 17,
  "armor_desc": "",
  "hit_points": 110,
  "hit_dice": "20d10",
  "speed": {
    "fly": 60,
    "hover": true
  },
  "strength": 10,
  "dexterity": 25,
  "constitution": 10,
  "intelligence": 18,
  "wisdom": 18,
  "charisma": 12,
  "strength_save": null,
  "dexterity_save": 10,
  "constitution_save": 3,
  "intelligence_save": 7,
  "wisdom_save": 7,
  "charisma_save": 4,
  "perception": 7,
  "skills": {
    "arcana": 7,
    "insight": 7,
    "perception": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison, psychic, radiant",
  "condition_immunities": "blinded, charmed, exhaustion (see Lightform special ability), grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "blindsight 120 ft., truesight 60 ft., passive Perception 17",
  "languages": "Common, Celestial, Primordial, Elvish, Giant",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The liosalfar makes two Disrupting Touch attacks."
    },
    {
      "name": "Disrupting Touch",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 26 (4d12) radiant damage, and the target must succeed on a DC 15 Wisdom saving throw or become stunned for 1 round.",
      "attack_bonus": 10,
      "damage_dice": "4d12"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Alien Mentality",
      "desc": "A liosalfar's exotic consciousness renders it immune to psychic effects, and any attempt to read their thoughts leaves the reader confused for 1 round."
    },
    {
      "name": "Darkness Vulnerability",
      "desc": "Magical darkness is harmful to a liosalfar: They take 2d10 necrotic damage, or half damage with a successful DC 14 Constitution saving throw, each time they start their turn inside magical darkness. Natural darkness is unpleasant to them but not harmful."
    },
    {
      "name": "Incorporeal Movement",
      "desc": "The liosalfar can move through other creatures and objects as difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "the liosalfar's innate spellcasting ability is Intelligence (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nat Will: augury, color spray, dancing lights, detect magic, flare, light, silent image, spare the dying\n\n2/day each: alter self, blur, divination, hypnotic pattern, prismatic spray, scorching ray\n\n1/day each: hallucinatory terrain, plane shift, sunbeam"
    },
    {
      "name": "Lightform",
      "desc": "Liosalfar are composed entirely of light. They are incorporeal and not subject to ability damage, polymorph, petrification, or attacks that alter their form."
    },
    {
      "name": "Prismatic Glow",
      "desc": "Liosalfar shed rainbow illumination equal to a daylight spell. They cannot extinguish this glow without perishing but can reduce it to the level of torchlight at will. Even when using alter self they have a faint, diffused glow that's visible in dim light or darkness."
    }
  ],
  "spell_list": [],
  "page_no": 277,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_liosalfar/"
}