{
  "slug": "loxoda",
  "desc": "_Often called elephant centaurs by humans and gnolls, loxodas are massive creatures that combine the torso of an ogre and the body of an elephant. Hating and fearing all strangers, they live in open plains and scrubland._  \n**Nomadic Families.** Loxodas live in small herds of 2-3 extended families. Several of these communities will usually cluster together, allowing members to move between groups as they get older. They have no permanent settlements, and instead loxoda families travel to new areas when they deplete the available food. Voracious eaters, a family of loxodas will quickly strip trees bare of leaves, or hunt and cook an entire elephant. They devour both meat and vegetation.  \n**Often Underestimated.** Many people assume that loxodas are as dull witted as the ogres they resemble. This is often a fatal mistake, as the elephant centaurs are quite intelligent. Their simple equipment and straightforward living comes not from a lack of skill or knowledge, but their own isolationism and xenophobia. Their immense size and quadruped body makes it difficult for them to mine metal ore, and they violently reject communications and trade with other people. The little metal they can gather is either taken from the bodies of their prey or stolen in raids on dwarven, human, or gnoll settlements.  \n**Vestigial Tusks.** All loxodas have curved tusks. While they are too small for use in even ritual combat, they are often decorated with intricate carvings, inlays or dyed in a pattern developed by their family. Each individual also adapts the patterns with their own individual marks, often inspired by important events in their lives. Some loxodas put golden rings or jewelled bracelets stolen from humanoids onto their tusks as trophies—a loxoda matriarch may have long dangling chains of such ornaments, indicating her high status and long life. They stand 18 feet tall and weigh nearly 20,000 pounds.",
  "name": "Loxoda",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 147,
  "hit_dice": "14d12+56",
  "speed": {
    "walk": 40
  },
  "strength": 19,
  "dexterity": 12,
  "constitution": 19,
  "intelligence": 12,
  "wisdom": 14,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "survival": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "passive Perception 12",
  "languages": "Loxodan",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The loxoda makes two attacks, but no more than one of them can be a maul or javelin attack."
    },
    {
      "name": "Maul",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 25 (6d6 + 4) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "6d6"
    },
    {
      "name": "Stomp",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 20 (3d10 + 4) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "3d10"
    },
    {
      "name": "Javelin",
      "desc": "Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 14 (3d6 + 4) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "3d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Trampling Charge",
      "desc": "If the loxoda moves at least 20 feet straight toward a Large or smaller creature it then attacks with a stomp, the stomp attack is made with advantage. If the stomp attack hits, the target must also succeed on a DC 15 Strength saving throw or be knocked prone."
    }
  ],
  "spell_list": [],
  "page_no": 280,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_loxoda/"
}