{
  "slug": "mead-archon",
  "desc": "An amber-skinned angelic figure clad in leather armor spreads its white wings as it takes a long pull from an enormous drinking horn._  \nMead archons are the emissaries of deities who enjoy battle and strong drink.  \n**Fight Hard, Party Harder.** Mead archons are good-natured, bombastic warriors who inspire others in battle with their bravery and feats of strength. In times of desperation, a god sends these archons to bolster the ranks of mortal soldiers who serve the deity’s cause. If the day is won, mead archons relish staying on the Material Plane to celebrate, drinking ale, bellowing songs, and sharing stories of victory.  \n**Divine Trainers.** When a mortal champion of a deity is part of an athletic competition or important battle, a mead archon is often sent to help prepare the mortal for the event. Mead archons are tough but encouraging trainers who enjoy celebrating wins and drinking away losses.  \n**Immortal Nature.** The mead archon doesn’t require food, drink, or sleep.",
  "name": "Mead Archon",
  "size": "Medium",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Good",
  "armor_class": 14,
  "armor_desc": "leather armor",
  "hit_points": 82,
  "hit_dice": "11d8+33",
  "speed": {
    "walk": 30,
    "fly": 60
  },
  "strength": 20,
  "dexterity": 16,
  "constitution": 17,
  "intelligence": 14,
  "wisdom": 18,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 5,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": 7,
  "perception": null,
  "skills": {
    "athletics": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "poison, radiant; bludgeoning, piercing, and slashing damage from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "charmed, exhaustion, frightened, poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "all, telepathy 60 ft.",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mead archon makes two melee attacks. Alternatively, it can use its Radiant Bolt twice. It can use its Drunken Touch in place of one melee attack."
    },
    {
      "name": "Maul",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+5"
    },
    {
      "name": "Radiant Bolt",
      "desc": "Ranged Spell Attack: +7 to hit, range 60 ft., one target. Hit: 10 (3d6) radiant damage.",
      "attack_bonus": 7,
      "damage_dice": "3d6"
    },
    {
      "name": "Drunken Touch",
      "desc": "The mead archon touches a creature within 5 feet of it. The creature must succeed on a DC 15 Constitution saving throw or become poisoned for 1 hour. If a creature poisoned this way takes damage, it can repeat the saving throw, ending the condition on a success."
    },
    {
      "name": "Create Potion of Healing (1/Day)",
      "desc": "The mead archon touches a container containing 1 pint of alcohol and turns it into a potion of healing. If the potion is not consumed within 24 hours, it reverts back to its original form."
    },
    {
      "name": "Divine Guzzle (Recharge 4-6)",
      "desc": "The mead archon drinks a pint of alcohol and chooses one of the following effects: \n* The archon belches fire in a 15-foot cone. Each creature in that area must make a DC 15 Dexterity saving throw, taking 14 (4d6) fire damage on a failed save, or half as much damage on a successful one. \n* The archon has advantage on attack rolls and saving throws until the end of its next turn. \n* The archon regains 10 hit points."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The mead archon has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The mead archon's weapon attacks are magical."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The mead archon's spellcasting ability is Charisma (spell save DC 15). The archon can innately cast the following spells, requiring only verbal components:\n1/day each: aid, enhance ability, lesser restoration, protection from poison, zone of truth"
    }
  ],
  "spell_list": [],
  "page_no": 18,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_mead-archon/"
}