{
  "slug": "noctiny",
  "desc": "_A grinning man brandishes a staff surmounted by a rune-covered skull. Blasphemous sigils adorn his clothes, and ashes stain his skin a sickly gray._  \nNoctiny are wretched humanoids corrupted by fell power. Their skin is sallow and gaunt even before they smear it with ash, bone dust, and worse materials to wash all living color from their bodies. The noctiny embrace all manner of blasphemous and taboo behaviors to please their masters.  \n**Pyramid of Power.** The noctiny’s lust for power drives them away from decency and reason. They are initiates who form the lowest rung of fext society. They swear themselves into service to the undead fext as thugs, servants, acolytes, and cannon fodder, and in exchange draw a trickle of power for themselves.  \n**A Race Apart.** Though they arise from any humanoid stock, the noctiny are corrupted by the powers they serve. Noctiny retain the cosmetic traits that identify their original race if one looks hard enough, but any connection they once had to their fellows is overpowered by their transformation into noctiny.",
  "name": "Noctiny",
  "size": "Medium",
  "type": "Humanoid",
  "subtype": "noctiny",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": "studded leather armor",
  "hit_points": 52,
  "hit_dice": "8d8+16",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 13,
  "constitution": 14,
  "intelligence": 10,
  "wisdom": 11,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "frightened",
  "senses": "passive Perception 10",
  "languages": "Common, plus the language spoken by the noctini's fext master",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The noctiny makes two melee attacks."
    },
    {
      "name": "Pact Staff",
      "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage or 8 (1d8 + 4) bludgeoning damage if used in two hands.",
      "attack_bonus": 3,
      "damage_dice": "1d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The noctiny has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Pact Wrath",
      "desc": "One of the noctiny's weapons is infused with power. Its attacks with this weapon count as magical, and it adds its Charisma bonus to the weapon's damage (included below)."
    },
    {
      "name": "Spellcasting",
      "desc": "the noctiny is a 3rd-level spellcaster. Its spellcasting ability score is Charisma (save DC 13, +5 to hit with spell attacks). It knows the following warlock spells.\n\ncantrips (at will): chill touch, eldritch blast, poison spray\n\n1st level (4 slots): armor of agathys, charm person, hellish rebuke, hex\n\n2nd level (2 slots): crown of madness, misty step"
    }
  ],
  "spell_list": [],
  "page_no": 308,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_noctiny/"
}