{
  "slug": "onyx-magistrate",
  "desc": "This large onyx statue looks down critically from an ornate chair. It wears long ceremonial robes and carries a scepter in one hand and an orb in the other. With a slow grinding sound, the statue animates and rises in the air, still seated in its onyx chair._  \n**Grand Sculptures.** Built to oversee great libraries, courts of law, royal houses, and the seats of government in corrupt and evil lands, onyx magistrates are intelligent constructs resembling judges, court officials, or bishops seated on massive thrones. The onyx magistrate is often placed in an area of importance such as within a great meeting hall or next to an important gate and remains motionless until it deems someone worthy of its attention or in need of punishment.  \n**Judge, Jury, and Executioner.** Onyx magistrates pursue their tasks with diligence and patience, never shirking from their responsibilities or showing pity or remorse for their actions. They never tolerate falsehoods or those seeking to cajole or intimidate them, though they have a soft spot for flattery, especially that which praises their abilities or dedication to their role. The construction of an onyx magistrate requires the binding of a Open Game License",
  "name": "Onyx Magistrate",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 123,
  "hit_dice": "13d10+52",
  "speed": {
    "fly": 30,
    "walk": 0,
    "hover": true
  },
  "strength": 19,
  "dexterity": 10,
  "constitution": 18,
  "intelligence": 16,
  "wisdom": 20,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "insight": 8,
    "intimidation": 8,
    "perception": 8,
    "persuasion": 8,
    "religion": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, fire, psychic",
  "damage_immunities": "necrotic, poison; bludgeoning, piercing, and slashing from nonmagical attacks not made with adamantine weapons",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned, prone",
  "senses": "darkvision 60 ft., passive Perception 18",
  "languages": "Common, Infernal",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The onyx magistrate makes three scepter attacks. Alternatively, it can use Necrotic Ray twice."
    },
    {
      "name": "Scepter",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) bludgeoning damage, and the target must succeed on a DC 15 Strength saving throw or be knocked prone.",
      "attack_bonus": 7,
      "damage_dice": "2d10+4"
    },
    {
      "name": "Necrotic Ray",
      "desc": "Ranged Spell Attack: +8 to hit, range 30/120 ft., one target. Hit: 17 (3d8 + 4) necrotic damage.",
      "attack_bonus": 8,
      "damage_dice": "3d8+4"
    },
    {
      "name": "Dire Judgement (1/Day)",
      "desc": "Each creature of the onyx magistrate's choice that is within 30 feet of the magistrate and aware of it must succeed on a DC 16 Wisdom saving throw or be cursed with dire judgment. While cursed in this way, the creature can't regain hp by magical means, though it can still regain hp from resting and other nonmagical means. In addition, when a cursed creature makes an attack roll or a saving throw, it must roll a d4 and subtract the number from the attack roll or saving throw. The curse lasts until it is lifted by a remove curse spell or similar magic."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Tip the Scales (Recharge 5-6)",
      "desc": "The onyx magistrate adds 3 to its AC against one attack that would hit it. Alternatively, the onyx magistrate succeeds on a saving throw it failed."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Immutable Form",
      "desc": "The onyx magistrate is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The onyx magistrate has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The onyx magistrate's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": 276,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_onyx-magistrate/"
}