{
  "slug": "primordial-matriarch",
  "desc": "",
  "name": "Primordial Matriarch",
  "size": "Gargantuan",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 20,
  "armor_desc": "",
  "hit_points": 313,
  "hit_dice": "19d20+114",
  "speed": {
    "walk": 0,
    "fly": 120
  },
  "strength": 18,
  "dexterity": 30,
  "constitution": 23,
  "intelligence": 10,
  "wisdom": 21,
  "charisma": 18,
  "strength_save": 1,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 1,
  "charisma_save": 1,
  "perception": 5,
  "skills": {
    "perception": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire, lightning, thunder; nonmagic B/P/S attacks",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "blindsight 120' (blind beyond), passive Perception 15",
  "languages": "Primordial",
  "challenge_rating": "21",
  "cr": 21,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "Uses Storm Blast then two Elemental Lashes."
    },
    {
      "name": "Create Elementals",
      "desc": "Magically creates up to 3d6 mephits 2 air earth fire or water elementals 2 ice elementals (Tome of Beasts 2) or 1 rockslide elemental (Tome of Beasts 3). Elementals arrive at start of her next turn acting as her allies and obeying her spoken commands. Elementals remain for 1 hr until she dies or until matriarch dismisses them as a bonus action. She can have any number of Elementals under her control at one time provided the combined total CR of the Elementals is no higher than 10."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Elemental Adaptation",
      "desc": "When she would take acid cold fire lightning or thunder she can change the element selected with Roiling Elements to that type of damage gaining immunity to that damage type including the triggering damage."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": [
    {
      "name": "Elemental Change",
      "desc": "Changes the damage immunity granted by Roiling Elements."
    },
    {
      "name": "Fly",
      "desc": "Up to half her flying speed with o provoking opportunity attacks."
    },
    {
      "name": "Create Elemental (2)",
      "desc": "Uses Create Elementals."
    },
    {
      "name": "Return to Mother (3)",
      "desc": "Absorbs Elemental within 10 ft. of her gaining temp hp equal to 10 times the CR of Elemental absorbed."
    }
  ],
  "special_abilities": [
    {
      "name": "Elemental Attacks",
      "desc": "Her weapon attacks are magical. When she hits with any weapon it deals extra 5d6 damage of Roiling Elements type."
    },
    {
      "name": "Elemental Aura",
      "desc": "At start of each of her turns each creature within 5 ft. of her takes 10 (3d6) damage of Roiling Elements type. Creature that touches her or hits her with melee attack while within 10 ft. of her: 10 (3d6) damage of Roiling Elements type. Nonmagical weapon that hits her is destroyed after dealing damage."
    },
    {
      "name": "Elemental Nature",
      "desc": "Doesn't require air food drink or sleep."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "Choose to succeed failed save."
    },
    {
      "name": "Magic Resistance",
      "desc": "Advantage: spell/magic effect saves."
    },
    {
      "name": "Roiling Elements",
      "desc": "At the start of each of her turns she chooses one of the following damage types: acid cold fire lightning or thunder. She has immunity to that damage type until the start of her next turn."
    },
    {
      "name": "Siege Monster",
      "desc": "Double damage to objects/structures."
    },
    {
      "name": "Elemental Lash",
      "desc": "Melee Weapon Attack: +17 to hit, 15 ft., one target, 32 (4d10+10) bludgeoning damage + 17 (5d6) damage of the type determined by Roiling Elements."
    },
    {
      "name": "Storm Blast",
      "desc": "The primordial matriarch emits elemental energy in a 90' cone. Each creature in the area: 21 (6d6) damage of the type determined by Roiling Elements and suffers one of the following effects depending on the damage type (DC 20 Dex half damage and no additional effect unless specified below).Acid Blast Fail: creature is covered in acid. At the start of each of its turns it takes 7 (2d6) acid until it or another creature takes an action to scrape or wash off the acid.Cold Blast Fail: creature is restrained by ice until end of its next turn or until it or another creature takes an action to break it free. Success: creature's speed is reduced by 10 ft. until end of its next turn.Fire Blast Fail: creature catches fire. Until it or another creature takes an action to douse the fire creature takes 7 (2d6) fire at the start of each of its turns.Lightning Blast Fail: creature incapacitated until end of its next turn. Succcess: creature can't take reactions until start of its next turn.Thunder Blast Fail: creature is deafened for 1 min. At the end of each of its turns a deafened creature can repeat the save ending deafness on itself on a success. Success: creature is deafened until the end of its next turn."
    }
  ],
  "spell_list": [],
  "page_no": 318,
  "environments": [],
  "img_main": null,
  "document__slug": "tob3",
  "document__title": "Tome of Beasts 3",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-3-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob3_primordial-matriarch/"
}