{
  "slug": "qwyllion",
  "desc": "_These hideous, reeking creatures resemble toothless, cadaverous hags, their large eyes glowing with unearthly green light, and their fingers tipped with ragged claws._  \n**Twisted Nymphs.** Qwyllion (the name means “polluter” in Old Elvish) are nymphs who have been twisted by the corrupted mana of magical wastelands or warped alchemical experiments into baleful versions of their former selves.  \n**Frighten Animals.** Besides making them hideously ugly, the transformation leaves them with a deadly gaze attack and the ability to dominate a living creature with a mere glance. Animals refuse to approach within 20 feet of them.  \n**Goblin Mercenaries.** Qwyllion and their dominated thralls and enslaved specters are sometimes engaged by goblin sorcerers and evil mages to guard desecrated temples and despoiled gardens. The terms and payments for these arrangements vary wildly from one qwyllion to the next. Anyone who dares to employ a qwyllion must be constantly vigilant, because these creatures are prone to renege on any agreement eventually.",
  "name": "Qwyllion",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 110,
  "hit_dice": "13d8+52",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 20,
  "constitution": 19,
  "intelligence": 12,
  "wisdom": 13,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 6,
  "perception": 4,
  "skills": {
    "acrobatics": 11,
    "perception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Common, Goblin, Infernal, Sylvan, Void Speech",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The qwyllion uses its deadly gaze if it can, and makes two claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 24 (3d12 + 5) slashing damage.",
      "attack_bonus": 8,
      "damage_dice": "3d12"
    },
    {
      "name": "Deadly Gaze (recharge 5-6)",
      "desc": "The qwyllion turns its gaze against a single creature within 20 feet of the qwyllion. The target must succeed on a DC 14 Constitution saving throw or take 16 (3d8 + 3) necrotic damage and be incapacitated until the start of the qwyllion's next turn. A humanoid slain by a qwyllion's death gaze rises 2d4 hours later as a specter under the qwyllion's control."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "the qwyllion's innate casting ability is Charisma (spell save DC 14). She can innately cast the following spells, requiring no material components:\n\n3/day each: dominate person (range 20 feet), shatter"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Disruptive",
      "desc": "Because of the qwyllion's nauseating nature, spellcasters have disadvantage on concentration checks while within 40 feet of the qwyllion."
    },
    {
      "name": "Nauseating Aura",
      "desc": "The qwyllion is nauseatingly corrupt. Any creature that starts its turn within 20 feet of the qwyllion must succeed on a DC 14 Constitution saving throw or be poisoned for 1d8 rounds. If a creature that's already poisoned by this effect fails the saving throw again, it becomes incapacitated instead, and a creature already incapacitated by the qwyllion drops to 0 hit points if it fails the saving throw. A successful saving throw renders a creature immune to the effect for 24 hours. Creatures dominated by the qwyllion are immune to this effect."
    }
  ],
  "spell_list": [],
  "page_no": 316,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_qwyllion/"
}