{
  "slug": "rat-king",
  "desc": "_A great knot of scabrous rats scrabbles together as a mass, with skulls, bones, and flesh entangled in the whole. Teeth, eyes, and fur all flow as a single disturbing rat swarm walking on two legs._  \n**Fused at the Tail.** A rat king forms when dozens of rats twist their tails together in a thick knot of bone and lumpy cartilage. Its numbers and powers grow quickly.  \n**Rule Sewers and Slums.** The rat king is a cunning creature that stalks city sewers, boneyards, and slums. Some even command entire thieves’ guilds or hordes of beggars that give it obeisance. They grow larger and more powerful over time until discovered.  \n**Plague and Dark Magic.** The rat king is the result of plague infused with twisted magic, and a malignant ceremony that creates one is called “Enthroning the Rat King.” Rats afflicted with virulent leavings of dark magic rites or twisted experiments become bound to one another. As more rats add to the mass, the creature’s intelligence and force of will grow, and it invariably goes quite mad.",
  "name": "Rat King",
  "size": "Medium",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 76,
  "hit_dice": "9d8+36",
  "speed": {
    "walk": 30,
    "burrow": 20
  },
  "strength": 6,
  "dexterity": 16,
  "constitution": 18,
  "intelligence": 11,
  "wisdom": 15,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, slashing",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, frightened, paralyzed, petrified, prone, restrained, stunned",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "Common, Thieves' Cant",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The rat king makes four bite attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) piercing damage, and a bitten creature must succeed on a DC 15 Constitution saving throw or be infected with a disease. A diseased creature gains one level of exhaustion immediately. When the creature finishes a long rest, it must repeat the saving throw. On a failure, the creature gains another level of exhaustion. On a success, the disease does not progress. The creature recovers from the disease if its saving throw succeeds after two consecutive long rests or if it receives a lesser restoration spell or comparable magic. The creature then recovers from one level of exhaustion after each long rest.",
      "attack_bonus": 6,
      "damage_dice": "2d6"
    },
    {
      "name": "Summon Swarm (1/Day)",
      "desc": "The rat king summons three swarms of rats. The swarms appear immediately within 60 feet of the rat king. They can appear in spaces occupied by other creatures. The swarms act as allies of the rat king. They remain for 1 hour or until the rat king dies."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Absorption",
      "desc": "When the rat king does damage to a rat or rat swarm, it can absorb the rat, or part of the swarm, into its own mass. The rat king regains hit points equal to the damage it did to the rat or swarm."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Keen Smell",
      "desc": "The rat king has advantage on Wisdom (Perception) checks that rely on smell."
    },
    {
      "name": "Plague of Ill Omen",
      "desc": "The rat king radiates a magical aura of misfortune in a 30-foot radius. A foe of the rat king that starts its turn in the aura must make a successful DC 14 Charisma saving throw or be cursed with bad luck until the start of its next turn. When a cursed character makes an attack roll, ability check, or saving throw, it must subtract 1d4 from the result."
    }
  ],
  "spell_list": [],
  "page_no": 318,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_rat-king/"
}