{
  "slug": "scrofin",
  "desc": "This upright, muscular boar has short, brown fur. Though it stands on cloven hooves, its arms end in oversized fists._  \n**Seeker of Champions.** The scrofin is a powerfully built creature that seeks to find a worthy challenger for a wrestling challenge. A winner is declared when one creature holds its opponent in a grapple for 30 seconds. The scrofin is aware its natural gifts make it a formidable foe and feels duty-bound to make others aware of its advantages. An honorable battle is its highest goal, and it ensures that no great harm comes to its opponent during the contest, immediately relenting if its opponent submits.  \n**Short Tempered.** If the scrofin feels its opponent is fighting dishonorably or if something unrelated to the wrestling match harms it (a cast spell, a hidden weapon, or similar), it goes berserk at the betrayal. In normal combat situations, it loses its temper when it takes too many injuries. The scrofin can calm itself but only chooses to when it believes its opponents are truly contrite about breaking its trust or harming it.  \n**Outcast from the Courts.** The scrofins’ sense of honor is at odds with many of their fellow fey, regardless of court, who believe exploiting any advantage in a situation is acceptable. This coupled with what the fey see as the scrofins’ tiresome insistence on proving their physical superiority makes them unwelcome in many fey courts. For their part, scrofins are content to walk the mortal world in search of champions.",
  "name": "Scrofin",
  "size": "Medium",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 13,
  "armor_desc": "natural armor",
  "hit_points": 68,
  "hit_dice": "8d8+32",
  "speed": {
    "walk": 40
  },
  "strength": 16,
  "dexterity": 13,
  "constitution": 18,
  "intelligence": 9,
  "wisdom": 9,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 9",
  "languages": "Common, Sylvan",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The scrofin makes two attacks: one with its fist and one with its gore or two with its fists."
    },
    {
      "name": "Fist",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d6 + 3) bludgeoning damage, and the target is grappled (escape DC 13). The scrofin can grapple only one target at a time. If the scrofin scores a critical hit, the target must succeed on a DC 13 Constitution saving throw or become stunned until the end of its next turn.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Gore",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 7 (1d8 + 3) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "1d8+3"
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Quick to Anger (Recharges after a Short or Long Rest)",
      "desc": "If the scrofin is wrestling a foe as part of a challenge and takes damage, or when it is reduced to half its hp maximum, it becomes angry. While angry, the scrofin has advantage on melee attack rolls and on saving throws against spells or effects that would charm or frighten it or make it unconscious, and it has resistance to bludgeoning damage. It remains angry for 1 minute, or until it is knocked unconscious. Alternatively, it can end its anger as a bonus action."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Expert Wrestler",
      "desc": "The scrofin can grapple creatures that are two sizes larger than itself and can move at its full speed when dragging a creature it has grappled. If the scrofin grapples a Medium or smaller creature, the target has disadvantage on its escape attempts. In addition, the scrofin has advantage on ability checks and saving throws made to escape a grapple or end the restrained condition."
    },
    {
      "name": "Relentless (Recharges after a Short or Long Rest)",
      "desc": "If the scrofin takes 10 damage or less that would reduce it to 0 hp, it is reduced to 1 hp instead."
    }
  ],
  "spell_list": [],
  "page_no": 319,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_scrofin/"
}