{
  "slug": "suturefly",
  "desc": "_These darting creatures resemble dragonflies, but with three pairs of gossamer wings and a body made from splintered wood. Flashes of bright colors run along their bodies._  \n**Sew Mouths Shut.** Forest folk rarely speak when sutureflies dart through the trees, because these creatures listen for lies and sew any offender’s mouth, nose, and eyes shut. Some say the old woods hide nothing but liars, and that is why the deepest forest is shrouded in silence. Others say that the forest uses sutureflies to smother those who break its covenants or reveal its secrets.  \nAdventurers see a suturefly’s handiwork more often than they glimpse one of the creatures directly: corpses with mouths and noses stitched shut lie in the underbrush, mysterious children whose mouths are ringed with black puncture marks observe intruders from afar, and dryads step from trees, their eyes sewn shut against the evils of civilization.  \n**Seek Out Curses.** Numerous suturefly varieties exist. Some attack based on verbal triggers other than lies. Black‑banded sutureflies, for instance, detect curses and religious blasphemies.  \nWhen attacking, sutureflies dart from hiding to gain surprise. Once they sew someone’s mouth closed, they target the same victim’s nose, unless threatened by another opponent. Sutureflies attack until they have sewn all of their opponents’ mouths, eyes and noses closed or until they’re destroyed.",
  "name": "Suturefly",
  "size": "Tiny",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "",
  "hit_points": 7,
  "hit_dice": "3d4",
  "speed": {
    "hover": true,
    "walk": 10,
    "fly": 40
  },
  "strength": 1,
  "dexterity": 19,
  "constitution": 10,
  "intelligence": 1,
  "wisdom": 12,
  "charisma": 4,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "-",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Sew",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 1 piercing damage, and the suturefly sews the target's mouth, nose, or eye closed. With supernatural speed, the suturefly repeatedly pierces the target's face, each time threading a loop of the target's own skin through the previous hole. These skin loops rapidly blacken, shrink, and draw the orifice tightly closed. It takes two actions and a sharp blade to sever the loops and reopen the orifice, and the process causes intense pain and 2 slashing damage. A victim whose mouth and nose have been sewn shut begins suffocating at the start of his or her next turn.",
      "attack_bonus": 6,
      "damage_dice": "1"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Camouflage",
      "desc": "A suturefly in forest surroundings has advantage on Dexterity (Stealth) checks."
    },
    {
      "name": "Detect Blasphemy",
      "desc": "The most common variety of suturefly attacks any creature that blasphemes aloud, which it can detect at a range of 100 feet unless the blasphemer makes a successful DC 13 Charisma saving throw."
    }
  ],
  "spell_list": [],
  "page_no": 372,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_suturefly/"
}