{
  "slug": "tarrasque-a5e",
  "desc": "",
  "name": "Tarrasque",
  "size": "Titanic",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "",
  "armor_class": 25,
  "armor_desc": "",
  "hit_points": 1230,
  "hit_dice": "60d20+600",
  "speed": {
    "walk": 60,
    "burrow": 30
  },
  "strength": 30,
  "dexterity": 12,
  "constitution": 30,
  "intelligence": 4,
  "wisdom": 14,
  "charisma": 14,
  "strength_save": 19,
  "dexterity_save": 10,
  "constitution_save": 19,
  "intelligence_save": 6,
  "wisdom_save": 11,
  "charisma_save": 11,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "fire, poison; damage from nonmagical weapons",
  "condition_immunities": "charmed, frightened, paralyzed, petrified, poisoned",
  "senses": "blindsight 120 ft., tremorsense 60 ft., passive Perception 12",
  "languages": "",
  "challenge_rating": "30",
  "cr": 30,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The tarrasque attacks with its bite  claw  horns  and tail. It can use Swallow instead of its bite. If its bloodied  it also recharges and then uses Radiant Breath."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 42 (5d12 + 10) piercing damage. If the target is a creature  it is grappled (escape DC 27). Until this grapple ends  the target is restrained and the tarrasque can't bite a different creature."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +19 to hit, reach 15 ft., one target. Hit: 32 (5d8 + 10) slashing damage."
    },
    {
      "name": "Horns",
      "desc": "Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 37 (5d10 + 10) piercing damage."
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +19 to hit, reach 20 ft., one target. Hit: 27 (5d6 + 10) bludgeoning damage. If the target is a Huge or smaller creature  it falls prone."
    },
    {
      "name": "Swallow",
      "desc": "The tarrasque makes a bite attack against a Large or smaller creature it is grappling. If the attack hits  the target is swallowed and the grapple ends. A swallowed creature has total cover from attacks from outside the tarrasque  it is blinded and restrained  and it takes 35 (10d6) acid damage and 35 (10d6) bludgeoning damage at the start of each of the tarrasques turns."
    },
    {
      "name": "If a swallowed creature deals 70 or more damage to the tarrasque in a single turn, or if the tarrasque dies, the tarrasque vomits up all swallowed creatures",
      "desc": ""
    },
    {
      "name": "Radiant Breath (Recharge 5-6)",
      "desc": "The tarrasque exhales radiant energy in a 90-foot cone. Each creature in that area makes a DC 27 Constitution saving throw  taking 105 (30d6) radiant damage on a failed save or half damage on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": [
    {
      "name": "The tarrasque can take 3 legendary actions",
      "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."
    },
    {
      "name": "Attack",
      "desc": "The tarrasque attacks with its claw or tail."
    },
    {
      "name": "Move",
      "desc": "The tarrasque moves up to half its Speed."
    },
    {
      "name": "Roar",
      "desc": "Each creature of the tarrasques choice within 120 feet makes a DC 19 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, with disadvantage if the tarrasque is in line of sight, ending the effect on itself on a success. If it succeeds on a saving throw or the effect ends on it, it is immune to the tarrasques Roar for 24 hours."
    },
    {
      "name": "Elite Recovery (While Bloodied)",
      "desc": "The tarrasque ends one negative effect currently affecting it. It can use this action as long as it has at least 1 hit point, even while unconscious or incapacitated."
    },
    {
      "name": "Chomp (Costs 2 Actions)",
      "desc": "The tarrasque makes a bite attack or uses Swallow."
    },
    {
      "name": "Inescapable Earth (Costs 3 Actions)",
      "desc": "Each flying creature or object within 300 feet falls and its flying speed is reduced to 0 until the start of the tarrasques next turn."
    }
  ],
  "special_abilities": [
    {
      "name": "Astounding Leap",
      "desc": "The tarrasques high jump distance is equal to its Speed."
    },
    {
      "name": "Bloodied Regeneration",
      "desc": "While the tarrasque is bloodied, it regains 50 hit points at the start of each of its turns. A wish spell can suppress this trait for 24 hours. The tarrasque dies only if it starts its turn with 0 hit points and doesnt regenerate."
    },
    {
      "name": "Immortal Nature",
      "desc": "The tarrasque doesnt require air, sustenance, or sleep."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the tarrasque fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Magic Resistance",
      "desc": "The tarrasque has advantage on saving throws against spells and magical effects."
    },
    {
      "name": "Reflective Carapace",
      "desc": "When the tarrasque is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 3, the tarrasque is unaffected. On a 4 to 6, the tarrasque is unaffected, and the spell is reflected back, targeting the caster as if it originated from the tarrasque."
    },
    {
      "name": "Siege Monster",
      "desc": "The tarrasque deals double damage to objects and structures."
    }
  ],
  "spell_list": [],
  "page_no": 401,
  "environments": [],
  "img_main": null,
  "document__slug": "menagerie",
  "document__title": "Level Up Advanced 5e Monstrous Menagerie",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://www.levelup5e.com",
  "v2_converted_path": "/v2/creatures/mmenag_tarrasque/"
}