{
  "slug": "tidehunter",
  "desc": "Emerging from the surf, this massive crab-like beast has a hard, blue shell covered in barnacles. It holds a net of seaweed between its barbed claws, and a look of intelligence gleams in its elliptical, crimson eyes._  \n**Lurkers in the Shallows.** The tidehunter is an ambush hunter, using its coloration to surprise prey that venture into the shallows. Tidehunters are normally found along coasts with plentiful beaches and underwater vegetation, but some can be found in large lakes and river systems close to the open ocean. Most tidehunters are more than 20 feet across and are powerful enough to overcome a hunter shark or small whale with ease. They have few natural predators, their intelligence and guile making them challenging prey.  \n**Net Weavers.** Tidehunters can weave nets out of kelp, seaweed, and other fibrous plant material with ease, constructing nets in a matter of minutes with the weirdly hooked barbs on their claws. Their nets are strong and can be thrown with great accuracy over a large distance. Indeed, even those on dry land are not immune to the tidehunter’s attacks, and more than one human has been hauled into the surging tide from the apparent safety of the beach.  \n**Fishing Buddies.** While fisherfolk and tidehunters are normally at odds, a tidehunter will sometimes enter into an unspoken agreement with a group of fisherfolk, sharing the spoils of the sea while keeping out of each other’s way.",
  "name": "Tidehunter",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 133,
  "hit_dice": "14d10+56",
  "speed": {
    "swim": 40,
    "walk": 20
  },
  "strength": 19,
  "dexterity": 14,
  "constitution": 18,
  "intelligence": 5,
  "wisdom": 12,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "—",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The tidehunter makes three attacks, only one of which can be with its net. It can use Reel in place of two claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage, and the target is grappled (escape DC 15). The tidehunter has two claws, each of which can grapple only one target.",
      "attack_bonus": 7,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Net",
      "desc": "Ranged Weapon Attack: +7 to hit, range 20/60 ft., one target. Hit: A Large or smaller creature hit by the net is restrained until it is freed. The net has no effect on creatures that are formless, or creatures that are Huge or larger. A creature can use its action to make a DC 15 Strength check, freeing itself or another creature within its reach on a success. Dealing 15 slashing damage to the net (AC 13) also frees the creature without harming it, ending the effect and destroying the net."
    },
    {
      "name": "Reel",
      "desc": "The tidehunter pulls one creature restrained by its net up to 20 feet straight toward it. If the target is within 10 feet of the tidehunter at the end of this pull, the tidehunter can make one claw attack against it as a bonus action."
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Entangle Weapon",
      "desc": "When the tidehunter is targeted by a melee weapon attack, the attacker must succeed on a DC 16 Dexterity saving throw or miss the attack as the tidehunter uses its net to interfere with the weapon. The tidehunter must have an empty net to use this reaction."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The tidehunter can breathe air and water."
    },
    {
      "name": "Net Maker",
      "desc": "With 1 minute of work, the tidehunter can create a net out of seaweed, rope, or similar material. The tidehunter typically carries 2 nets."
    },
    {
      "name": "Underwater Camouflage",
      "desc": "The tidehunter has advantage on Dexterity (Stealth) checks made while underwater."
    }
  ],
  "spell_list": [],
  "page_no": 348,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_tidehunter/"
}