{
  "slug": "venomous-mummy",
  "desc": "_This shambling corpse warrior is draped in stained linen wrappings. Green liquid drips from rents in the fabric._  \n**Servant of the Scorpion Goddess.** These mummies are crafted by Selket’s faithful to guard holy sites and tombs and to serve as agents of the goddess’s retribution. Should Selket or her faithful feel themselves slighted by an individual or a community, they perform dangerous rituals to awaken these creatures from the crypts of her temples. Venomous mummies delight in wreaking deadly vengeance against those who disrespect the goddess.  \n**Death to Blasphemers.** In most cases, retribution is limited to people who actually undertook the acts of blasphemy, but if her priests determine that an entire community has grown heretical and earned Selket’s wrath, they may set mummies loose against the entire populace.  \n**Deadly Smoke.** Burning a venomous mummy is a terrible idea; the smoke of their immolation is toxic.",
  "name": "Venomous Mummy",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 11,
  "armor_desc": "natural armor",
  "hit_points": 58,
  "hit_dice": "9d8+18",
  "speed": {
    "walk": 20
  },
  "strength": 16,
  "dexterity": 8,
  "constitution": 15,
  "intelligence": 7,
  "wisdom": 10,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 2,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "fire",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "the languages it knew in life",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Venomous Fist",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage plus 10 (3d6) necrotic damage. If the target is a creature, it must succeed on a DC 12 Constitution saving throw or be affected by the Selket's venom curse (see above).",
      "attack_bonus": 5,
      "damage_dice": "2d6+7"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Selket's Venom",
      "desc": "The venomous mummy's body and wrappings are magically imbued with substances that are highly toxic. Any creature that comes in physical contact with the venomous mummy (e.g., touching the mummy barehanded, grappling, using a bite attack) must succeed on a DC 12 Constitution saving throw or be poisoned with Selket's venom. The poisoned target takes 3 (1d6) poison damage every 10 minutes. Selket's venom is a curse, so it lasts until ended by the remove curse spell or comparable magic."
    },
    {
      "name": "Toxic Smoke",
      "desc": "The venomous mummy's poison-imbued wrappings and flesh create toxic fumes when burned. If a venomous mummy takes fire damage, it is surrounded by a cloud of toxic smoke in a 10-foot radius. This cloud persists for one full round. A creature that starts its turn inside the cloud or enters it for the first time on its turn takes 14 (4d6) poison damage, or half damage with a successful DC 12 Constitution saving throw."
    }
  ],
  "spell_list": [],
  "page_no": 299,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_venomous-mummy/"
}