{
  "slug": "vine-golem",
  "desc": "A humanoid-shaped tangle of green vines shambles through a portal and gives a friendly wave._  \n**Druid Servants.** Vine golems are constructs created by druids for use as scouts and guardians. These plant-like constructs maintain a psychic connection with their creators, who can see through their eyes and cast spells through them. The golem-creator connection is maintained across the planes of the multiverse and is severed only if the construct or the druid dies. The vine golem is made from a variety of rare plants and flowers found only in the depths of old-growth forests. The process of creating a vine golem is closely guarded by cabals of druids, who will sometimes gift worthy druids with the knowledge in the form of a manual of vine golems.  \n**Golems without Creators.** When a vine golem’s creator dies, the construct carries out the druid’s final orders and then retreats to the nearest wilderness. Driven by a psyche fractured from the loss of its creator, the vine golem guards the animals and plants of its chosen home with extreme prejudice, attacking all intruders, regardless of any previous affiliation they might have had with its creator.  \n**Construct Nature.** A vine golem doesn’t require air, food, drink, or sleep.",
  "name": "Vine Golem",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": null,
  "hit_points": 67,
  "hit_dice": "9d8+27",
  "speed": {
    "climb": 30,
    "walk": 30
  },
  "strength": 12,
  "dexterity": 18,
  "constitution": 17,
  "intelligence": 6,
  "wisdom": 10,
  "charisma": 5,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 2,
  "skills": {
    "perception": 2,
    "stealth": 6
  },
  "damage_vulnerabilities": "slashing",
  "damage_resistances": "bludgeoning and piercing from nonmagical attacks not made with adamantine weapons",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "darkvision 60 ft., passive Perception 12",
  "languages": "understands the languages of its creator but can’t speak",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vine golem makes two thorned vine attacks."
    },
    {
      "name": "Thorned Vine",
      "desc": "Melee Weapon Attack: +6 to hit, reach 15 ft., one target. Hit: 8 (1d8 + 4) piercing damage, and the target must succeed on a DC 14 Strength saving throw or be pulled up to 10 feet toward the vine golem.",
      "attack_bonus": 6,
      "damage_dice": "1d8+4"
    },
    {
      "name": "Thorned Embrace",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one Medium or smaller creature. Hit: 13 (2d8 + 4) piercing damage, and the target is grappled (escape DC 11). Until the grapple ends, the target is restrained, and the vine golem can't embrace another target.",
      "attack_bonus": 6,
      "damage_dice": "2d8+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Bound",
      "desc": "The vine golem is psychically bound to its creator and can communicate telepathically with its creator as long as neither is incapacitated. In addition, each knows the distance to and direction of the other. The golem and its creator don't have to be on the same plane of existence to communicate telepathically, but they do have to be on the same plane to know each other's distance and direction."
    },
    {
      "name": "Creator's Eyes and Ears",
      "desc": "As a bonus action, the creator can see through the vine golem's eyes and hear what it hears until the start of the creator's next turn, gaining the benefits of the vine golem's darkvision. During this time, the creator is deaf and blind with regard to its own senses. While using the construct's senses, the creator can cast a spell through the vine golem, using those senses to target the spell. The range, area, and effect of the spell are calculated as if the spell originated from the vine golem, not the master, though the master must still cast the spell on the master's turn. Spells that require concentration must be maintained by the master."
    },
    {
      "name": "Immutable Form",
      "desc": "The vine golem is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Magic Resistance",
      "desc": "The vine golem has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Plant Camouflage",
      "desc": "The vine golem has advantage on Dexterity (Stealth) checks it makes in any terrain that contains ample obscuring plant life."
    }
  ],
  "spell_list": [],
  "page_no": 181,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_vine-golem/"
}