{
  "slug": "water_elemental_bf",
  "desc": "",
  "name": "Water Elemental",
  "size": "Large",
  "type": "Elemental",
  "subtype": "",
  "group": "Elementals",
  "alignment": "",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 104,
  "hit_dice": "",
  "speed": {
    "walk": 30,
    "swim": 90
  },
  "strength": 18,
  "dexterity": 14,
  "constitution": 18,
  "intelligence": 6,
  "wisdom": 10,
  "charisma": 8,
  "strength_save": 4,
  "dexterity_save": 2,
  "constitution_save": 4,
  "intelligence_save": -2,
  "wisdom_save": 0,
  "charisma_save": -1,
  "perception": 13,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "Elemental Resilience",
  "damage_immunities": "acid,Elemental Resilience",
  "condition_immunities": "",
  "senses": "darkvision 60 ft.",
  "languages": "Aquan",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The water elemental makes two Water Tendril or Water Bolt attacks. If both Water Tendril attacks hit one creature, it can use Whelm on the target, if available."
    },
    {
      "name": "Water Tendril",
      "desc": "_Melee Weapon Attack:_ +7 to hit, reach 10 ft., one target. _Hit:_ 17 (3d8+4) bludgeoning damage, and the target is grappled (escape DC 15) if it is Large or smaller. The water elemental can have up to three targets grappled at a time."
    },
    {
      "name": "Water Bolt",
      "desc": "_Ranged Weapon Attack:_ +5 to hit, range 30/120 ft., one target. _Hit:_ 16 (4d6+2) bludgeoning damage."
    },
    {
      "name": "Whelm (Recharge 4-6)",
      "desc": "The water elemental envelops one creature it is grappling, and the grapple ends. While enveloped, the target is restrained, unable to breathe unless it can breathe water, can't be hit by the elemental's Water Tendril, and it takes 9 (2d8) bludgeoning damage at the start of each of the elemental's turns.<br>When the elemental moves, the enveloped creature moves with it. The elemental can have only one creature enveloped at a time. A creature within 5 feet of the elemental, including the target, can take its action to free the target from the elemental by succeeding on a DC 15 STR check."
    }
  ],
  "bonus_actions": [
    {
      "name": "Purify Blood (3/Day)",
      "desc": "The water elemental touches a willing creature that isn't a Construct or Undead. The target is cured of the poisoned condition and of any disease afflicting it."
    }
  ],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Elemental Nature",
      "desc": "The elemental doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Elemental Resilience",
      "desc": "The elemental is resistant to bludgeoning, piercing, and slashing damage from nonmagical attacks. In addition, it is immune to poison damage, to exhaustion, and to the grappled, paralyzed, petrified, poisoned, prone, restrained, and unconscious conditions."
    },
    {
      "name": "Freeze",
      "desc": "If the elemental takes cold damage, it partially freezes, and its speed is reduced by 20 feet until the end of its next turn."
    },
    {
      "name": "Purify Water",
      "desc": "If the water elemental sits in a body of slow-flowing or standing water, such as a spring, small creek, or lake, for at least 1 hour, the water becomes purified and rendered free of poison and disease. In slow-flowing water, this purification fades 1 hour after the elemental leaves the water. In standing water, this purification lasts until a contaminant enters the water while the elemental isn't in it."
    },
    {
      "name": "Water Form",
      "desc": "The elemental can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Water Camouflage",
      "desc": "The water elemental's Stealth is 17 while in a Medium or larger body of water."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_water-elemental/"
}