{
  "slug": "wereshark",
  "desc": "The twisted form of a humanoid shark hunches over, its grin showing rows of jagged teeth. Fresh blood drips from its mouth as it clutches a trident in powerful hands._  \nIn humanoid form, weresharks tend to be powerfully-muscled and broad, with little body hair. They are solitary hunters who sometimes stalk and eat each other. If a wereshark spreads its curse, it’s likely because the lycanthrope made a mistake and let potential prey get away.  \n**Voracious Appetites.** Weresharks are savage predators who, driven by voracious appetites, devour anything they come across. Aggressive in all forms, weresharks prefer to spend their time beneath the waves, hunting fish, seals, and other prey. They have no qualms about attacking humanoids or boats, particularly fishing vessels, which contain even more food for the lycanthrope to consume.  \n**Obsessed Predators.** Weresharks become obsessed with prey that gets away from them. A wereshark can stalk an individual through the seas and over land for months, leaving a path of destruction behind it, just to get a taste of what it missed.",
  "name": "Wereshark",
  "size": "Large",
  "type": "Humanoid",
  "subtype": "human, shapechanger",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 11,
  "armor_desc": "in humanoid form, 12 (natural armor) in shark and hybrid form",
  "hit_points": 90,
  "hit_dice": "12d8+36",
  "speed": {
    "walk": 30
  },
  "strength": 19,
  "dexterity": 13,
  "constitution": 17,
  "intelligence": 11,
  "wisdom": 12,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
  "condition_immunities": "",
  "senses": "blindsight 30 ft. (shark and hybrid form only), passive Perception 14",
  "languages": "Common (can’t speak in shark form)",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "In humanoid or hybrid form, the wereshark makes three trident attacks."
    },
    {
      "name": "Bite (Shark or Hybrid Form Only)",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) piercing damage. If the target is a humanoid, it must succeed on a DC 14 Constitution saving throw or be cursed with wereshark lycanthropy.",
      "attack_bonus": 7,
      "damage_dice": "2d10+4"
    },
    {
      "name": "Trident (Humanoid or Hybrid Form Only)",
      "desc": "Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 7 (1d6 + 4) piercing damage, or 8 (1d8 + 4) piercing damage if used with two hands to make a melee attack.",
      "attack_bonus": 7,
      "damage_dice": "1d6+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Blood Frenzy",
      "desc": "The wereshark has advantage on melee attack rolls against any creature that doesn't have all its hp."
    },
    {
      "name": "Hold Breath (Hybrid Form Only)",
      "desc": "While out of water, the wereshark can hold its breath for 1 hour."
    },
    {
      "name": "Shapechanger",
      "desc": "The wereshark can use its action to polymorph into a Large shark-humanoid hybrid or into a Large hunter shark, or back into its true form, which is humanoid. Its statistics, other than its size and AC, are the same in each form, with the exceptions that only its shark and hybrid forms retain its swimming speed, and its shark form doesn't retain its walking speed. Any equipment it is wearing or carrying isn't transformed. The wereshark reverts to its true form if it dies."
    },
    {
      "name": "Water Breathing (Shark or Hybrid Form Only)",
      "desc": "The wereshark can breathe only underwater."
    }
  ],
  "spell_list": [],
  "page_no": 266,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_wereshark/"
}