{
  "slug": "zalikum",
  "desc": "Waves of heat shimmer around a gigantic vulturelike creature made of sand. The sand crackles with dark energy, and the creature’s eyes burn with malign intelligence._  \nAn enormous vulture forged from sand and malignant power, a zalikum is created by mages who capture souls of the damned and infuse them into the superheated sands of the desert.  \n**Abyssal Ties.** The souls infusing a zalikum are from the Abyss. A zalikum’s creator can gather these souls from the Abyss themselves, but, more often, the creator makes a deal with a demon in exchange for the souls. Unfortunately for the creator, the demon usually hands over souls that aren’t the easiest to control, leading many creators to die at the talons of their zalikums. Such destruction frees the demon from its bonds, releasing it and the zalikum into the world.  \n**Innumerable Lives.** The souls infusing the sand of the zalikum can reform it after it has been destroyed. This process consumes some of the power of the souls, forcing the zalikum to devour more souls to fuel further rebirths.  \n**Construct Nature.** A zalikum doesn’t require air, food, drink, or sleep.",
  "name": "Zalikum",
  "size": "Huge",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 103,
  "hit_dice": "9d12+45",
  "speed": {
    "walk": 20,
    "fly": 80
  },
  "strength": 19,
  "dexterity": 17,
  "constitution": 21,
  "intelligence": 8,
  "wisdom": 10,
  "charisma": 15,
  "strength_save": null,
  "dexterity_save": 6,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 5,
  "perception": 3,
  "skills": {
    "perception": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "fire, necrotic, poison, psychic",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "darkvision 120 ft., passive Perception 13",
  "languages": "understands the languages of its creator but can’t speak",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The zalikum makes one beak attack and one talon attack."
    },
    {
      "name": "Beak",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 13 (2d8 + 4) piercing damage plus 3 (1d6) fire damage and 3 (1d6) necrotic damage. If a creature is slain by this attack, its body crumbles to sand, and the zalikum stores its soul. The creature can be restored to life only if the zalikum is destroyed and can't rejuvenate (see the Rejuvenation trait).",
      "attack_bonus": 7,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Talon",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage plus 3 (1d6) fire damage and 3 (1d6) necrotic damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Death-infused Desert Breath (Recharge 6)",
      "desc": "The zalikum exhales superheated sand infused with the power of damned souls in a 30-foot cone. Each creature in the area must make a DC 16 Dexterity saving throw, taking 14 (4d6) fire damage and 14 (4d6) necrotic damage on a failed save, or half as much damage on a successful one. If a creature's saving throw fails by 5 or more, the creature also suffers one level of exhaustion."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Flyby",
      "desc": "The zalikum doesn't provoke opportunity attacks when it flies out of an enemy's reach."
    },
    {
      "name": "Ghastly Heated Body",
      "desc": "A creature that touches the zalikum or hits it with a melee attack while within 5 feet of it takes 3 (1d6) fire damage and 3 (1d6) necrotic damage."
    },
    {
      "name": "Rejuvenation",
      "desc": "The zalikum can store the souls of up to 3 victims inside it at one time. If it has at least 1 soul, a destroyed zalikum gains a new body in 1d10 days, regaining all its hp and becoming active again. The new body appears within 5 feet of its sandy remains. If its sandy remains are soaked with holy water and buried in consecrated ground, its trapped souls are freed, and the zalikum can't rejuvenate."
    }
  ],
  "spell_list": [],
  "page_no": 382,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_zalikum/"
}