{
  "slug": "adult_silver_dragon_bf",
  "desc": "",
  "name": "Adult Silver Dragon",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": "Dragons",
  "alignment": "",
  "armor_class": 19,
  "armor_desc": "natural armor",
  "hit_points": 267,
  "hit_dice": "",
  "speed": {
    "walk": 40,
    "fly": 80
  },
  "strength": 26,
  "dexterity": 20,
  "constitution": 34,
  "intelligence": 16,
  "wisdom": 24,
  "charisma": 28,
  "strength_save": 8,
  "dexterity_save": 5,
  "constitution_save": 12,
  "intelligence_save": 3,
  "wisdom_save": 7,
  "charisma_save": 9,
  "perception": 22,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "cold",
  "condition_immunities": "",
  "senses": "darkvision 120 ft., keensense 60 ft.",
  "languages": "Common,Draconic",
  "challenge_rating": "16",
  "cr": 16,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks. It can replace its Bite attack with a use of Paralyzing Breath, if available."
    },
    {
      "name": "Bite",
      "desc": "_Melee Weapon Attack:_ +13 to hit, reach 10 ft., one target. _Hit:_ 19 (2d10+8) piercing damage."
    },
    {
      "name": "Claw",
      "desc": "_Melee Weapon Attack:_ +13 to hit, reach 5 ft., one target. _Hit:_ 15 (2d6+8) slashing damage."
    },
    {
      "name": "Tail",
      "desc": "_Melee Weapon Attack:_ +13 to hit, reach 15 ft., one target. _Hit:_ 17 (2d8+8) bludgeoning damage."
    },
    {
      "name": "Frightful Presence",
      "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."
    },
    {
      "name": "Cold Breath (Recharge 5-6)",
      "desc": "The dragon exhales an icy blast in a 60-foot cone. Each creature in that area must make a DC 20 CON save, taking 58 (13d8) cold damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Paralyzing Breath (Recharge 6)",
      "desc": "As the **silver dragon wyrmling**, except it is a 60-foot cone, and the save DC is 20."
    }
  ],
  "bonus_actions": [
    {
      "name": "Change Shape",
      "desc": "The dragon magically transforms into a Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Dragon. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the dragon's choice). It reverts to its true form if it dies. In a new form, the dragon retains its Legendary Resistance trait and its HP, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."
    }
  ],
  "reactions": [],
  "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."
    },
    {
      "name": "Tail Attack",
      "desc": "The dragon makes a Tail attack."
    },
    {
      "name": "Elemental Roar (Costs 2 Actions)",
      "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 17 CHA save or be vulnerable to cold damage until the end of its next turn. A target resistant to cold damage isn't resistant to it for the duration. A target immune to cold damage is still immune to it, even if the target fails the save."
    },
    {
      "name": "Wing Attack (Costs 2 Actions)",
      "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 21 Dexterity save or take 15 (2d6+8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."
    }
  ],
  "special_abilities": [
    {
      "name": "Freezing Fog",
      "desc": "As the **young silver dragon**, except it affects creatures within 20 feet of the dragon, and the save DC is 20."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the dragon fails a save, it can choose to succeed instead."
    }
  ],
  "spell_list": [],
  "page_no": null,
  "environments": [],
  "img_main": null,
  "document__slug": "blackflag",
  "document__title": "Black Flag SRD",
  "document__license_url": "https://paizo.com/orclicense",
  "document__url": "https://koboldpress.com/black-flag-reference-document/",
  "v2_converted_path": "/v2/creatures/bfrd_adult-silver-dragon/"
}