{
  "slug": "akhlut",
  "desc": "Possessing the body, head, and tail of a killer whale and the powerful legs of a huge wolf, the akhlut is the alpha predator of the polar landscape. Truly personifying the term “seawolf,” these intelligent and resilient creatures travel freely between the land and sea in search of prey._  \nAkhluts are the masters of their domain. Though they have been seen across all of the world’s oceans and many of its coastlines, akhluts are most comfortable in cold regions with easy access to the sea. Because their pods can reach almost a dozen members, anything is fair game from reindeer and seals to mammoths and whales. The only beings powerful enough, or foolhardy enough, to evict a pod of akhluts from their territory are dragons and other akhluts.  \n**Playful Predators.** Akhluts possess undeniable cunning and inquisitiveness, with no two pods using the same strategies to solve problems or hunt prey. Easily bored, akhluts crave stimulation and are known to follow ships and caravans for miles in the hopes that someone might provide something new or exciting to experience. They can be especially mischievous, freeing fish and game from traps purely to hunt he creatures themselves.  \n**Dangerous Steeds.** The akhlut’s natural power, intelligence, and versatility make them incredibly desirable mounts, but the effort to tame one of these creatures is dangerous and not to be taken lightly. Even akhluts who have been mounts for years are willful enough to assert themselves from time to time. With a great deal of patience and a little luck, akhluts can become fiercely loyal and protective companions.",
  "name": "Akhlut",
  "size": "Large",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 120,
  "hit_dice": "16d10+32",
  "speed": {
    "walk": 40,
    "swim": 60
  },
  "strength": 19,
  "dexterity": 15,
  "constitution": 15,
  "intelligence": 4,
  "wisdom": 12,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 120 ft., passive Perception 14",
  "languages": "—",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The akhlut makes two attacks: one with its bite and one with its tail slam. It can't make both attacks against the same target."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 18 (4d6 + 4) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "4d6+4"
    },
    {
      "name": "Tail Slam",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 22 (4d8 +4) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "4d8+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Echolocation",
      "desc": "The akhlut can't use its blindsight while deafened."
    },
    {
      "name": "Hold Breath",
      "desc": "The akhlut can hold its breath for 30 minutes."
    },
    {
      "name": "Keen Hearing and Smell",
      "desc": "The akhlut has advantage on Wisdom (Perception) checks that rely on hearing or smell."
    },
    {
      "name": "Pack Tactics",
      "desc": "The akhlut has advantage on attack rolls against a creature if at least one of the akhlut's allies is within 5 feet of the creature and the ally isn't incapacitated."
    }
  ],
  "spell_list": [],
  "page_no": 0,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_akhlut/"
}