{
  "slug": "angelic-enforcer",
  "desc": "A gold-furred, lion-headed angel with white wings gives an intense stare, releasing a roar as it raises a flaming greatsword._  \nAngelic enforcers are lion-headed celestials that hunt rogue angels.  \n**Divine Mission.** Angelic enforcers are made from souls selected for their unwavering adherence to the tenants of law and good. These elite angels have a special task: police other angels that go rogue. If an angel breaks one of its god’s tenets but remains good at heart, the enforcers usually only seek to capture the offending celestial to stand trial in the upper planes. If an angel becomes fully corrupted by evil, one or more enforcers are sent to destroy the fallen celestial.  \n**Nothing Gets in the Way.** Angelic enforcers show no mercy to any creature or obstacle between them and their quarries. Those who obstruct the enforcers stand in the way of divine justice and are therefore considered agents of evil. Any killings or collateral damage done by enforcers are usually seen as the fault of their quarry for stepping out of line in the first place.  \n**Immortal Nature.** An angelic enforcer doesn’t require food, drink, or sleep.",
  "name": "Angelic Enforcer",
  "size": "Large",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Good",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 152,
  "hit_dice": "16d10+64",
  "speed": {
    "walk": 30,
    "fly": 90
  },
  "strength": 22,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 18,
  "wisdom": 20,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 9,
  "perception": 9,
  "skills": {
    "insight": 9,
    "intimidation": 9,
    "perception": 9,
    "survival": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "radiant",
  "condition_immunities": "charmed, exhaustion, frightened",
  "senses": "truesight 120 ft., passive Perception 19",
  "languages": "all, telepathy 120 ft.",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The angelic enforcer makes two melee attacks, but can use its bite only once."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) piercing damage, and the target must succeed on a DC 17 Constitution saving throw or be cursed for 1 minute. While cursed, the target can't regain hit points or benefit from an angel's Healing Touch action. The curse can be lifted early by a remove curse spell or similar magic.",
      "attack_bonus": 10,
      "damage_dice": "2d10+6"
    },
    {
      "name": "Greatsword",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 20 (4d6 + 6) slashing damage plus 18 (4d8) fire damage.",
      "attack_bonus": 10,
      "damage_dice": "4d6+6"
    },
    {
      "name": "Change Shape",
      "desc": "The angelic enforcer magically polymorphs into a humanoid or a lion that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the enforcer's choice). In a new form, the enforcer retains its own game statistics and ability to speak, but its AC, movement modes, Strength, Dexterity, and special senses are replaced by those of the new form, and it gains any statistics and capabilities (except class features, legendary actions, and lair actions) that the new form has."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Blazing Weapons",
      "desc": "The angelic enforcer's weapon attacks are magical. When the enforcer hits with any weapon other than its bite, the weapon deals an extra 4d8 fire damage (included in the attack)."
    },
    {
      "name": "Divine Awareness",
      "desc": "The angelic enforcer knows if it hears a lie."
    },
    {
      "name": "Magic Resistance",
      "desc": "The enforcer has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The angelic enforcer's spellcasting ability is Charisma (spell save DC 17). The enforcer can innately cast the following spells, requiring only verbal components:\nAt will: detect evil and good\n3/day each: counterspell, dispel evil and good, dispel magic, protection from evil and good"
    }
  ],
  "spell_list": [],
  "page_no": 17,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_angelic-enforcer/"
}