{
  "slug": "aviere",
  "desc": "A small bird with a fiery belly perches on the shoulder of the temple’s acolyte, singing a divine song._  \nAvieres are fiery songbirds created by good deities and sent to holy sites on the Material Plane as protectors and teachers. They innately know the tenets of their deities and encourage those around them to uphold the tenets. They dislike leaving the area they were sent to tend, but they sometimes venture out to heal or evangelize passersby.  \n**Songbirds.** Locations containing avieres are always filled with beautiful music, as they sing the hymns of their deities at all hours of the day. In doing so, they heal and uplift their surroundings, leading to healthier flora and fauna and calmer weather in the area.  \n**Temple Assistants.** Avieres in temples spend most days aiding the temple’s priests and priestesses, especially in coaching acolytes or those new to the faith. They take great pleasure in assisting scribes who are writing their deity’s teachings, acting as a light source while singing the teachings to the scribes.",
  "name": "Aviere",
  "size": "Tiny",
  "type": "Celestial",
  "subtype": "",
  "group": null,
  "alignment": "Any Good",
  "armor_class": 12,
  "armor_desc": null,
  "hit_points": 17,
  "hit_dice": "5d4+5",
  "speed": {
    "fly": 30,
    "walk": 10
  },
  "strength": 7,
  "dexterity": 14,
  "constitution": 13,
  "intelligence": 10,
  "wisdom": 12,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "performance": 6,
    "religion": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "radiant",
  "damage_immunities": "fire, poison",
  "condition_immunities": "poisoned",
  "senses": "passive Perception 11",
  "languages": "Celestial, Common, telepathy 60 ft.",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) slashing damage plus 4 (1d8) fire damage.",
      "attack_bonus": 4,
      "damage_dice": "1d4+2"
    },
    {
      "name": "Song of Life",
      "desc": "The aviere sings a song against death. The aviere chooses one creature it can see within 30 feet of it that has 0 hp and isn't an undead or a construct. The creature becomes stable."
    },
    {
      "name": "Song of Healing (1/Day)",
      "desc": "The aviere sings a song of healing. The aviere chooses one creature within 60 feet of it. If the creature can hear the aviere's song and isn't an undead or a construct, it regains 1d4 hp."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Divine Rejuvenation",
      "desc": "An aviere that dies collapses into a pile of ash. Each day the pile of ash is within 1 mile of a holy site of its deity or a worshiper of its deity, it has a 75 percent chance of returning to life, regaining all its hit points and becoming active again. This chance increases to 100 percent if a worshiper of the aviere's deity prays over the aviere's ashes at dawn. If unholy water is sprinkled on the aviere's ashes, the aviere can't return to life, except through a wish spell or divine will."
    },
    {
      "name": "Illumination",
      "desc": "The aviere sheds bright light in a 10-foot radius and dim light for an additional 10 feet."
    },
    {
      "name": "Magic Resistance",
      "desc": "The aviere has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Magic Weapons",
      "desc": "The aviere's weapon attacks are magical."
    }
  ],
  "spell_list": [],
  "page_no": 36,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_aviere/"
}