{
  "slug": "barometz",
  "desc": "This creature resembles a large horned goat covered in thick green moss. A vine trails from the beast’s udder to a nearby tree. The creature smells of fresh bread and floral grapes._  \n**Born of Fruit.** The barometz is a strange plant-like monster that arises spontaneously from a normal fruit tree, some say as the result of ancient druidic magic or fey meddling. A fruit tree bearing a barometz grows an unusually large fruit that soon drops from the tree and bursts open to reveal the goat-like creature. The barometz remains attached to its parent plant by a vine and spends its life clearing the area around the fruit tree of weeds and other noxious plants.  \n**A Feast for Kings.** The flesh of a barometz is considered a delicacy by almost all humanoids and giants, and few barometz survive for long once they are discovered by a band of trollkin hunters or foraging hill giants. Elves and other woodland humanoids have attempted to breed barometz, without success. The creature does not reproduce naturally and the methods by which they appear are still unknown.",
  "name": "Barometz",
  "size": "Large",
  "type": "Plant",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 95,
  "hit_dice": "10d10+40",
  "speed": {
    "walk": 20
  },
  "strength": 16,
  "dexterity": 11,
  "constitution": 18,
  "intelligence": 5,
  "wisdom": 16,
  "charisma": 13,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, poisoned",
  "senses": "darkvision 60 ft., passive Perception 13",
  "languages": "understands Sylvan but can’t speak",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The barometz makes two attacks: one with its gore and one with its hooves."
    },
    {
      "name": "Gore",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) piercing damage. If the target is Medium or smaller, it must succeed on a DC 14 Strength saving throw or be knocked prone.",
      "attack_bonus": 6,
      "damage_dice": "2d10+3"
    },
    {
      "name": "Hooves",
      "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) bludgeoning damage.",
      "attack_bonus": 6,
      "damage_dice": "2d8+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fruit of the Land",
      "desc": "When a barometz dies, its body sprouts a myriad of nourishing fruits and vegetables. If a creature spends 10 minutes consuming the produce, it gains the benefits of a heroes' feast spell for 8 hours. If the feast isn't consumed within 1 hour, it disintegrates into a mound of dirt and dried leaves."
    },
    {
      "name": "Parent Vine",
      "desc": "The barometz is attached to a nearby tree by a thick vine that is between 50 and 100 feet long. The vine has AC 13, 20 hp, and resistance to all damage except for slashing damage. If this vine is severed, the barometz loses its Regeneration trait and suffers one level of exhaustion per hour until it dies."
    },
    {
      "name": "Regeneration",
      "desc": "The barometz regains 5 hit points at the start of its turn. This regeneration can only be halted if the barometz's parent vine is severed, whereupon it loses this trait. The barometz dies only if it starts its turn with 0 hit points and doesn't regenerate."
    },
    {
      "name": "Wildland Runner",
      "desc": "Difficult terrain composed of forest underbrush, bushes, or vines doesn't cost the barometz extra movement. In addition, the barometz can pass through magical and nonmagical plants without being slowed by them and without taking damage from them, including plants that are magically created or manipulated, such as those produced by the entangle and wall of thorns spells."
    }
  ],
  "spell_list": [],
  "page_no": 38,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_barometz/"
}