{
  "slug": "befouled-weird",
  "desc": "Water filled with algae, worms, and other detritus rises up in a serpentine form. It reeks of stagnation and rot._  \n**Corrupted Water Elementals.** When aquatic parasites invade a water elemental, they take control of it and seek to propagate. The host becomes a befouled weird, providing protection and an ideal environment for the parasites. It prefers warm, marshy environments where the parasites are more at home. While the weird can carry any parasite, it most commonly acts as a host for brain-eating amoebas.  \n**Exiles to the Material Plane.** Water elementals prevent befouled weirds from infesting the Plane of Water. Otherwise, the tainted creatures infuse pure water elementals with their parasites. Water elementals knowledgeable about such things equate a plague of befouled weirds to Open Game License",
  "name": "Befouled Weird",
  "size": "Medium",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 75,
  "hit_dice": "10d8+30",
  "speed": {
    "walk": 30,
    "swim": 60
  },
  "strength": 17,
  "dexterity": 14,
  "constitution": 16,
  "intelligence": 5,
  "wisdom": 12,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "Aquan",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The befouled weird makes two slam attacks."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage plus 7 (2d6) necrotic damage. If the target is a creature, it must succeed on a DC 13 Constitution saving throw or become infected with parasitic amoebas (see the Parasitic Amoebas trait).",
      "attack_bonus": 5,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Drown in Filth (Recharge 4-6)",
      "desc": "A creature in the befouled weird's space must make a DC 13 Strength saving throw. On a failure, the target takes 10 (2d6 + 3) bludgeoning damage and 7 (2d6) necrotic damage, and, if it is Medium or smaller, it is grappled (escape DC 13). Until this grapple ends, the target is restrained and unable to breathe unless it can breathe water. If the saving throw is successful, the target is pushed out of the weird's space. At the start of each of the weird's turns, the grappled target takes 10 (2d6 + 3) bludgeoning damage and 7 (2d6) necrotic damage, and it must make a DC 13 Constitution saving throw or become infected with parasitic amoebas. A creature within 5 feet of the weird can pull the target out of it by taking an action to make a DC 13 Strength check and succeeding."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Freeze",
      "desc": "If the befouled weird takes cold damage, it partially freezes. Its speed is reduced by 10 feet until the end of its next turn."
    },
    {
      "name": "Parasitic Amoebas",
      "desc": "A creature other than the weird that becomes infected with parasitic amoebas becomes vulnerable to necrotic damage. At the end of each long rest, the diseased creature must succeed on a DC 13 Constitution saving throw or its Intelligence score is reduced by 1d4. The reduction lasts until the target finishes a long rest after the disease is cured. If the disease reduces the creature's Intelligence to 0, the creature dies. If a water elemental dies in this way, its body becomes a befouled weird 1d4 hours later. The disease lasts until removed by the lesser restoration spell or similar magic."
    },
    {
      "name": "Unclean",
      "desc": "If a creature targets the weird with the lesser restoration spell, requiring a successful melee spell attack roll, the weird takes 9 (2d8) radiant damage and can't infect targets with parasitic amoebas for 1 minute."
    },
    {
      "name": "Water Form",
      "desc": "The befouled weird can enter a hostile creature's space and stop there. It can move through a space as narrow as 1 inch wide without squeezing."
    }
  ],
  "spell_list": [],
  "page_no": 41,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_befouled-weird/"
}