{
  "slug": "boreas-chosen",
  "desc": "The humanoid’s piercing blue eyes lock on their target as it charges forward with bloodlust. Bloodcurdling battle cries and flying spears follow the berserker’s charge._  \nRegardless of what type of prior life they led, any humanoid can become one of Boreas’ chosen. Some humanoids are born with runic symbols designating them as creatures blessed by the North Wind, but most must undergo several trials before the first wintry rune scrawls itself into their flesh. The trials include surviving the highest mountain peaks in the dead of winter, defeating a frost giant in single combat, and crafting a spear out of the fang or claw of an icy beast. Even then, Boreas may deny his favor.  \n**Blood and Weapons of Ice.** A humanoid chosen by Boreas goes through a transformation to become more like its patron. Its blood freezes into ice, and its weapons become forever rimed.  \n**Blessed and Loyal.** Humanoids chosen by Boreas further his goals, protect his holy sites, spread winter wherever they walk, and honor the North Wind with every fallen foe.",
  "name": "Boreas’ Chosen",
  "size": "Medium",
  "type": "Humanoid",
  "subtype": "any race",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 15,
  "armor_desc": "leather armor, shield",
  "hit_points": 102,
  "hit_dice": "12d8+48",
  "speed": {
    "walk": 30
  },
  "strength": 17,
  "dexterity": 14,
  "constitution": 19,
  "intelligence": 8,
  "wisdom": 14,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 6,
    "intimidation": 3,
    "survival": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "cold",
  "condition_immunities": "charmed, exhaustion, frightened",
  "senses": "passive Perception 12",
  "languages": "Common, Giant",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "Boreas' chosen makes two ice spear attacks."
    },
    {
      "name": "Spear",
      "desc": "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 6 (1d6 + 3) piercing damage, or 7 (1d8 + 3) piercing damage if used with two hands to make a melee attack, plus 9 (2d8) cold damage.",
      "attack_bonus": 6,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Breath of the North Wind",
      "desc": "(Recharge 5-6). Boreas' chosen exhales freezing breath in a 15-foot cone. Each creature in that area must make a DC 15 Constitution saving throw. On a failure, a creature takes 28 (8d6) cold damage and its speed is reduced by 10 feet until the end of its next turn. On a success, a creature takes half the damage and its speed isn't reduced. A creature that fails the saving throw by 5 or more is petrified in ice until the end of its next turn instead."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Frozen Blood",
      "desc": "A creature that hits the chosen with a melee attack while within 5 feet of it takes 4 (1d8) cold damage."
    },
    {
      "name": "Ice Runes",
      "desc": "The chosen's weapon attacks are magical. When the chosen hits with any weapon, the weapon deals an extra 2d8 cold damage (included in the attack)."
    },
    {
      "name": "Ice Walk",
      "desc": "The chosen can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement."
    }
  ],
  "spell_list": [],
  "page_no": 48,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_boreas-chosen/"
}