{
  "slug": "brain-hood",
  "desc": "A bear with the top of its head covered in a strange, slick, black substance looks around with purpose._  \n**Parasitic.** Brain hoods are parasites that are rarely encountered without host animals. In fact, outside of its host, a brain hood poses little danger to intelligent creatures or creatures who are not beasts. Brain hoods prefer to bond with larger creatures, such as bears or dire wolves, due to the beasts’ impressive physical prowess. They use the animals as powerful physical vessels, helping the host creature find food but otherwise subjugating the dim intelligence within it.  \n**Calculating.** The brain hood is inherently evil and despises all living things that possess bodies of their own. They delight in using their beast forms to attack and kill humanoids, particularly if the humanoids are smaller or less powerful than their bonded beast.  \n**Druidic Enemies.** Given the unique nature of a brain hood’s existence, some people mistake them for druids in beast form. Brain hoods often encourage this belief, sowing mistrust and discord between villagers and a local circle of druids. This practice, coupled with the brain hood’s abominable treatment of beasts, drives druids to hunt down and destroy brain hoods. Traveling druids listen for stories of sudden, uncommonly aggressive animal attacks, knowing the cause could be a sign that a brain hood is in the area.",
  "name": "Brain Hood",
  "size": "Tiny",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 22,
  "hit_dice": "5d4+10",
  "speed": {
    "fly": 40,
    "hover": true,
    "walk": 20
  },
  "strength": 4,
  "dexterity": 16,
  "constitution": 14,
  "intelligence": 17,
  "wisdom": 15,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning",
  "damage_immunities": "",
  "condition_immunities": "prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 12",
  "languages": "Common, telepathy 60 ft.",
  "challenge_rating": "1/2",
  "cr": 0.5,
  "actions": [
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) bludgeoning damage. If the target is a beast, the brain hood can attempt to take control of it (see the Merge with Beast trait).",
      "attack_bonus": 5,
      "damage_dice": "1d4+3"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Merge with Beast",
      "desc": "If the brain hood successfully hits a beast with an Intelligence of 3 or lower with its Slam attack, it latches onto the beast's head and attempts to take control of the creature. The target must succeed on a DC 14 Intelligence saving throw or become bonded with the brain hood, losing all control of its body to the brain hood. While bonded in this way, the brain hood's statistics are replaced by the statistics of the beast, including the beast's hit points and Hit Dice, but the brain hood retains its alignment, personality, Intelligence, Wisdom, and Charisma scores, along with its Speak with Beasts trait. In addition, the brain hood retains its ability to cast spells. The brain hood can't be targeted specifically while bonded with a creature. It can detach itself from the creature and end the bond by spending 5 feet of its movement. If the bonded creature is reduced to 0 hit points, the brain hood is ejected from it and appears in an unoccupied space within 5 feet of the creature."
    },
    {
      "name": "Speak with Beasts",
      "desc": "While merged with a beast, the brain hood can communicate with beasts of the same type as if they shared a language."
    },
    {
      "name": "Innate Spellcasting (Psionics)",
      "desc": "The brain hood's spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). The brain hood can innately cast the following spells, requiring no components:\nAt will: acid splash, chill touch, fire bolt, ray of frost, shocking grasp\n3/day each: detect magic, magic missile, sleep\n1/day each: blur, burning hands, hold person"
    }
  ],
  "spell_list": [],
  "page_no": 50,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_brain-hood/"
}