{
  "slug": "chatterlome",
  "desc": "When the oaken box is found on your stoop, run—for the box devil is soon to come._  \nChatterlomes have featureless grey heads with large, round eyes, and their circular mouths are filled with needlelike teeth. They have misshapen torsos and short, bandy legs. Their most notable feature, though, is their four arms, which always wield woodworking tools.  \n**Vengeance Seekers.** Chatterlomes prey on scorned lovers, offering violent revenge for those who have been wronged. When a person calls upon the chatterlome, they soon receive an intricately carved oaken box with an obsidian inlay of a humanoid heart. Upon touching the box, the supplicant immediately knows that the box must be delivered to the home of the person who wronged the supplicant. When the victim opens the box, the chatterlome springs forth, claiming the heart of the victim and fulfilling the supplicant’s request. Whether or not the box is opened, a chatterlome whose box has been delivered knows the location of the victim and tracks the person relentlessly. After the victim dies, the supplicant must then deliver the chatterlome’s box to nine more victims or forfeit their own life. A string of deaths occurring shortly after victims received mysterious boxes is a sure sign that a chatterlome is in the area.  \n**Box Devils.** Chatterlomes are often called “box devils” due to their peculiar ability to magically travel between boxes and other enclosed, wooden objects. Though chatterlomes can travel between boxes, each chatterlome has its original box, created when it was summoned by a supplicant who was scorned. If the chatterlome’s original box is destroyed, the chatterlome returns to the Hells, where it waits for another scorned lover to call it back to the Material Plane.",
  "name": "Chatterlome",
  "size": "Medium",
  "type": "Fiend",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Evil",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 93,
  "hit_dice": "11d8+44",
  "speed": {
    "walk": 30
  },
  "strength": 15,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 11,
  "wisdom": 14,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 5,
  "charisma_save": 3,
  "perception": 5,
  "skills": {
    "perception": 5,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, fire; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 120 ft., passive Perception 15",
  "languages": "Abyssal, Common, Infernal, telepathy 60 ft.",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The chatterlome makes four chisel attacks."
    },
    {
      "name": "Chisel",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Box Teleport",
      "desc": "The chatterlome magically teleports up to 120 feet into a box, chest, wardrobe, or other wooden container with a lid or door. The chatterlome can hide inside the container as a bonus action after teleporting. If the chatterlome uses this action while inside a container, it can teleport into another container within range or it can teleport back to the Hells. If it teleports to the Hells, it can't return to the Material Plane until it is summoned."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The chatterlome has advantage on saving throws against spells and other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 60,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_chatterlome/"
}