{
  "slug": "dragon-eel",
  "desc": "_The dragon eel’s unmistakable slender form sports a powerful single finned tail and wicked jaws like a matched pair of serrated blades. Dragon eels vary widely in color from browns and blacks to brilliant iridescent hues in mottled patterns._  \n**Fond of Servants.** While most dragon eels are solitary and irascible, on rare instances some form pairs or small bands—and some gather humanoid servants.  \n**Magnetic and Lightning.** Dragon eels make their natural homes in twisting underwater cave systems and prefer magnetically-aligned, metallic cavern formations navigable with their refined electric-sight. Some dragon eels use their constant electric auras combined with acquired alchemical reagents to electroplate portions of their golden hoard onto the walls of their dwellings.  \n**Pirate Fleets and Dominions.** Dragon eels claim large swaths of shoreline as their demesne. Although neither particularly cruel nor righteous, a dragon eel often lords over awed tribes, allowing locals to revere it as a mighty spirit. Some dragon eels use such tribes as the core of a pirate fleet or raiding parties carried on their backs. Their ability to swim through air during storms adds to their reputation as terrible thunder spirits.  \n**Bribable.** Their deceptive moniker sometimes lulls foolish sailors into a false confidence when they expect to face a simple if dangerous eel beast, but instead find themselves dealing with intelligent draconic kings of the coastal shallows. Wise sailors traveling through known dragon eel territory bring tithes and offerings to placate them.",
  "name": "Dragon Eel",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 230,
  "hit_dice": "20d12+100",
  "speed": {
    "walk": 20,
    "swim": 60
  },
  "strength": 26,
  "dexterity": 12,
  "constitution": 20,
  "intelligence": 14,
  "wisdom": 13,
  "charisma": 14,
  "strength_save": 12,
  "dexterity_save": 5,
  "constitution_save": null,
  "intelligence_save": 6,
  "wisdom_save": 5,
  "charisma_save": 6,
  "perception": 6,
  "skills": {
    "acrobatics": 5,
    "athletics": 12,
    "insight": 5,
    "perception": 6
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "lightning",
  "condition_immunities": "paralyzed, prone",
  "senses": "darkvision 60 ft., passive Perception 16",
  "languages": "Common, Draconic, Primordial",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The dragon eel makes one bite attack and one tail slap attack."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 26 (4d8 + 8) piercing damage plus 5 (1d10) lightning damage, and the target must succeed on a DC 18 Constitution saving throw or become paralyzed for 1d4 rounds.",
      "attack_bonus": 12,
      "damage_dice": "4d8"
    },
    {
      "name": "Tail Slap",
      "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 30 (5d8 + 8) bludgeoning damage plus 5 (1d10) lightning damage and push the target up to 10 feet away.",
      "attack_bonus": 12,
      "damage_dice": "5d8"
    },
    {
      "name": "Lightning Breath (Recharge 6)",
      "desc": "The dragon eel exhales lightning in a 60-foot line that is 5 feet wide. Each target in that line takes 55 (10d10) lightning damage, or half damage with a successful DC 18 Dexterity saving throw."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Limited Amphibiousness",
      "desc": "The dragon eel can breathe air and water, but it needs to be submerged at least once every six hours to avoid suffocation."
    },
    {
      "name": "Shocking Touch",
      "desc": "A dragon eel's body generates a potent charge of lightning. A creature that touches or makes a successful melee attack against a dragon eel takes 5 (1d10) lightning damage."
    },
    {
      "name": "Storm Glide",
      "desc": "During storms, the dragon eel can travel through the air as if under the effects of a fly spell, except using its swim speed."
    }
  ],
  "spell_list": [],
  "page_no": 146,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_dragon-eel/"
}