{
  "slug": "emeraldeye-tob1-2023",
  "desc": "False",
  "name": "Emerald Eye",
  "size": "Tiny",
  "type": "Construct",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 54,
  "hit_dice": "12d4 + 24",
  "speed": {
    "walk": 30
  },
  "strength": 3,
  "dexterity": 15,
  "constitution": 14,
  "intelligence": 18,
  "wisdom": 12,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": 4,
  "constitution_save": 4,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 13,
  "skills": {
    "Arcana": 6,
    "Deception": 5,
    "History": 6,
    "Perception": 3,
    "Persuasion": 5,
    "Religion": 6
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "cold, fire, piercing",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "blinded, deafened, charmed, exhaustion, frightened, paralyzed, petrified, poisoned, prone, unconscious",
  "senses": "blindsight 120 ft. (blind beyond this radius), passive Perception 13",
  "languages": "Common, Draconic, telepathy 120 ft.",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Phrenic Burst",
      "desc": "Melee or Ranged Spell Attack: +5 to hit, range 60 ft., one creature. Hit: 10 (2d6 + 3) psychic damage."
    },
    {
      "name": "Bind",
      "desc": "The emerald eye chooses a creature it can see within 30 feet of it that has an Intelligence of 6 or higher. The target must succeed on a DC 13 Charisma saving throw or the eye psychically binds itself to the target. If the target succeeds on the saving throw by 5 or more, it knows the eye attempted to bind to it. Otherwise, the target is unaware of the attempt. While bound to the emerald eye, the creature has resistance to psychic damage, but it has disadvantage on saving throws against the eye's Compulsion. The eye can be bound to only one target at a time. If it binds to another, the effect on the previous target ends."
    },
    {
      "name": "Compel",
      "desc": "The emerald eye magically compels one creature it can see within 30 feet of it to move. The target must succeed on a DC 13 Charisma saving throw or be charmed by the eye for 1 minute. At the start of each of the charmed target's turns, the emerald eye chooses a direction horizontal to the eye, and the target must use as much of its movement as possible to move in that direction on its turn. The target can take its action before it moves. The target can't be compelled to move into an obviously deadly hazard, such as a fire or pit, but it will provoke opportunity attacks to move in the designated direction. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Construct Nature",
      "desc": "The emerald eye doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Immutable Form",
      "desc": "The emerald eye is immune to any spell or effect that would alter its form."
    },
    {
      "name": "Psychically Bound",
      "desc": "The emerald eye must be psychically bound to a creature to survive. It loses 5 (2d4) hp for every hour it is not bound to a creature or every hour it is more than 30 feet away from its bound creature."
    }
  ],
  "spell_list": [],
  "page_no": 163,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_emerald-eye/"
}