{
  "slug": "faceless-wanderer",
  "desc": "The robed figure formed of tattered shadows and swirling darkness has a bone-white, featureless oval disk where its face should be._  \n**Corporeal Shadow.** Faceless wanderers are creatures made of solid darkness. They are spawned from the Void whenever the minds of a large group of sentient creatures are broken or twisted as a result of exposure to the Void or its denizens. The minds and memories of living creatures draw them to mortal realms.  \n**Memory Eater.** The faceless wanderers survive by stealing memories from sentient humanoids and create new faceless wanderers when they completely drain a humanoid of its memories. Curiously, faceless wanderers don’t harm young humanoids and sometimes even aid them. Scholars speculate this odd behavior is because children possess fewer memories than adults.  \n**Void Traveler.** The faceless wanderer doesn’t require air, food, drink, sleep, or ambient pressure.",
  "name": "Faceless Wanderer",
  "size": "Medium",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": null,
  "hit_points": 58,
  "hit_dice": "9d8+18",
  "speed": {
    "fly": 30,
    "walk": 0,
    "hover": true
  },
  "strength": 12,
  "dexterity": 17,
  "constitution": 14,
  "intelligence": 16,
  "wisdom": 12,
  "charisma": 10,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 3,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "poison, psychic",
  "condition_immunities": "blinded, exhaustion, poisoned, prone",
  "senses": "blindsight 60 ft., passive Perception 12",
  "languages": "all, telepathy 60 ft.",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The faceless wanderer makes two attacks, but it can use its Memory Drain only once."
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage plus 7 (2d6) psychic damage.",
      "attack_bonus": 5,
      "damage_dice": "1d6+3"
    },
    {
      "name": "Memory Drain",
      "desc": "The faceless wanderer drains memories from an adult creature within 30 feet of it. The target must make a DC 13 Intelligence saving throw. On a failure, the target takes 14 (4d6) psychic damage and its Intelligence score is reduced by 1d4. The target dies if this reduces its Intelligence to 0. A humanoid slain in this way rises 1d4 hours later as a new faceless wanderer. Otherwise, the reduction lasts until the target finishes a short or long rest. On a success, the target takes half the damage and its Intelligence score isn't reduced."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Memory Loss",
      "desc": "A creature that sees or interacts with a faceless wanderer must make a DC 11 Wisdom saving throw 1 minute after the faceless wanderer leaves. On a failure, the details of the faceless wanderer and the events surrounding its appearance rapidly fade away from the creature's mind, including the presence of the faceless wanderer."
    },
    {
      "name": "Regeneration",
      "desc": "The faceless wanderer regains 5 hp at the start of its turn. If a creature hasn't failed the saving throw of the faceless wanderer's Memory Drain within the last 1 minute, this trait doesn't function until a creature fails it. If a faceless wanderer is reduced to 0 hp while it is still capable of regenerating, its body dissipates into vapor and reforms 1d10 days later somewhere in the Void. Otherwise, it is permanently destroyed."
    }
  ],
  "spell_list": [],
  "page_no": 139,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_faceless-wanderer/"
}