{
  "slug": "felid-dragon",
  "desc": "The tiger rises from its slumber, stretching its draconic wings. Light glints off its backswept horns as it roars its deafening challenge at intruders._  \n**Treasure Hoard.** Similar to other dragons, felid dragons are treasure hoarders with an eye for shiny and sparkly things. They sometimes align themselves with those who are trying to do good in the world, though their motivation is typically selfish and focused on obtaining treasure.  \n**Curious and Playful.** Like most cats, felid dragons are naturally curious and often put themselves in danger just to learn more about the world. They like to play with their prey, allowing it to live a little longer than necessary before knocking it down again for their own entertainment. This behavior is unavoidably instinctual and even the most austere felid dragons succumb to it.",
  "name": "Felid Dragon",
  "size": "Huge",
  "type": "Dragon",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 18,
  "armor_desc": null,
  "hit_points": 275,
  "hit_dice": "22d12+132",
  "speed": {
    "walk": 40,
    "fly": 80
  },
  "strength": 18,
  "dexterity": 26,
  "constitution": 23,
  "intelligence": 16,
  "wisdom": 17,
  "charisma": 19,
  "strength_save": 10,
  "dexterity_save": null,
  "constitution_save": 12,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": 10,
  "perception": 9,
  "skills": {
    "acrobatics": 14,
    "perception": 9,
    "stealth": 16
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned, prone",
  "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 13",
  "languages": "Common, Draconic",
  "challenge_rating": "19",
  "cr": 19,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The felid dragon can use its Deafening Roar. It then makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 19 (2d10 + 8) piercing damage.",
      "attack_bonus": 14,
      "damage_dice": "2d10+8"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage, and, if the target is a creature other than an undead or a construct, it must succeed on a DC 20 Constitution saving throw or take 2 (1d4) slashing damage at the start of each of its turns as a piece of the claw breaks off in the wound. Each time the dragon hits the target with this attack, the damage dealt by the wound each round increases by 3 (1d6). Any creature can take an action to remove the claw with a successful DC 16 Wisdom (Medicine) check. The claw pops out of the wound if the target receives magical healing.",
      "attack_bonus": 14,
      "damage_dice": "2d6+8"
    },
    {
      "name": "Deafening Roar",
      "desc": "Each creature within 60 feet of the dragon and that can hear it must succeed on a DC 18 Constitution saving throw or be deafened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Deafening Roar for the next 24 hours."
    },
    {
      "name": "Sickening Bile (Recharge 5-6)",
      "desc": "The dragon coughs up partially digested food and slimy bile in a 90-foot cone. Each creature in that area must make a DC 20 Constitution saving throw. On a failure, a creature takes 70 (20d6) poison damage and is coated in bile. On a success, a creature takes half the damage and isn't coated in bile. While coated in bile, a creature is poisoned. A creature, including the target coated in bile, can use its action to remove the bile, ending the poisoned condition."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Flyby",
      "desc": "The felid dragon doesn't provoke opportunity attacks when it flies out of an enemy's reach."
    },
    {
      "name": "Keen Smell",
      "desc": "The felid dragon has advantage on Wisdom (Perception) checks that rely on smell."
    },
    {
      "name": "Magic Resistance",
      "desc": "The felid dragon has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Pounce",
      "desc": "If the felid dragon moves at least 20 feet straight toward a creature and then hits it with a claw attack on the same turn, that target must succeed on a DC 20 Strength saving throw or be knocked prone. If the target is prone, the felid dragon can make one bite attack against it as a bonus action."
    }
  ],
  "spell_list": [],
  "page_no": 143,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_felid-dragon/"
}