{
  "slug": "fire-dancer-swarm",
  "desc": "_A swirling mass of tiny, blue flames dances with the likeness of a skull embedded in each little, flickering fire._  \n_**Stunted Elementals.**_ Fire dancers are Tiny fire elementals. Speculation varies whether they’re simply immature or somehow stunted. They may be castoffs from larger, fiery elemental beings. A single, solitary fire dancer is no more than a semi-sentient spark with a fragment of life and lofty but unrealistic ambitions. In large numbers, they’re a menace.  \n_**Unite and Grow Strong.**_ Larger fire elementals are usually sessile creatures, content merely to exist on their plane of origin. Fire dancers possess (and some argue are infected with) mortal qualities—they seek to reach a greater potential, which smacks of envy, ambition, and resentment. They realize that there is power in numbers and that, when united, they are a force to be reckoned with. A single fire dancer is no more threatening than a tiny candle flame, burning hot and blue. When thousands join together, though, the result is an inferno. The likeness of a skull in its flame is an illusion created by the creature, based on how the fire dancers perceive mortal creatures after they’re done with them.  \n_**Surly Servants.**_ Lone fire dancers have individuality, but in groups, they develop a hive mentality. While this allows them to function as a swarm, it also makes them vulnerable as a group to mind-affecting magic. Savvy bards, conjurers, and enchanters who summon swarms of fire dancers know they must maintain a tight control on the swarm, for these creatures are surly servants at the best of times.  \n_**Elemental Nature.**_ A swarm of fire dancers doesn’t require air, food, drink, or sleep.",
  "name": "Fire Dancer Swarm",
  "size": "Medium",
  "type": "Elemental",
  "subtype": "Swarm",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "",
  "hit_points": 90,
  "hit_dice": "12d8+36",
  "speed": {
    "hover": true,
    "walk": 30,
    "fly": 30
  },
  "strength": 10,
  "dexterity": 20,
  "constitution": 16,
  "intelligence": 6,
  "wisdom": 10,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing",
  "damage_immunities": "fire, poison",
  "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned, unconscious",
  "senses": "darkvision 60 ft., passive Perception 10",
  "languages": "Ignan",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Swarm",
      "desc": "Melee Weapon Attack: +8 to hit, reach 0 ft., one target in the swarm's space. Hit: 21 (6d6) fire damage, or 10 (3d6) fire damage if the swarm has half or fewer hit points.",
      "attack_bonus": 8,
      "damage_dice": "6d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Fire Form",
      "desc": "A creature that touches the swarm or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage. In addition, the first time the swarm enters a creature's space on a turn, that creature takes 5 (1d10) fire damage and catches fire; until someone uses an action to douse the fire, the creature takes 5 (1d10) fire damage at the start of each of its turns."
    },
    {
      "name": "Illumination",
      "desc": "The swarm sheds bright light in a 30-foot radius and dim light to an additional 30 feet."
    },
    {
      "name": "Swarm",
      "desc": "The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny creature. The swarm can't regain hit points or gain temporary hit points."
    },
    {
      "name": "Water Susceptibility",
      "desc": "For every 5 feet the swarm moves in water, or for every gallon of water splashed on it, it takes 1 cold damage."
    }
  ],
  "spell_list": [],
  "page_no": 373,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_fire-dancer-swarm/"
}