{
  "slug": "galidroo",
  "desc": "This horrid creature is larger than an ox, and its hairless, wrinkled skin is covered in foul warts and pustules. The creature has two rat-like heads and a heavy tentacular tail that lashes the air malevolently._  \n**Wasteland Monstrosity.** The galidroo dwells primarily in desolate badlands, ravaged ruins, and areas where magic has corrupted the landscape and the creatures within it. Though powerful monsters in their own right, they are rarely at the top of the food chain and have to watch out for other monsters like Open Game License",
  "name": "Galidroo",
  "size": "Huge",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 172,
  "hit_dice": "15d12+75",
  "speed": {
    "burrow": 20,
    "walk": 40
  },
  "strength": 22,
  "dexterity": 13,
  "constitution": 20,
  "intelligence": 11,
  "wisdom": 18,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 9,
  "intelligence_save": null,
  "wisdom_save": 8,
  "charisma_save": null,
  "perception": 8,
  "skills": {
    "perception": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "psychic",
  "condition_immunities": "exhaustion",
  "senses": "darkvision 90 ft., passive Perception 18",
  "languages": "Deep Speech, telepathy 60 ft.",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The galidroo makes four attacks: two with its bite and two with its claws. It can make one tail attack in place of its two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.",
      "attack_bonus": 10,
      "damage_dice": "2d10+6"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "attack_bonus": 10,
      "damage_dice": "2d6+6"
    },
    {
      "name": "Tail",
      "desc": "Melee Weapon Attack: +10 to hit, reach 15 ft., one target. Hit: 16 (3d6 + 6) bludgeoning damage. The target is grappled (escape DC 17) if it is a Large or smaller creature and the galidroo doesn't have another creature grappled. Until this grapple ends, the target is restrained, and the galidroo can't use its tail on another target.",
      "attack_bonus": 10,
      "damage_dice": "3d6+6"
    },
    {
      "name": "Prophetic Screech (Recharge 5-6)",
      "desc": "The galidroo unleashes a burst of prophetic power in a 60-foot cone. Each creature in that area must make a DC 17 Intelligence saving throw. On a failure, a creature takes 35 (10d6) psychic damage and is incapacitated for 1 minute as its mind is bombarded with visions of its past and future. On a success, a creature takes half the damage and isn't incapacitated. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Aura of Lassitude",
      "desc": "A creature that starts its turn within 30 feet of the galidroo must succeed on a DC 17 Constitution saving throw or feel lethargic until the start of its next turn. While lethargic, a creature can't use reactions, its speed is halved, and it can't make more than one melee or ranged attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. On a successful saving throw, the creature is immune to the galidroo's Aura of Lassitude for the next 24 hours."
    },
    {
      "name": "Selective Precognition",
      "desc": "The galidroo can see into the past, present, and future simultaneously. It can innately cast divination and legend lore once per day each, requiring no material components. Its innate spellcasting ability is Wisdom. The galidroo can't use these spells to gain information about itself or its personal future or past."
    },
    {
      "name": "Two-Headed",
      "desc": "The galidroo has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious."
    }
  ],
  "spell_list": [],
  "page_no": 161,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_galidroo/"
}