{
  "slug": "graythirster-tob1-2023",
  "desc": "False",
  "name": "Gray Thirster",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 13,
  "armor_desc": "",
  "hit_points": 52,
  "hit_dice": "8d8 + 16",
  "speed": {
    "walk": 30
  },
  "strength": 12,
  "dexterity": 16,
  "constitution": 15,
  "intelligence": 6,
  "wisdom": 12,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 11,
  "skills": {
    "Stealth": 5
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "necrotic",
  "damage_immunities": "fire, poison",
  "condition_immunities": "charmed, exhaustion, frightened, poisoned",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "understands the languages it knew in life but can’t speak",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The gray thirster makes two Claw attacks, or it makes one Claw attack and one Withering Turban attack."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) slashing damage."
    },
    {
      "name": "Withering Turban",
      "desc": "Melee Weapon Attack: +5 to hit, reach 10 ft., one creature. Hit: 7 (1d8 + 3) necrotic damage. The target must succeed on a DC 12 Constitution saving throw or its hp maximum is reduced by an amount equal to the damage taken. The target has disadvantage on this saving throw if it failed the saving throw against the thirster's Thirst Aura. This reduction lasts until the target finishes a long rest with no levels of exhaustion. The target dies if this effect reduces its hp maximum to 0."
    },
    {
      "name": "Drought (1/Day)",
      "desc": "The gray thirster draws the moisture from containers and creatures around it. Nonmagical water and other liquids within 20 feet of the thirster that aren't being worn or carried turn to dust. Each creature within 20 feet of the thirster that isn't a Construct or Undead must make a DC 12 Constitution saving throw. On a failure, a creature takes 9 (2d8) necrotic damage and up to 5 gallons of nonmagical liquid it is wearing or carrying turn to dust. On a success, a creature takes half the damage, and nonmagical liquids it is wearing or carrying don't turn to dust. Plants, Oozes, creatures with the Amphibious or Water Breathing trait, and creatures made mostly of water, such as water elementals or steam mephits, have disadvantage on the saving throw."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Thirst Aura",
      "desc": "A creature that starts its turn within 30 feet of the gray thirster must succeed on a DC 12 Constitution saving throw or suffer one level of exhaustion. On a successful saving throw, the creature is immune to the gray thirster's Thirst Aura for the next 24 hours."
    },
    {
      "name": "Thirsting Dead Nature",
      "desc": "The gray thirster doesn't require air, food, or sleep."
    }
  ],
  "spell_list": [],
  "page_no": 221,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_gray-thirster/"
}