{
  "slug": "ichor-ooze",
  "desc": "Black sludge with glowing red veins seeps out of a crack in the wall, sizzling as it pushes forward._  \nIchor oozes are vengeful slimes created by the destruction of fiends.  \n**Born from Destroyed Fiends.** When a fiend is destroyed on a plane of existence other than its home plane, ichor is all that remains in the place where it was slain. When a strong-willed, hateful fiend dies cursing its slayers, a small piece of its lust for vengeance can infuse the ichor, giving the remains life. The ichor becomes one or more ichor oozes, which have a single-minded goal: revenge.  \n**Revenge Seekers.** Ichor oozes stop at nothing to hunt down the people who killed the fiends that created them. They can sense their quarries over any distance and attack other life they come across to fuel their pursuits. The destruction of a bigger fiend, like a Open Game License",
  "name": "Ichor Ooze",
  "size": "Medium",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "Neutral Evil",
  "armor_class": 8,
  "armor_desc": null,
  "hit_points": 39,
  "hit_dice": "6d8+12",
  "speed": {
    "swim": 20,
    "walk": 20,
    "climb": 20
  },
  "strength": 15,
  "dexterity": 6,
  "constitution": 14,
  "intelligence": 3,
  "wisdom": 7,
  "charisma": 1,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "necrotic, poison; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "fire",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 8",
  "languages": "—",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Pseudopod",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) bludgeoning damage plus 3 (1d6) fire damage. If the target is a Large or smaller creature, it is grappled (escape DC 12).",
      "attack_bonus": 4,
      "damage_dice": "1d6+2"
    },
    {
      "name": "Hurl Mote",
      "desc": "Ranged Weapon Attack: +4 to hit, range 10/30 ft., one target. Hit: 5 (1d6 + 2) fire damage.",
      "attack_bonus": 4,
      "damage_dice": "1d6+2"
    },
    {
      "name": "Life Drain",
      "desc": "One creature grappled by the ooze must make a DC 12 Constitution saving throw, taking 10 (3d6) necrotic damage on a failed save, or half as much damage on a successful one. The target's hp maximum is reduced by an amount equal to the damage taken, and the ooze regains hp equal to that amount. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The ooze can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "Magic Resistance",
      "desc": "The ooze has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Sense Destroyer",
      "desc": "The ichor ooze knows the direction and distance to the creature that performed the killing blow on the fiend that created the ooze, as long as the two of them are on the same plane of existence."
    },
    {
      "name": "Spider Climb",
      "desc": "The ooze can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
    }
  ],
  "spell_list": [],
  "page_no": 279,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_ichor-ooze/"
}