{
  "slug": "ikuchi",
  "desc": "An immense, pale-blue, eel-like creature dripping a thick, gelatinous oil rises above the waves. Dozens of tiny eyes blink along its serpentine flanks._  \n**Giant Elementals.** One of the more unusual denizens of the Elemental Plane of Water, the ikuchi can also be found in the oceans of the Material Plane, hunting the natural fauna and causing havoc for shipping lanes. Though the typical ikuchi is just under a hundred feet long, rumors abound of ikuchi that are hundreds of feet or even miles in length in the largest oceans and the depths of their home plane. Ikuchi are also known as ayakashi in various lands and are sometimes confused with sea serpents.  \n**Sinker of Boats.** More dangerous than even the size of the ikuchi is the oil it produces almost constantly from its body. This oil is thicker than the surrounding water and impedes the movement of any creature moving through it, even those native to the Elemental Plane of Water. The ikuchi uses its oil to swamp small ships by slithering on board and filling the ship with its oil, gradually causing the ship to sink. Why the ikuchi goes to such lengths to sink watercraft is unknown, as the creatures are highly temperamental and are just as likely to ignore a vessel as they are to go after it.",
  "name": "Ikuchi",
  "size": "Gargantuan",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 116,
  "hit_dice": "8d20+32",
  "speed": {
    "walk": 20,
    "swim": 50
  },
  "strength": 20,
  "dexterity": 13,
  "constitution": 18,
  "intelligence": 6,
  "wisdom": 12,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Aquan",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The ikuchi makes two attacks: one with its bite and one to constrict."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 16 (2d10 + 5) piercing damage.",
      "attack_bonus": 8,
      "damage_dice": "2d10+5"
    },
    {
      "name": "Constrict",
      "desc": "Melee Weapon Attack: +8 to hit, reach 20 ft., one Huge or smaller creature. Hit: 14 (2d8 + 5) bludgeoning damage. The target is grappled (escape DC 16) if the ikuchi isn't already constricting two other creatures. Until this grapple ends, the target is restrained.",
      "attack_bonus": 8,
      "damage_dice": "2d8+5"
    },
    {
      "name": "Crush (Recharge 4-6)",
      "desc": "Each creature grappled by the ikuchi must make a DC 16 Strength saving throw, taking 23 (4d8 + 5) bludgeoning damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Ikuchi Oil",
      "desc": "The ikuchi constantly emits a thick, nonflammable, yellowish oil. When the ikuchi is underwater, this oil makes the water within 30 feet of the ikuchi difficult terrain. Each time a creature moves more than 10 feet through this area it must succeed on a DC 15 Strength saving throw or be restrained by the thick oil until the end of its next turn. A creature under the effects of a freedom of movement spell or similar magic is immune to the effects of Ikuchi Oil."
    },
    {
      "name": "Water Breathing",
      "desc": "The ikuchi can breathe only underwater."
    }
  ],
  "spell_list": [],
  "page_no": 210,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_ikuchi/"
}