{
  "slug": "isonade-tob1-2023",
  "desc": "False",
  "name": "Isonade",
  "size": "Gargantuan",
  "type": "Monstrosity",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 222,
  "hit_dice": "12d20 + 96",
  "speed": {
    "walk": 100
  },
  "strength": 30,
  "dexterity": 14,
  "constitution": 26,
  "intelligence": 6,
  "wisdom": 18,
  "charisma": 8,
  "strength_save": 15,
  "dexterity_save": null,
  "constitution_save": 13,
  "intelligence_save": null,
  "wisdom_save": 9,
  "charisma_save": null,
  "perception": 19,
  "skills": {
    "Athletics": 15,
    "Perception": 9
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "False",
  "damage_immunities": "cold",
  "condition_immunities": "False",
  "senses": "darkvision 90 ft., passive Perception 19",
  "languages": "understands Aquan and Elvish, but can’t speak",
  "challenge_rating": "14",
  "cr": 14,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The isonade makes one Bite attack and two Tail Slap attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 36 (4d12 + 10) piercing damage. If the target is a Large or smaller creature, it must succeed on a DC 18 Dexterity saving throw or be swallowed by the isonade. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the isonade, and it takes 21 (6d6) acid damage at the start of each of the isonade's turns. An isonade can have no more than four creatures swallowed at a time. If the isonade takes 30 damage or more on a single turn from a creature inside it, it must succeed on a DC 23 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the isonade. If the isonade dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 20 feet of movement, exiting prone."
    },
    {
      "name": "Tail Slap",
      "desc": "Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 24 (4d6 + 10) bludgeoning damage."
    },
    {
      "name": "Breach",
      "desc": "If the isonade swims at least 20 feet as part of its movement, it can use this action to emerge in a space on the surface of the water that contains one or more other creatures. Each of those creatures and each creature within 10 of the isonade's space must make a DC 18 Dexterity saving throw. On a failure, a creature takes 49 (14d6) bludgeoning damage and is knocked prone. On a success, a creature takes half the damage and is pushed up to 10 feet out of the isonade's space into an unoccupied space of the creature's choice. If no unoccupied space is within range, the creature instead falls prone in the isonade's space."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Influence Weather",
      "desc": "Nearby weather responds to the isonade's desires. At the start of each minute, the isonade can choose to change the precipitation and wind within 1 mile of it by one stage, up or down (no action required). This effect works like the changing weather conditions aspect of the control weather spell, except the isonade can't change the temperature and the conditions change immediately."
    },
    {
      "name": "Magic Resistance",
      "desc": "The isonade has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Siege Monster",
      "desc": "The isonade deals double damage to objects and structures."
    },
    {
      "name": "Water Breathing",
      "desc": "The isonade can breathe only underwater."
    }
  ],
  "spell_list": [],
  "page_no": 240,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_isonade/"
}