{
  "slug": "knight-ab-errant",
  "desc": "A man of supernatural physique swings his mighty hammer with the ease and abandon of a child wielding a fallen tree branch. Beneath his ruined tabard, swirling runes and sigils dance across an impossibly muscular frame._  \nOnce ordinary warriors, these towering behemoths have been scourged by wild and unpredictable magic that lingers in forgotten and forbidden parts of the world.  \n**Revised Beyond Recognition.** Perhaps a paladin claims a trophy from an ancient and unknowable force from beyond the stars, after routing a dungeon of its followers— and slowly, the trophy changes him. In the heat of combat, a simple swordsman might quaff the wrong potion and be spontaneously transformed by an errant wizard’s experimental brew. Whatever their origins, they now walk the world as hulking abominations, gifted strength unimaginable in an ironic reflection of their former selves.  \n**Born of Boons.** Although many knights ab-errant may be altered after exposure to unpredictable arcane sorcery, some were created by divine magic. These may be devotees of trickster gods, or ones that are especially cruel, or they may have prayed to innocuous deities in ways that were unorthodox or otherwise wanting.",
  "name": "Knight Ab-errant",
  "size": "Large",
  "type": "Humanoid",
  "subtype": "",
  "group": null,
  "alignment": "Any Alignment",
  "armor_class": 14,
  "armor_desc": "armor scraps",
  "hit_points": 93,
  "hit_dice": "11d10+33",
  "speed": {
    "walk": 30
  },
  "strength": 19,
  "dexterity": 12,
  "constitution": 17,
  "intelligence": 10,
  "wisdom": 11,
  "charisma": 13,
  "strength_save": 7,
  "dexterity_save": 4,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "athletics": 7,
    "intimidation": 4
  },
  "damage_vulnerabilities": "psychic",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "passive Perception 10",
  "languages": "any one language (usually Common)",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The knight ab-errant makes two melee attacks: one with its sweeping maul and one with its fist."
    },
    {
      "name": "Sweeping Maul",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 18 (4d6 + 4) bludgeoning damage, and the target must succeed on a DC 14 Strength saving throw or be knocked prone.",
      "attack_bonus": 7,
      "damage_dice": "4d6+4"
    },
    {
      "name": "Fist",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 9 (2d4 + 4) bludgeoning damage.",
      "attack_bonus": 7,
      "damage_dice": "2d4+4"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Bigger They Are",
      "desc": "Once per turn, when the knight ab-errant hits a creature that is Medium or smaller with a melee weapon, it can deal one extra die of damage."
    },
    {
      "name": "Harder They Fall",
      "desc": "When the knight ab-errant takes damage from a critical hit, it must succeed on a Dexterity saving throw with a DC equal to the damage taken or be knocked prone."
    },
    {
      "name": "Magic Resistance",
      "desc": "The knight ab-errant has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Reckless",
      "desc": "At the start of its turn, the knight ab-errant can gain advantage on all melee weapon attack rolls during that turn, but attack rolls against it also have advantage until the start of its next turn."
    }
  ],
  "spell_list": [],
  "page_no": 231,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_knight-ab-errant/"
}