{
  "slug": "kobold-alchemist",
  "desc": "More than anything, kobolds are survivors. Their scaly skin and keen night vision as well as their dextrous claws and sensitive snouts make them quick to sense danger, and their clawed feet move them out of danger with cowardly speed. They are small but fierce when fighting on their own terms, and their weight of numbers helps them survive in places where larger but less numerous races can’t sustain a settlement. Kobolds are great miners, good gearsmiths, and modest alchemists, and they have a curiosity about the world that frequently gets them into trouble.  \n_**Underworld Merchants.**_ Kobolds are merchants to both the surface world and the world beneath it, with their greatest cities hidden deep below the earth. Their enemies are the diabolical gnomes, the dwarves, and any other mining races that seek dominance of dark, rich territories.  \nKobolds are closely allied with and related to dragonborn, drakes, and dragons. The kobold kings (and there are oh‑so‑many kobold kings, since no kobold ruler is satisfied with being merely a chieftain) admire dragons as the greatest sources of wisdom, power, and proper behavior.  \n_This slight, reptilian humanoid is bedecked with ceramic flasks and glass vials. An acrid reek follows in the creature’s wake._  \nKobold alchemists are usually smelled before they are seen, thanks to the apothecary’s store of chemicals and poisons they carry. Alchemists often sport mottled and discolored scales and skin, caused by the caustic nature of their obsessions. They raid alchemy shops and magical laboratories to gather more material to fuel their reckless experiments.  \n_**Dangerous Assets.**_ Alchemists can be a great boon to their clan, but at a cost. Not only do the alchemists require rare, expensive, and often dangerous substances to ply their trade, they tend to be a little unhinged. Their experiments yield powerful weapons and defensive concoctions that can save many kobold lives, but the destruction caused by an experiment gone awry can be terrible.",
  "name": "Kobold Alchemist",
  "size": "Small",
  "type": "Humanoid",
  "subtype": "kobold",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 15,
  "armor_desc": "studded leather",
  "hit_points": 44,
  "hit_dice": "8d6+16",
  "speed": {
    "walk": 30
  },
  "strength": 7,
  "dexterity": 16,
  "constitution": 15,
  "intelligence": 16,
  "wisdom": 9,
  "charisma": 8,
  "strength_save": null,
  "dexterity_save": 5,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "arcana": 5,
    "medicine": 3
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 9",
  "languages": "Common, Draconic",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The kobold makes two attacks."
    },
    {
      "name": "Dagger",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) piercing damage plus 5 (2d4) poison damage.",
      "attack_bonus": 5,
      "damage_dice": "1d4"
    },
    {
      "name": "Dart",
      "desc": "Ranged Weapon Attack: +5 to hit, range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage plus 5 (2d4) poison damage.",
      "attack_bonus": 5,
      "damage_dice": "1d4"
    },
    {
      "name": "Alchemical Protection (Recharge after a Short or Long Rest)",
      "desc": "The kobold chooses up to six allied creatures within 10 feet. It releases alchemical vapors that grant those allies resistance to poison damage for 10 minutes. Instead of poison damage, the kobold can grant resistance to the damage type currently in effect for its Apothecary trait."
    },
    {
      "name": "Explosive Flask (Recharge 5-6)",
      "desc": "The kobold throws a flask of volatile substances at a point within 30 feet. The flask explodes in a 15-foot radius. Creatures in the area take 17 (5d6) poison damage and are poisoned for 1 minute, or take half damage and are not poisoned with a successful DC 13 Dexterity saving throw. A poisoned creature repeats the saving throw at the end of each of its turns, ending the poisoned condition on a success. Instead of poison damage, the kobold can deal the damage type currently in effect for its Apothecary trait."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Apothecary",
      "desc": "As a bonus action the kobold can select one of the following damage types: acid, cold, or fire. Until it uses this action again, the kobold has resistance to the chosen damage type. Additionally, the kobold is proficient with a poisoner's kit."
    },
    {
      "name": "Pack Tactics",
      "desc": "The kobold has advantage on an attack roll against a target if at least one of the kobold's allies is within 5 feet of the target and the ally isn't incapacitated."
    },
    {
      "name": "Sunlight Sensitivity",
      "desc": "While in sunlight, the kobold has disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight."
    }
  ],
  "spell_list": [],
  "page_no": 261,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_kobold-alchemist/"
}