{
  "slug": "lava-keeper",
  "desc": "A rivulet of lava streams from a cavity between the shoulders of this four-armed, volcanic creature._  \n**Volcanic Guardians.** Lava keepers are elementals from the borderlands between the Elemental Planes of Earth and Fire. They sometimes emerge onto the Material Plane through spontaneous elemental vortices in the hearts of volcanoes. Once on the Material Plane, they find themselves trapped. Instead of running rampant, they act as guardians for the region from which they emerged in the hopes that one day they can return home.  \n**Noble Elementals.** Lava keepers are the natural enemies of salamanders and other chaotic elementals. They feel a mixture of shame and pity toward their corrupted brethren, the Open Game License",
  "name": "Lava Keeper",
  "size": "Huge",
  "type": "Elemental",
  "subtype": "",
  "group": null,
  "alignment": "Lawful Neutral",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 276,
  "hit_dice": "24d12+120",
  "speed": {
    "walk": 40,
    "burrow": 40
  },
  "strength": 24,
  "dexterity": 10,
  "constitution": 21,
  "intelligence": 10,
  "wisdom": 18,
  "charisma": 12,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 11,
  "intelligence_save": null,
  "wisdom_save": 10,
  "charisma_save": null,
  "perception": 10,
  "skills": {
    "history": 12,
    "perception": 10
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "fire, poison",
  "condition_immunities": "exhaustion, paralyzed, petrified, poisoned, prone",
  "senses": "darkvision 60 ft., tremorsense 120 ft., passive Perception 20",
  "languages": "Ignan, Terran",
  "challenge_rating": "18",
  "cr": 18,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The lava keeper makes four slam attacks. Alternatively, it can use its Lava Lob twice."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 25 (4d8 + 7) bludgeoning damage.",
      "attack_bonus": 13,
      "damage_dice": "4d8+7"
    },
    {
      "name": "Lava Lob",
      "desc": "Ranged Weapon Attack: +13 to hit, range 60/240 ft., one target. Hit: 21 (6d6) fire damage, and the target must succeed on a DC 19 Dexterity saving throw or take 10 (3d6) fire damage at the start of its next turn.",
      "attack_bonus": 13,
      "damage_dice": "6d6"
    },
    {
      "name": "Fumarole (Recharge 5-6)",
      "desc": "The crater between the lava keeper's shoulders erupts in a plume of fire, rock, and toxic smoke. Each creature within 60 feet of the lava keeper must make a DC 19 Constitution saving throw. On a failure, a creature takes 21 (6d6) bludgeoning damage and 21 (6d6) fire damage and becomes poisoned for 1 minute. On a success, a creature takes half the damage and isn't poisoned. A poisoned target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. The eruption surrounds the lava keeper in a 20-foot-radius sphere of smoke, considered heavily obscured until the end of its next turn. A wind of moderate or greater speed (at least 10 miles per hour) disperses the smoke."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Lava Dribble",
      "desc": "Each creature that starts its turn within 5 feet of the lava keeper must make a DC 19 Dexterity saving throw, taking 7 (2d6) fire damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The lava keeper's innate spellcasting ability is Wisdom (spell save DC 17). It can innately cast the following spells, requiring no material components:\nAt will: move earth, stone shape\n3/day each: wall of fire, wall of stone\n1/day each: conjure elemental (earth or fire elemental only), earthquake, fire storm"
    }
  ],
  "spell_list": [],
  "page_no": 235,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_lava-keeper/"
}