{
  "slug": "locksmith",
  "desc": "The human-shaped construct is a cobbled collection of mechanical parts. The hundreds of keys hanging about its form jingle as it moves._  \n**Call the Locksmith.** These odd entities are the best in the business at creating secure doors and gates, impassable barriers, and locks of all varieties. They may be inclined to wander from place to place or set up shop in metropolises, offering their services to create or unlock barriers of any kind.  \n**Professional Rivalry.** Each locksmith has a distinct appearance and personality, but they all share the same skill set. A locksmith instantly recognizes the handiwork of another locksmith. When a locksmith encounters a barrier constructed by another of its kind, it is compelled to break the barrier or build a superior version. A locksmith hired to undo the work of one of its fellows often volunteers for the task free of charge.  \n**Key Features.** Locksmiths are unique in appearance, but all share a generally humanoid shape. Regardless of other details, they all possess empty keyholes where a human nose would typically be. The key that fits this lock is responsible for imbuing the locksmith with its consciousness. Locksmiths build incredibly complex hidden vaults to hide away these treasured keys.  \n**Construct Nature.** The locksmith doesn’t require air, food, drink, or sleep.",
  "name": "Locksmith",
  "size": "Medium",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 18,
  "armor_desc": "natural armor",
  "hit_points": 102,
  "hit_dice": "12d8+48",
  "speed": {
    "walk": 40
  },
  "strength": 20,
  "dexterity": 18,
  "constitution": 18,
  "intelligence": 16,
  "wisdom": 10,
  "charisma": 6,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "insight": 4,
    "stealth": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "fire, poison, psychic",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
  "senses": "blindsight 90 ft., passive Perception 10",
  "languages": "Common",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The locksmith makes two key blade attacks."
    },
    {
      "name": "Key Blade",
      "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 18 (3d8 + 5) slashing damage.",
      "attack_bonus": 9,
      "damage_dice": "3d8+5"
    },
    {
      "name": "Acid Wash (Recharge 5-6)",
      "desc": "The locksmith emits a cloud of rust in a 60-foot cone. Each creature in that area must succeed on a DC 16 Dexterity saving throw, taking 35 (10d6) acid damage on a failed save, or half as much damage on a successful one."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Expert Lockpicker",
      "desc": "The locksmith can use any piece of its mechanical body to pick locks and disarm traps, as if its entire body was made up of several sets of thieves' tools. It is proficient in using pieces of itself in this way. In addition, the locksmith has advantage on ability checks to pick locks and disarm traps."
    },
    {
      "name": "Innate Spellcasting",
      "desc": "The locksmith's innate spellcasting ability is Intelligence (spell save DC 15). It can innately cast the following spells, requiring no material components:\nAt will: mending\n3/day each: arcane lock, knock\n1/day: forcecage"
    }
  ],
  "spell_list": [],
  "page_no": 240,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_locksmith/"
}