{
  "slug": "mad-piper",
  "desc": "A grey mound of flesh scuttles forward on mismatched limbs, its five heads trilling along on bone flutes. All the while, a harrowing tune plays from the column of pipes rising from its core._  \nMad pipers are the heralds of the Great Old Ones, a sign that a cult is getting close to achieving their goals. Cultists receive visions from their masters, filling their dreams with the esoteric rituals needed to create a mad piper. In short order, the cult gathers the components and creates these creatures, typically one for each cell of the cult. When the time comes for the cult to do battle, the mad pipers follow, inspiring the faithful with the alien songs of the Great Old Ones.  \n**The Ritual.** During the ritual, five humanoids, one of which must be a musician of some kind, are tied to a set of bagpipes made from an ogre’s bones and stomach. The ritual liquefies the humanoids, who fall into each other as all but their limbs and heads dissolve into a mass of grey flesh. Their minds, souls, and bodies forcefully merged, they start to play.  \n**Pets and Mascots.** Mad pipers aren’t naturally evil. Most are made from commoners, resulting in relatively docile and loyal creatures that imprint quickly onto cult members, who in turn often come to treat these abominations as pets. More violent and powerful mad pipers can be made from powerful, evil humanoids, though they are harder to control and often hostile to their creators.  \n**True Pipers.** Scholars speculate that the mad pipers are modelled after the heralds of the Crawling Chaos, and that it was he who gifted the first ritual to mortals on behalf of all Great Old Ones.  \n**Construct Nature.** The mad piper doesn’t require air, food, drink, or sleep.",
  "name": "Mad Piper",
  "size": "Large",
  "type": "Construct",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 12,
  "armor_desc": "padded armor",
  "hit_points": 19,
  "hit_dice": "3d8+6",
  "speed": {
    "walk": 30
  },
  "strength": 16,
  "dexterity": 8,
  "constitution": 14,
  "intelligence": 5,
  "wisdom": 7,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "performance": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "poison",
  "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned, prone",
  "senses": "darkvision 60 ft., passive Perception 8",
  "languages": "understands Common and Void Speech, but can’t speak",
  "challenge_rating": "2",
  "cr": 2,
  "actions": [
    {
      "name": "Screaming Flail",
      "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) bludgeoning damage plus 2 (1d4) thunder damage.",
      "attack_bonus": 5,
      "damage_dice": "2d6+3"
    },
    {
      "name": "Terrible Dirge",
      "desc": "The mad piper plays a haunting dirge. Each creature of the mad piper's choice that is within 30 feet of the piper and can hear the dirge must succeed o a DC 13 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the mad piper's Terrible Dirge for the next 24 hours."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Inspire",
      "desc": "As a bonus action, the mad piper can play a tune that inspires a friendly creature it can see within 30 feet of it. If the target can hear the mad piper, it has advantage on its next ability check, attack roll, or saving throw."
    }
  ],
  "spell_list": [],
  "page_no": 250,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_mad-piper/"
}