{
  "slug": "mineral-ooze",
  "desc": "Gray and amorphous, this creature skulks along the stone floor. Its body appears wet and oily, though an unusual crystalline pattern decorates the surface._  \n**Subterranean Menace.** A mineral ooze is a slime that hardens into solid rock after it engulfs its target, making escape much more difficult as it slowly digests the creature.  \n**Earthy Consistency.** The mineral ooze has a high concentration of silicates and crystal, which appear on the surface of the creature when it is in its gelatinous form. When it engulfs a creature, these minerals are pushed to the surface, where they harden quickly, trapping the creature. The ooze reverts to its liquid form after it has finished digesting the creature or if the creature escapes.  \n**Ooze Nature.** A mineral ooze doesn’t require sleep.",
  "name": "Mineral Ooze",
  "size": "Large",
  "type": "Ooze",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 9,
  "armor_desc": null,
  "hit_points": 76,
  "hit_dice": "8d10+32",
  "speed": {
    "walk": 20
  },
  "strength": 14,
  "dexterity": 8,
  "constitution": 18,
  "intelligence": 1,
  "wisdom": 5,
  "charisma": 3,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "acid, cold, fire",
  "damage_immunities": "",
  "condition_immunities": "blinded, charmed, deafened, exhaustion, frightened, prone",
  "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 7",
  "languages": "—",
  "challenge_rating": "3",
  "cr": 3,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mineral ooze makes two slam attacks. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 12), and the ooze uses its Encase on the target."
    },
    {
      "name": "Pseudopod",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) bludgeoning damage plus 3 (1d6) acid damage.",
      "attack_bonus": 4,
      "damage_dice": "1d8+2"
    },
    {
      "name": "Encase",
      "desc": "The mineral ooze encases a Medium or smaller creature grappled by it. The encased target is blinded, restrained, and unable to breathe, and it must succeed on a DC 14 Constitution saving throw at the start of each of the ooze's turns or take 7 (2d6) acid damage. If the ooze moves, the encased target moves with it. The ooze can have only one creature encased at a time. An encased creature can try to escape by taking an action to make a DC 12 Strength check. The creature has disadvantage on this check if the ooze is mineralized. On a success, the creature escapes and enters a space of its choice within 5 feet of the ooze. Alternatively, a creature within 5 feet of the ooze can take an action to pull a creature out of the ooze. Doing so requires a successful DC 12 Strength check, and the creature making the attempt takes 7 (2d6) acid damage. The creature making the attempt has disadvantage on the check if the ooze is mineralized."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amorphous",
      "desc": "The ooze can move through a space as narrow as 1 inch wide without squeezing."
    },
    {
      "name": "False Appearance",
      "desc": "While the ooze remains motionless, it is indistinguishable from an oily pool or wet rock."
    },
    {
      "name": "Mineralize",
      "desc": "As a bonus action when it has encased a creature, the ooze hardens the minerals in its body, turning the surface of its body into a stone-like material. While mineralized, the ooze has a walking speed of 5 feet, and it has resistance to bludgeoning, piercing, and slashing damage. The ooze remains mineralized until the creature it has encased dies, or until the ooze takes a bonus action to end it."
    }
  ],
  "spell_list": [],
  "page_no": 280,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_mineral-ooze/"
}