{
  "slug": "mountain-dryad",
  "desc": "An enormous woman covered in rocky formations accented with crystals emerges from the mountainside._  \nOften mistaken for giants, mountain dryads are huge fey who are tied to primal mountains.  \n**Like the Mountain.** Mountain dryads are sturdier than their smaller, frailer sisters. Their beauty is more rugged, with hair the color of lichen and skin the shade of their mountain’s stone.  \n**Despise Mining.** Mountain dryads tend to spend long stretches of time sleeping deep within their mountains, and they do not take kindly to the scarring of their homes. The dryads have a particular dislike for dwarves, kobolds, and others who make their living mining mountains.",
  "name": "Mountain Dryad",
  "size": "Huge",
  "type": "Fey",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 172,
  "hit_dice": "15d12+75",
  "speed": {
    "walk": 40,
    "burrow": 30
  },
  "strength": 29,
  "dexterity": 12,
  "constitution": 20,
  "intelligence": 14,
  "wisdom": 18,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 9,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": 8,
  "perception": 8,
  "skills": {
    "athletics": 13,
    "intimidation": 8,
    "perception": 8,
    "stealth": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "lightning",
  "damage_immunities": "cold, poison",
  "condition_immunities": "charmed, exhaustion, paralyzed, petrified, poisoned, unconscious",
  "senses": "darkvision 60 ft., tremorsense 60 ft; passive Perception 18",
  "languages": "Sylvan, Terran",
  "challenge_rating": "11",
  "cr": 11,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The mountain dryad makes two slam attacks."
    },
    {
      "name": "Slam",
      "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 27 (4d8 + 9) bludgeoning damage.",
      "attack_bonus": 13,
      "damage_dice": "4d8+9"
    },
    {
      "name": "Rock",
      "desc": "Ranged Weapon Attack: +13 to hit, range 60/240 ft., one target. Hit: 31 (4d10 + 9) bludgeoning damage.",
      "attack_bonus": 13,
      "damage_dice": "4d10+9"
    },
    {
      "name": "Mountain's Awe (1/Day)",
      "desc": "The mountain dryad emits a magical aura that radiates out from it for 1 minute. Each creature that starts its turn within 30 feet of the dryad must succeed on a DC 16 Charisma saving throw or be charmed for 1 minute. A charmed creature is incapacitated and, if it is more than 5 feet away from the mountain dryad, it must move on its turn toward the dryad by the most direct route, trying to get within 5 feet. It doesn't avoid opportunity attacks, but before moving into damaging terrain, such as lava or a pit, and whenever it takes damage from a source other than the dryad, it can repeat the saving throw. While charmed within 5 feet of the dryad, a Medium or smaller creature must climb the dryad, no check required. After climbing 20 feet, the charmed creature throws itself off the mountain dryad, taking falling damage and landing prone in an unoccupied space within 5 feet of the mountain dryad. A charmed creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Earth Glide",
      "desc": "The mountain dryad can burrow through nonmagical, unworked earth and stone. While doing so, the dryad doesn't disturb the material it moves through."
    },
    {
      "name": "Magic Resistance",
      "desc": "The mountain dryad has advantage on saving throws against spells and other magical effects."
    },
    {
      "name": "Mountain's Aspect",
      "desc": "Each day at sunrise, the mountain dryad chooses one of the following: \n* Hardened Face. The mountain dryad chooses one of bludgeoning, piercing, or slashing damage types. The mountain dryad has resistance to the chosen damage type until the next sunrise. \n* Vaunted Peaks. The mountain dryad has advantage on Wisdom (Perception) checks until the next sunrise. \n* Rockslider. As a bonus action once before the next sunrise, the mountain dryad can make the ground within 30 feet of it difficult terrain. This difficult terrain doesn't cost the dryad extra movement."
    },
    {
      "name": "Siege Monster",
      "desc": "The mountain dryad deals double damage to objects and structures."
    }
  ],
  "spell_list": [],
  "page_no": 261,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_mountain-dryad/"
}