{
  "slug": "nihileth-tob1-2023",
  "desc": "False",
  "name": "Nihileth",
  "size": "Large",
  "type": "Undead",
  "subtype": "",
  "group": "null",
  "alignment": "Chaotic Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 157,
  "hit_dice": "21d10 + 42",
  "speed": {
    "walk": 40
  },
  "strength": 21,
  "dexterity": 9,
  "constitution": 15,
  "intelligence": 18,
  "wisdom": 15,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 7,
  "intelligence_save": 9,
  "wisdom_save": 7,
  "charisma_save": null,
  "perception": 20,
  "skills": {
    "History": 12,
    "Perception": 10
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing and slashing from nonmagical attacks",
  "damage_immunities": "cold, necrotic, poison",
  "condition_immunities": "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, restrained",
  "senses": "darkvision 120 ft., passive Perception 20",
  "languages": "Void Speech, telepathy 120 ft.",
  "challenge_rating": "13",
  "cr": 13,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The nihileth makes two Tentacle attacks and one Tail attack, or it makes three Withering Touch attacks."
    },
    {
      "name": "Tail (Undead Form Only)",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft. one target. Hit: 15 (3d6 + 5) bludgeoning damage."
    },
    {
      "name": "Tentacle (Undead Form Only)",
      "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage, and the target must succeed on a DC 15 Constitution saving throw or contract the nihilethic rot disease (see the Nihilethic Rot trait)."
    },
    {
      "name": "Withering Touch (Void Ghost Form Only)",
      "desc": "Melee Spell Attack: +9 to hit, reach 10 ft., one creature. Hit: 14 (3d6 + 4) necrotic damage."
    }
  ],
  "bonus_actions": [
    {
      "name": "Void Shape",
      "desc": "The nihileth magically transforms into a dark purple, Void ghost form or back into its Undead form. Its statistics, other than its speed, resistances, and immunities, are the same in each form. Any equipment it is wearing or carrying changes with it. It reverts to its Undead form if it dies."
    }
  ],
  "reactions": [
    {
      "name": "Void Body",
      "desc": "When the nihileth takes damage, it can reduce the damage to 0. Radiant damage can be reduced by only half."
    }
  ],
  "legendary_desc": "The nihileth can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The nihileth regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Detect",
      "desc": "The nihileth makes a Wisdom (Perception) check."
    },
    {
      "name": "Tail Swipe",
      "desc": "The nihileth makes one Tail attack."
    },
    {
      "name": "Rotten Drain (Costs 2 Actions)",
      "desc": "One creature infected with the nihilethic rot disease within 30 feet of the nihileth takes 10 (3d6) psychic damage, and the nihileth regains hp equal to that amount."
    }
  ],
  "special_abilities": [
    {
      "name": "Ghostly Body (Void Ghost Form Only)",
      "desc": "The nihileth has resistance to acid, fire, lightning, and thunder damage, it has immunity to the prone condition, and it has immunity to bludgeoning, piercing, and slashing damage from nonmagical attacks. In addition, the nihileth can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."
    },
    {
      "name": "Infecting Telepathy",
      "desc": "If a creature communicates telepathically with the nihileth, or deals psychic damage to it, the creature must succeed on a DC 15 Wisdom saving throw or become infected with the nihilethic rot disease."
    },
    {
      "name": "Nihilethic Rot",
      "desc": "This disease takes 1 minute to manifest in an infected creature, during which time the disease can be removed with the lesser restoration spell. After 1 minute, the creature's flesh becomes slimy and translucent, and the disease can be cured only by the heal spell or similar magic. Until this disease is cured, the creature can't regain hp unless it is submerged in water, and it can breathe air and water. The creature must be submerged in water at least once every 2 hours to avoid suffocating, and if it is outside a body of water, it takes 7 (2d6) acid damage every 10 minutes, unless moisture is applied to its skin before 10 minutes have passed. If a Humanoid dies while infected with this disease, it rises 1 minute later as a nihilethic zombie under the nihileth's control. If a Large giant or monstrosity dies while infected with this disease, it rises 1 minute later as a nihilethic dominator under the nihileth's control."
    },
    {
      "name": "Undead Fortitude",
      "desc": "If damage reduces the nihileth to 0 hp, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the nihileth drops to 1 hp instead."
    },
    {
      "name": "Undead Nature",
      "desc": "The nihileth doesn't require air, food, drink, or sleep."
    },
    {
      "name": "Void Aura",
      "desc": "The nihileth is surrounded by a chilling cloud. A creature that isn't a construct or undead and that starts its turn within 5 feet of the nihileth must succeed on a DC 15 Constitution saving throw or its speed is halved until the start of its next turn. In addition, a creature infected with nihilethic rot takes 7 (2d6) cold damage when it starts its turn within this aura."
    }
  ],
  "spell_list": [],
  "page_no": 9,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_nihileth/"
}