{
  "slug": "oculoswarm-tob1-2023",
  "desc": "False",
  "name": "Oculo Swarm",
  "size": "Large",
  "type": "Swarm",
  "subtype": "",
  "group": "null",
  "alignment": "Neutral Evil",
  "armor_class": 15,
  "armor_desc": "",
  "hit_points": 82,
  "hit_dice": "11d10 + 22",
  "speed": {
    "walk": 40,
    "fly": 5
  },
  "strength": 10,
  "dexterity": 20,
  "constitution": 14,
  "intelligence": 8,
  "wisdom": 15,
  "charisma": 17,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 16,
  "skills": {
    "Insight": 6,
    "Perception": 6,
    "Stealth": 7
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "bludgeoning, piercing, slashing",
  "damage_immunities": "False",
  "condition_immunities": "charmed, frightened, grappled, paralyzed, petrified, prone, restrained, stunned",
  "senses": "darkvision 60 ft., passive Perception 16",
  "languages": "understands Common but can’t speak",
  "challenge_rating": "4",
  "cr": 4,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The oculo swarm makes two Extract Eye attacks. If both attacks hit one creature, the target must succeed on a DC 13 Strength saving throw or the swarm removes one of its eyes. While missing half or fewer of its total number of eyes, the target has disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight. While missing more than half its total number of eyes, the target is blinded until its sight is restored. If the target's eye is recovered from the defeated swarm, it can be reattached with a successful DC 12 Wisdom (Medicine) check, provided the eye is reattached within 1 hour of the target losing the eye."
    },
    {
      "name": "Extract Eye",
      "desc": "Melee Weapon Attack: +7 to hit, reach 0 ft., one creature in the swarm's space. Hit: 18 (4d8) piercing damage, or 9 (2d8) piercing damage if the swarm has half of its hp or fewer."
    },
    {
      "name": "Disorienting Gaze (Recharge 5-6)",
      "desc": "The swarm's many eyes suddenly turn in different directions. Each creature within 10 feet of the oculo swarm must make a DC 13 Charisma saving throw. On a failure, a creature takes 21 (6d6) psychic damage and is disoriented until the end of its next turn. On a success, a creature takes half the damage and isn't disoriented. A disoriented creature is incapacitated and moves in a random direction when it moves."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": null,
  "legendary_actions": [],
  "special_abilities": [
    {
      "name": "Hundreds of Eyes",
      "desc": "The oculo swarm has advantage on Wisdom (Perception) checks that rely on sight and on saving throws against being blinded. In addition, if the swarm isn't blinded, creatures attacking it can't benefit from traits and features that rely on a creature's allies distracting or surrounding the swarm, such as the Pack Tactics trait or Sneak Attack class feature."
    },
    {
      "name": "Swarm",
      "desc": "The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny eyeball. The swarm can't regain hp or gain temporary hp."
    }
  ],
  "spell_list": [],
  "page_no": 288,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_oculo-swarm/"
}