{
  "slug": "pactvampire-tob1-2023",
  "desc": "False",
  "name": "Pact Vampire",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": "null",
  "alignment": "Any Evil Alignment",
  "armor_class": 16,
  "armor_desc": "natural armor",
  "hit_points": 178,
  "hit_dice": "17d8 + 102",
  "speed": {
    "walk": 30
  },
  "strength": 22,
  "dexterity": 16,
  "constitution": 22,
  "intelligence": 17,
  "wisdom": 15,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 8,
  "constitution_save": 11,
  "intelligence_save": null,
  "wisdom_save": 7,
  "charisma_save": 10,
  "perception": 17,
  "skills": {
    "Perception": 7,
    "Persuasion": 10,
    "Stealth": 8
  },
  "damage_vulnerabilities": "False",
  "damage_resistances": "necrotic; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 120 ft., passive Perception 17",
  "languages": "the languages it knew in life",
  "challenge_rating": "15",
  "cr": 15,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The pact vampire makes three Claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage plus 13 (3d8) poison damage."
    },
    {
      "name": "Call Blood",
      "desc": "The pact vampire draws the blood out of a bleeding creature's body, where it flows through the air into the vampire's mouth. One creature the vampire can see within 60 feet of it that doesn't have all its hp and isn't a Construct or Undead must succeed on a DC 18 Constitution saving throw or take 22 (4d10) necrotic damage, and its hp maximum is reduced by that amount. The vampire regains hp equal to half the damage dealt. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0."
    },
    {
      "name": "Charm",
      "desc": "One Humanoid the vampire can see within 30 feet of it must succeed on a DC 18 Wisdom saving throw or be magically charmed for 1 day. The charmed target obeys the vampire's verbal commands. If the target suffers any harm or receives a suicidal command, it can repeat the saving throw, ending the effect on itself on a success. If the target's saving throw is successful or the effect ends for it, the target is immune to this vampire's Charm for the next 24 hours."
    },
    {
      "name": "Children of the Lower Planes (1/Day)",
      "desc": "The pact vampire magically calls 2d4 dretches, 1d4 imps, or 1 bearded devil. The called Fiends arrive in 1d4 rounds, acting as allies of the vampire and obeying its spoken commands. The Fiends remain for 1 hour, until the vampire dies, or until the vampire dismisses them as a bonus action."
    }
  ],
  "bonus_actions": [],
  "reactions": [],
  "legendary_desc": "The pact vampire can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The vampire regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Move",
      "desc": "The pact vampire moves up to its speed without provoking opportunity attacks."
    },
    {
      "name": "Call Blood (Costs 2 Actions)",
      "desc": "The pact vampire uses Call Blood."
    },
    {
      "name": "Spread Poison (Costs 2 Actions)",
      "desc": "The pact vampire's blood briefly turns into a mist around it. Each creature within 15 feet of the vampire must succeed on a DC 18 Constitution saving throw or take 14 (4d6) poison damage and be poisoned until the end of its next turn."
    }
  ],
  "special_abilities": [
    {
      "name": "Blood Sense",
      "desc": "The pact vampire can pinpoint the location of creatures that aren't Constructs or Undead within 60 feet of it and can sense the general direction of such creatures within 1 mile of it."
    },
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the pact vampire fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Poisonous Blood",
      "desc": "A creature that hits the pact vampire with a melee attack while within 5 feet of it takes 7 (2d6) poison damage."
    },
    {
      "name": "Regeneration",
      "desc": "The pact vampire regains 25 hp at the start of its turn if it has at least 1 hp and isn't in sunlight. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn."
    },
    {
      "name": "Undead Nature",
      "desc": "The pact vampire doesn't require air."
    },
    {
      "name": "Vampire Weaknesses",
      "desc": "The pact vampire has the following flaws:"
    }
  ],
  "spell_list": [],
  "page_no": 380,
  "environments": [],
  "img_main": "http://api.open5e.com/",
  "document__slug": "tob-2023",
  "document__title": "Tome of Beasts 2023",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/",
  "v2_converted_path": "/v2/creatures/tob-2023_pact-vampire/"
}