{
  "slug": "parzzval",
  "desc": "Six legs, ending in massive, three-fingered humanoid hands, support a headless horse-like torso. The front of this creature’s mass opens into a huge tripartite maw filled with jagged, web-shrouded ridges dripping a caustic substance._  \n**Bottomless Hunger.** Parzz’vals have enough intelligence to reason and problem solve, but they are largely guided by their monstrous appetites. Parzz’vals prefer live prey but are not above eating carrion if their preferred meal isn’t available.  \n**Ambush Hunters.** Despite their enormous hunger, parzz’vals are excellent at taking their prey by surprise. A parzz’val can wait patiently for hours for the ideal time to strike if they anticipate a meal awaits as a reward.",
  "name": "Parzz’val",
  "size": "Large",
  "type": "Aberration",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 115,
  "hit_dice": "11d10+55",
  "speed": {
    "walk": 50
  },
  "strength": 21,
  "dexterity": 16,
  "constitution": 20,
  "intelligence": 5,
  "wisdom": 10,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": 8,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "stealth": 6
  },
  "damage_vulnerabilities": "thunder",
  "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "acid",
  "condition_immunities": "blinded, charmed, unconscious",
  "senses": "blindsight 120 ft., passive Perception 10",
  "languages": "Void Speech",
  "challenge_rating": "8",
  "cr": 8,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The parzz'val makes three attacks: one with its oversized maw and two with its oversized fists."
    },
    {
      "name": "Oversized Fist",
      "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 10 (2d4 + 5) bludgeoning damage.",
      "attack_bonus": 8,
      "damage_dice": "2d4+5"
    },
    {
      "name": "Oversized Maw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) piercing damage plus 4 (2d8) acid damage. If the target is a Medium or smaller creature, it must succeed on a DC 16 Dexterity saving throw or be swallowed by the parzz'val. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the parzz'val, and it takes 18 (4d8) acid damage at the start of each of the parzz'val's turns. A parzz'val can have only one creature swallowed at a time.\n\nIf the parzz'val takes 15 damage or more on a single turn from a creature inside it, the parzz'val must succeed on a DC 18 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 10 feet of the parzz'val. If the parzz'val dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 10 feet of movement, exiting prone.",
      "attack_bonus": 8,
      "damage_dice": "2d6+5"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Caustic Web (Recharge 5-6)",
      "desc": "As a bonus action, the parzz'val can spit a sticky, acidic web in a 20-foot cube. The web must be placed wholly within 60 feet of the parzz'val and must be anchored between two solid masses or layered across a floor, wall, or ceiling. A web layered over a flat surface has a depth of 5 feet. The web is difficult terrain and lightly obscures the area.\n\nA creature that starts its turn in the web or enters the web during its turn must make a DC 16 Dexterity saving throw, taking 9 (2d8) acid damage on a failed save, or half as much damage on a successful one.\n\nThe web persists for 1 minute before collapsing. The parzz'val is immune to the effects of its web and the webs of other parzz'vals."
    },
    {
      "name": "Pummel",
      "desc": "If the parzz'val deals damage to a creature with three melee attacks in one round, it has advantage on all melee attacks it makes against that creature in the next round."
    },
    {
      "name": "Regeneration",
      "desc": "The parzz'val regains 10 hp at the start of its turn if it has at least 1 hp."
    }
  ],
  "spell_list": [],
  "page_no": 292,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_parzzval/"
}