{
  "slug": "ramag",
  "desc": "_These few denizens of a blasted desert waste now huddle in the remains of an ancient city—a city magically scattered across hundreds of miles._  \n**Once Human.** The ramag were a powerful tribe of dimensional sorcerers allied with a great society of titans, and they were indeed human in ages past. Over time, strange practices warped them into their current state, and they are clearly no longer purely human. Their limbs grow too long in proportion to their bodies, giving them a stooped, odd posture. Their features are angular, and a ramag’s hair is impossibly thick; each strand is the width of a human finger. They wear their strange hair tied back in decorative clasps.  \n**Portal Network.** The ramag used their innate magical gifts to maintain powerful magical conduits, ley lines that crisscrossed the titan’s empire. This mastery of arcane might allowed instantaneous travel to the farthest-flung outpost. The ramag still maintain a network of magical monoliths that connect the scattered districts of their home, but this network is frayed and fading.  \n**Studious and Powerful.** Although physically weak, the ramag are sharp-witted, studious, and naturally infused with magic. Lifetimes of exposure to the warping effect of their runaway magical energy have given the ramag innate control over magic, as well as sharp resistance to it. They are acutely aware of their responsibility for keeping magic in check, and fully know the danger of uncontrolled magical energies. Even the the lowliest ramag has a sharp intellect and a natural understanding of magic. Many ramag take up the study of wizardry. Few become wandering adventurers, but well-equipped expeditions sometimes leave their homeland to inspect the surrounding countryside.",
  "name": "Ramag",
  "size": "Medium",
  "type": "Humanoid",
  "subtype": "ramag",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 13,
  "armor_desc": "leather armor",
  "hit_points": 27,
  "hit_dice": "6d8",
  "speed": {
    "walk": 30
  },
  "strength": 9,
  "dexterity": 14,
  "constitution": 10,
  "intelligence": 16,
  "wisdom": 12,
  "charisma": 11,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {
    "arcana": 5,
    "investigation": 5
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "passive Perception 11",
  "languages": "Common",
  "challenge_rating": "1/4",
  "cr": 0.25,
  "actions": [
    {
      "name": "Scimitar",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage.",
      "attack_bonus": 4,
      "damage_dice": "1d6"
    },
    {
      "name": "Shortbow",
      "desc": "Ranged Weapon Attack: +4 to hit, range 80/320 ft., one target. Hit: 5 (1d6 + 2) piercing damage.",
      "attack_bonus": 4,
      "damage_dice": "1d6"
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Magic Resistance",
      "desc": "The ramag has advantage on saving throws against spells or other magical effects."
    }
  ],
  "spell_list": [],
  "page_no": 317,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_ramag/"
}