{
  "slug": "sporous-crab",
  "desc": "Most sporous crabs spend a considerable amount of their lives in sewers and brackish ponds. The filth clings to them throughout their lives, and they are toxic to almost every creature they encounter. The sporous crab is usually found near the Open Game License",
  "name": "Sporous Crab",
  "size": "Small",
  "type": "Beast",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 33,
  "hit_dice": "6d6+12",
  "speed": {
    "walk": 30,
    "swim": 30
  },
  "strength": 14,
  "dexterity": 8,
  "constitution": 15,
  "intelligence": 3,
  "wisdom": 13,
  "charisma": 4,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "fire",
  "damage_resistances": "bludgeoning",
  "damage_immunities": "poison",
  "condition_immunities": "poisoned",
  "senses": "darkvision 60 ft., passive Perception 11",
  "languages": "—",
  "challenge_rating": "1",
  "cr": 1,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The sporous crab makes two claw attacks."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. Hit: 4 (1d4 + 2) bludgeoning damage.",
      "attack_bonus": 4,
      "damage_dice": "1d4+2"
    },
    {
      "name": "Spore (Recharge 6)",
      "desc": "The sporous crab sprays spores in a 15-foot cone. Each creature in the area must make a DC 12 Constitution saving throw. On a failure, a creature takes 7 (2d6) poison damage and becomes infected with the crab's spores. On a success, a creature takes half the damage and isn't infected with spores. After 1 hour, small bubbles and bumps appear across the skin of the infected creature. At the end of each long rest, the infected creature must make a DC 12 Constitution saving throw. On a success, the infected creature's body fights off the spores and no longer has to make the saving throw. If a creature fails the saving throw every day for 7 days, young sporous crabs hatch from the creature's skin, and the creature takes 9 (2d8) slashing damage. The spores can also be removed with a lesser restoration spell or similar magic."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Amphibious",
      "desc": "The sporous crab can breathe air and water."
    },
    {
      "name": "Filthy",
      "desc": "The sporous crab makes its home in grime and muck and is covered in filth. A creature that touches the sporous crab or hits it with a melee attack while within 5 feet of it must succeed on a DC 12 Constitution saving throw or be poisoned until the end of its next turn. If a creature fails the saving throw by 5 or more, it also contracts sewer plague. On a successful saving throw, the creature is immune to the crab's Filthy trait for the next 24 hours."
    }
  ],
  "spell_list": [],
  "page_no": 398,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_sporous-crab/"
}