{
  "slug": "tembril",
  "desc": "Standing on its back legs and holding a decapitated human head in its hands, this nightmarish creature resembles a gigantic squirrel with saber-like teeth, soulless black eyes, and hard, scaly skin. It chitters softly and eerily._  \n**Forest Terrors.** In the dark and foreboding forests of the north, tales are spun of terrible ogres, hags, evil wolves, and great arctic serpents, but humans and ogres alike fear the tembril, a savage monstrosity that feeds specifically on the eyes, tongues, and brains of humanoids. Resembling a squirrel the size of a bear, but with brown scales and immense claws and fangs, the tembril hunts sapient fey, humanoids, and giants exclusively, using its claws to eviscerate its opponent as its teeth punctures their skulls.  \n**Head Collectors.** The victim of a tembril attack is almost always found without its head, for the creature collects the severed cranium to devour the contents either immediately or at a later time. Tembrils store the heads in the long winter months, hiding them within the hollows of great trees or in other suitable locations and covering them in ice so they don’t decompose. The decapitated bodies left behind make a meal for many forest-dwelling scavengers, and crows, Open Game License",
  "name": "Tembril",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Unaligned",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 114,
  "hit_dice": "12d10+48",
  "speed": {
    "walk": 40
  },
  "strength": 19,
  "dexterity": 14,
  "constitution": 18,
  "intelligence": 4,
  "wisdom": 15,
  "charisma": 16,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 5,
  "skills": {
    "perception": 5,
    "stealth": 8
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "cold",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 15",
  "languages": "—",
  "challenge_rating": "6",
  "cr": 6,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The tembril makes three attacks: one with its bite and two with its claws."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage. If the tembril scores a critical hit against a Medium or smaller target and the damage reduces the target to below half its hp maximum, the target must succeed on a DC 15 Constitution saving throw or be instantly killed as its head is removed. A creature is immune to this effect if it is immune to piercing damage or doesn't have or need a head.",
      "attack_bonus": 7,
      "damage_dice": "2d8+4"
    },
    {
      "name": "Claws",
      "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Maddening Chitter (Recharge 6)",
      "desc": "The tembril chitters maddeningly in a 30-foot cone. Each creature in that area must make a DC 15 Wisdom saving throw. On a failure, a creature takes 21 (6d6) psychic damage and is incapacitated for 1 minute. On a success, a creature takes half the damage and isn't incapacitated. If a creature fails the saving throw by 5 or more, it also suffers short-term madness. An incapacitated creature can repeat the saving throw at the end of each of its turns, ending the incapacitated condition on itself on a success."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Ambusher",
      "desc": "In the first round of combat, the tembril has advantage on attack rolls against any creature it has surprised."
    },
    {
      "name": "Nimble Leap",
      "desc": "The tembril can take the Dash or Disengage action as a bonus action on each of its turns."
    }
  ],
  "spell_list": [],
  "page_no": 344,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_tembril/"
}