{
  "slug": "vapor-lynx",
  "desc": "_These great cats pad noiselessly, while tendrils of smoke drift off their sleek gray coats, leaving misty whorls in their wake. Their eyes shift from dull, pallid orbs to pitch black slits. Their lips curl up into a fang-revealing smile as their bodies fades into fog._  \n**Split the Herd.** Vapor lynxes are capricious hunters. Devious, manipulative, and mischievous, they toy with their prey before killing it. They rarely enjoy a stand-up fight, instead coalescing in and out of the fog to harass victims. Using their ability to solidify and poison the fog around them, they cut large groups into smaller, more manageable morsels.  \n**Dreary Marshlands.** Their tactics have earned vapor lynxes a nasty reputation and the occasional bounty on their heads. Additionally, their magical nature makes them valuable to practitioners of the magical arts, and their beautiful, thick coats tempt many a furrier into hunts they may not be prepared for. For these reasons, vapor lynxes avoid civilization, fearing organized reprisal. Instead they haunt marshes and swamps, where the natural fog makes hunting easier. If an intelligent humanoid passes their way, they are happy for a change in their diet.  \n**Chatty with Dinner.** Although reclusive, vapor lynxes are intelligent, speaking both Common and Sylvan. They are particularly prideful and take great joy in bantering with potential meals to belittle and frighten them. Survivors of vapor lynx encounters invariably mention their constant needling and self-aggrandizement.",
  "name": "Vapor Lynx",
  "size": "Large",
  "type": "Monstrosity",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Neutral",
  "armor_class": 14,
  "armor_desc": "natural armor",
  "hit_points": 127,
  "hit_dice": "15d10+45",
  "speed": {
    "walk": 50,
    "climb": 30
  },
  "strength": 15,
  "dexterity": 18,
  "constitution": 16,
  "intelligence": 10,
  "wisdom": 13,
  "charisma": 14,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": 4,
  "skills": {
    "perception": 4,
    "stealth": 7
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "darkvision 60 ft., passive Perception 14",
  "languages": "Common, Sylvan",
  "challenge_rating": "5",
  "cr": 5,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The vapor lynx makes one bite attack and two claw attacks."
    },
    {
      "name": "Bite",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 17 (3d8 + 4) piercing damage.",
      "attack_bonus": 7,
      "damage_dice": "3d8"
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "attack_bonus": 7,
      "damage_dice": "2d8"
    },
    {
      "name": "Poison Breath (Recharge 5-6)",
      "desc": "The vapor lynx exhales a 40- foot radius poison fog, which heavily obscures a spherical area around the lynx. Any breathing creature that ends its turn in the fog must make a DC 14 Constitution saving throw or become poisoned for 1d4 + 1 rounds."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Innate Spellcasting",
      "desc": "the lynx's innate spellcasting ability is Charisma. It can cast the following spell, requiring no material components:\n\n3/day: gaseous form"
    },
    {
      "name": "Smoky Constitution",
      "desc": "The vapor lynx spends its time in both gaseous and solid form. Its unique constitution makes it immune to all fog- or gas-related spells and attacks, including its own. A vapor lynx sees clearly through light or heavy obscurement caused by fog, mist, or spells such as fog cloud."
    }
  ],
  "spell_list": [],
  "page_no": 398,
  "environments": [],
  "img_main": null,
  "document__slug": "tob",
  "document__title": "Tome of Beasts",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/",
  "v2_converted_path": "/v2/creatures/tob_vapor-lynx/"
}