{
  "slug": "virtuoso-lich",
  "desc": "The beautiful singer bows to the adoring crowd before stepping behind the curtain. Away from the eyes of the crowd, the singer changes its half-mask, briefly revealing a ghastly, undead visage._  \nA virtuoso lich is an artist whose love of art sustains it beyond death.  \n**Birthed by Art.** A virtuoso lich is created when an artist powerful in both its artistic and magical expression dies with art left undone. Such artists often die before completing or creating a masterpiece, and the torment of the art left undone couples with the artist’s powerful magical talents, turning the artist into a virtuoso lich. A virtuoso lich is bound to an object of art, such as a favorite musical instrument, painting, dance slippers, quill, or some other object of artistic expression that was significant to the lich in life. This piece of art is the lich’s phylactery.  \n**Beautiful Mien.** A virtuoso lich maintains the beauty of its former life, appearing much as it did in life—save for one physical feature that betrays its undead nature. This undead feature can be a clawed, skeletal hand, which the lich hides in a glove; a stiff, zombie-like leg, which the lich disguises with robes and a cane; a face ravaged by undeath, which the lich covers in a beautiful mask; or any other appropriate feature.  \n**Undead Nature.** The virtuoso lich doesn’t require air, food, drink, or sleep.  \n\n## A Virtuoso Lich’s Lair\n\n  \nA virtuoso lich chooses a lair with an eye and ear for artistic potential, whether that lair is an ancient cavern with natural acoustics, a meadow with plentiful natural light, a hall of mirrors, or some other locale capable of enhancing some form of art, allowing the lich’s magic and artistic expression to swell, reaching every corner.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the virtuoso lich takes a lair action to cause one of the following effects; the lich can’t use the same effect two rounds in a row:\n* The virtuoso lich channels artistic expression it can see or hear into a magical assault. The artistic expression must be of the type chosen with the Versatile Artist trait, but it otherwise can be any form of expression not originating from the lich, such as the song of nearby singers that echoes in the lair, the colorful paint decorating canvases, the twirling forms of dancers, or similar. The virtuoso lich chooses a creature it can see within 30 feet of the artistic expression. The target must make a DC 15 Dexterity saving throw, taking 18 (4d8) damage of the type chosen with the Versatile Artist trait on a failed save, or half as much damage on a successful one.\n* The virtuoso lich enhances the natural artistry of its lair, distracting and hindering nearby creatures. The lich chooses a point it can see within 60 feet of it. Each creature within 5 feet of that point must make a DC 15 Charisma saving throw. On a failure, a creature has disadvantage on saving throws against the lich’s spells and its Corrupted Art action until initiative count 20 on the next round.\n* The virtuoso lich rolls a d4 and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.",
  "name": "Virtuoso Lich",
  "size": "Medium",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Any Evil Alignment",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 123,
  "hit_dice": "19d8+38",
  "speed": {
    "walk": 30
  },
  "strength": 11,
  "dexterity": 16,
  "constitution": 15,
  "intelligence": 15,
  "wisdom": 12,
  "charisma": 20,
  "strength_save": null,
  "dexterity_save": 7,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": 6,
  "charisma_save": 9,
  "perception": 5,
  "skills": {
    "deception": 9,
    "perception": 5,
    "persuasion": 9
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "necrotic; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "poison",
  "condition_immunities": "blinded, deafened, charmed, exhaustion, frightened, paralyzed, poisoned",
  "senses": "truesight 60 ft., passive Perception 15",
  "languages": "Common, plus up to two other languages",
  "challenge_rating": "12",
  "cr": 12,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The virtuoso lich uses its Corrupted Art. It then makes two Artistic Flourish attacks."
    },
    {
      "name": "Artistic Flourish",
      "desc": "Melee Spell Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) damage of the type chosen with the Versatile Artist trait.",
      "attack_bonus": 9,
      "damage_dice": "2d6+5"
    },
    {
      "name": "Corrupted Art",
      "desc": "The lich hums a discordant melody, paints a crumbling symbol of death in the air, performs a reality-bending pirouette, or emulates some other expression of corrupted or twisted art and targets one creature it can see within 60 feet. This action's effects change, depending on if the target is undead. \n* Non-Undead. The target must make a DC 16 Constitution saving throw, taking 18 (4d8) necrotic damage on a failed save, or half as much damage on a successful one. \n* Undead. The target regains 18 (4d8) hit points. Healing that exceeds the target's hp maximum becomes temporary hit points."
    },
    {
      "name": "Call Muse",
      "desc": "The lich targets one humanoid or beast it can see within 30 feet of it. The target must succeed on a DC 17 Wisdom saving throw or be charmed by the lich for 1 minute. The charmed target, the lich's “muse,” has a speed of 0 and is incapacitated as it watches or listens to the lich's artistic expression. The muse can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the lich's Call Muse for the next 24 hours. If the muse suffers harm from the lich, it is no longer charmed.\n\nThe lich can have only one muse at a time. If it charms another, the effect on the previous muse ends. If the lich is within 30 feet of its muse and can see its muse, the lich has advantage on its first Artistic Flourish attack each round against a creature that isn't its muse."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "The virtuoso lich can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The lich regains spent legendary actions at the start of its turn.",
  "legendary_actions": [
    {
      "name": "Artistic Flourish",
      "desc": "The lich makes one Artistic Flourish attack."
    },
    {
      "name": "Move",
      "desc": "The lich moves up to its speed without provoking opportunity attacks."
    },
    {
      "name": "Cast a Spell (Costs 3 Actions)",
      "desc": "The lich casts a spell from its list of prepared spells, using a spell slot as normal."
    },
    {
      "name": "Unrestrained Art (Costs 3 Actions)",
      "desc": "The lich unleashes the full force of its artistic talents on those nearby. Each creature with 10 feet of the lich must make a DC 16 Dexterity saving throw. On a failure, a creature takes 18 (4d8) damage of the type chosen with the Versatile Artist trait and is knocked prone. On a success, a creature takes half the damage and isn't knocked prone."
    }
  ],
  "special_abilities": [
    {
      "name": "Legendary Resistance (3/Day)",
      "desc": "If the lich fails a saving throw, it can choose to succeed instead."
    },
    {
      "name": "Rejuvenation",
      "desc": "If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery."
    },
    {
      "name": "Turn Resistance",
      "desc": "The lich has advantage on saving throws against any effect that turns undead."
    },
    {
      "name": "Versatile Artist",
      "desc": "At the end of each long rest, the lich chooses one form of artistic expression, such as song, poetry, dance, fashion, paint, or similar. Until it finishes a long rest, the lich has immunity to one type of damage, which is associated with its artistic expression. For example, a lich expressing art through song or poetry has immunity to thunder damage, a lich expressing art through fashion has immunity to slashing damage, and a lich expressing art through paint has immunity to acid damage. This trait can't give the lich immunity to force, psychic, or radiant damage."
    },
    {
      "name": "Spellcasting",
      "desc": "The virtuoso lich is a 12th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). It has the following bard spells prepared:\nCantrips (at will): mage hand, message, true strike, vicious mockery\n1st level (4 slots): bane, hideous laughter, thunderwave\n2nd level (3 slots): enthrall, hold person, invisibility, shatter\n3rd level (3 slots): dispel magic, fear, speak with dead\n4th level (3 slots): compulsion, confusion, dimension door\n5th level (2 slots): dominate person, mislead\n6th level (1 slot): irresistible dance, programmed illusion"
    }
  ],
  "spell_list": [],
  "page_no": 237,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_virtuoso-lich/"
}