{
  "slug": "walled-horror",
  "desc": "An unnatural, cloying chill fills the air, and multiple ghostly hands burst from a wall to pummel and grab all within reach._  \n**Unassuming Horror.** The walled horror is an undead that appears to be a normal stretch of wall until it lashes out at passersby.  \n**Tragic Origins.** A walled horror is created when a group of humanoids is bound together and entombed behind a wall in an area with a high concentration of necrotic energy. The humanoids experience profound terror before dying of thirst or suffocation, and their spirits remain trapped within the wall, becoming an undead that seeks to add others to its collection.  \n**Entombed Treasures.** While the spirits of the entombed victims join with the stone and mortar of the wall, their bodies and belongings are left to rot in the cavity behind the wall. When the walled horror is destroyed, it collapses into a pile of rubble, revealing the remains and belongings.  \n**Undead Nature.** A walled horror doesn’t require air, food, drink, or sleep.",
  "name": "Walled Horror",
  "size": "Large",
  "type": "Undead",
  "subtype": "",
  "group": null,
  "alignment": "Chaotic Evil",
  "armor_class": 17,
  "armor_desc": "natural armor",
  "hit_points": 114,
  "hit_dice": "12d8+60",
  "speed": {
    "walk": 0
  },
  "strength": 18,
  "dexterity": 1,
  "constitution": 20,
  "intelligence": 5,
  "wisdom": 8,
  "charisma": 18,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
  "damage_immunities": "necrotic, poison, psychic",
  "condition_immunities": "blinded, deafened, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained, stunned",
  "senses": "truesight 60 ft. (blind beyond this radius), passive Perception 9",
  "languages": "understands all languages it knew in life but can’t speak",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The walled horror makes two spectral claw attacks."
    },
    {
      "name": "Spectral Claw",
      "desc": "Melee Weapon Attack: +7 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) slashing damage plus 4 (1d8) psychic damage, and the target is grappled (escape DC 15).",
      "attack_bonus": 7,
      "damage_dice": "2d6+4"
    },
    {
      "name": "Spectral Scream",
      "desc": "Ranged Spell Attack: +7 to hit, range 60 ft., one creature. Hit: 18 (4d8) psychic damage, and the target must succeed on a DC 15 Charisma saving throw or be frightened until the end of its next turn as it is assaulted by images of being buried alive or entombed. While frightened, the creature's speed is reduced to 0.",
      "attack_bonus": 7,
      "damage_dice": "4d8"
    },
    {
      "name": "Entomb",
      "desc": "The walled horror makes one spectral claw attack against a Medium or smaller creature it is grappling. If the attack hits, the creature is partially entombed in the wall, and the grapple ends. The entombed target is blinded and restrained, and it takes 9 (2d8) psychic damage at the start of each of the walled horror's turns. A walled horror can have only one creature entombed at a time. \n\nA creature, including the entombed target, can take its action to free the entombed target by succeeding on a DC 15 Strength check.\n\nA creature slain while entombed is pulled fully into the wall and can be restored to life only by means of a true resurrection or a wish spell."
    }
  ],
  "bonus_actions": null,
  "reactions": null,
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Spirit-infused Structure",
      "desc": "The walled horror is immobile except for its Wall Hop trait. It uses its Charisma instead of its Dexterity to determine its place in the initiative order."
    },
    {
      "name": "Wall-bound Spirits",
      "desc": "The spirits that make up the walled horror are bound to a 10-foot-by-10-foot panel of wall, behind which their original bodies are trapped. The walled horror can move to nearby walls with its Wall Hop trait, but it can never be more than 120 feet away from its bound wall. If its bound wall is damaged while the walled horror is elsewhere, the walled horror takes half the damage dealt to the bound wall. When the walled horror finishes a long rest while inhabiting its bound wall, any damage to the bound wall is repaired."
    },
    {
      "name": "Wall Hop",
      "desc": "As a bonus action, the walled horror can disappear into the wall and reappear on a 10-foot-by-10-foot stone wall or panel of wood that it can see within 30 feet of it. Claw marks briefly appear on the surface of the origin and destination walls when it uses this trait."
    }
  ],
  "spell_list": [],
  "page_no": 363,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_walled-horror/"
}