{
  "slug": "yathon",
  "desc": "This large, bestial-looking creature is dark gray, with powerful muscles, long arms, sharp claws at the end of five-digit fingers, fine, short fur, and enormous, bat-like wings. Its face is an odd combination of orc and bat. Its brows are heavy, its nose is a snout, and its mouth is full of sharp teeth. Its ears are tall and pointed._  \n**Distantly Related to Orcs.** Yathon seem to have just as much in common with bats as they have with orcs. Their species is a seemingly perfect melding of the two, as they have the power and ferocity of the orc but the communal nature, flying, and sonic perception of a bat. It is unknown if they are the product of some mad wizard’s experiment or if they are simply cousins of orcs.  \n**Communal.** Yathon live in communities of ten to twenty. They are brutal and tribal in nature, and they fight ferociously. Yathon often capture prey in their claws, carry it into the air, and drop it from great heights. Despite their primitive tactics, they have a minor precognition that aids them in battle. This precognition seems to be driven by instinct as much as anything else, but many believe it was a gift from some god.",
  "name": "Yathon",
  "size": "Large",
  "type": "Humanoid",
  "subtype": "",
  "group": null,
  "alignment": "Neutral",
  "armor_class": 15,
  "armor_desc": "natural armor",
  "hit_points": 152,
  "hit_dice": "16d10+64",
  "speed": {
    "fly": 60,
    "walk": 30
  },
  "strength": 21,
  "dexterity": 15,
  "constitution": 18,
  "intelligence": 10,
  "wisdom": 16,
  "charisma": 7,
  "strength_save": null,
  "dexterity_save": null,
  "constitution_save": null,
  "intelligence_save": null,
  "wisdom_save": null,
  "charisma_save": null,
  "perception": null,
  "skills": {},
  "damage_vulnerabilities": "",
  "damage_resistances": "",
  "damage_immunities": "",
  "condition_immunities": "",
  "senses": "blindsight 120 ft. (blind beyond this radius), passive Perception 13",
  "languages": "Common, Orc",
  "challenge_rating": "7",
  "cr": 7,
  "actions": [
    {
      "name": "Multiattack",
      "desc": "The yathon makes two attacks. If it hits a Medium or smaller creature with two claw attacks, the target is grappled (escape DC 15). Until this grapple ends, the target is restrained, the yathon can automatically hit the target with its claws, and the yathon can't make claw attacks against other targets."
    },
    {
      "name": "Claw",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft. or range 5 ft., one target. Hit: 14 (2d8 + 5) slashing damage.",
      "attack_bonus": 8,
      "damage_dice": "2d8+5"
    },
    {
      "name": "Greatsword",
      "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 19 (4d6 + 5) slashing damage.",
      "attack_bonus": 8,
      "damage_dice": "4d6+5"
    },
    {
      "name": "Longbow",
      "desc": "Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 150/600 ft., one target. Hit: 15 (2d8 + 2) piercing damage.",
      "attack_bonus": 5,
      "damage_dice": "2d8+2"
    }
  ],
  "bonus_actions": null,
  "reactions": [
    {
      "name": "Precognition (Recharge 6)",
      "desc": "The yathon catches a glimpse of an attack just before it lands, giving it time to react. When a creature the yathon can see hits it with a melee attack, the attacker has disadvantage on the attack roll. Alternatively, when the yathon misses with a melee weapon attack, it can reroll the attack roll with advantage."
    }
  ],
  "legendary_desc": "",
  "legendary_actions": null,
  "special_abilities": [
    {
      "name": "Echolocation",
      "desc": "The yathon can't use its blindsight while deafened."
    }
  ],
  "spell_list": [],
  "page_no": 378,
  "environments": [],
  "img_main": null,
  "document__slug": "tob2",
  "document__title": "Tome of Beasts 2",
  "document__license_url": "http://open5e.com/legal",
  "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/",
  "v2_converted_path": "/v2/creatures/tob2_yathon/"
}